{"":"0","Video ID":"wAZZ-UWGVHI","Comment":"Let's not forget that Apple Pay in 2014 required a brand new iPhone in order to use it.  A significant portion of Apple's user base wasn't able to use it even if they wanted to.  As each successive iPhone incorporated the technology and older iPhones were replaced the number of people who could use the technology increased.","Likes":"95.0","Sentiment":"1.0"}
{"":"1","Video ID":"wAZZ-UWGVHI","Comment":"Here in NZ 50% of retailers don’t even have contactless credit card machines like pay-wave which support Apple Pay. They don’t like the high fees that come with these.","Likes":"19.0","Sentiment":"0.0"}
{"":"2","Video ID":"wAZZ-UWGVHI","Comment":"I will forever acknowledge this channel with the help of your lessons and ideas explanations, Now It's quite helpful while you'll just sit at your comfort and monitor your account Growth.","Likes":"161.0","Sentiment":"2.0"}
{"":"3","Video ID":"wAZZ-UWGVHI","Comment":"Whenever I go to a place that doesn’t take Apple Pay (doesn’t happen too often), it’s such a drag. Between ‘contactless Covid’ habits and my getting the Apple Card, I’ve gotten so used to Apple Pay that I get seriously annoyed when a store doesn’t take it. It feels like a shock, it’s crazy how quickly it took over my shopping routine! I’ve officially been brainwashed by Apple because now it feels so inconvenient to even carry a physical card in my pocket.","Likes":"8.0","Sentiment":"0.0"}
{"":"4","Video ID":"wAZZ-UWGVHI","Comment":"Apple Pay is so convenient, secure, and easy to use. I used it while at the Korean and Japanese airports, no need for physical credit cards.","Likes":"34.0","Sentiment":"2.0"}
{"":"5","Video ID":"wAZZ-UWGVHI","Comment":"We’ve been hounding my bank to adopt Apple pay. I understand why they don’t want to do it with the extra fees, but its just so easy and quick at the checkout.","Likes":"8.0","Sentiment":"1.0"}
{"":"6","Video ID":"wAZZ-UWGVHI","Comment":"We only got Apple Pay in South Africa in 2020/2021 and it’s widely accepted.","Likes":"29.0","Sentiment":"2.0"}
{"":"7","Video ID":"wAZZ-UWGVHI","Comment":"For now, I need both Apple Pay and the physical credit card.","Likes":"7.0","Sentiment":"1.0"}
{"":"8","Video ID":"wAZZ-UWGVHI","Comment":"In the United States, we have an abundance of retailers that accept Apple Pay, but it's still good to carry the physical card with you, being there are still a large quantity of places that do NOT accept Apple Pay.","Likes":"2.0","Sentiment":"2.0"}
{"":"9","Video ID":"wAZZ-UWGVHI","Comment":"In Cambodia, we have a universal QR code system, we scan and send money back and forth, all banks take no profit from merchant, they receive 100% of the payment. A lot of stores and supermarkets start abandon POS machine all together.","Likes":"28.0","Sentiment":"1.0"}
{"":"10","Video ID":"b3x28s61q3c","Comment":"Wow, you really went to town on the PSU test rack. That's a serious bit of kit. Very flexible, good choices. Wouldn't surprise me if Choma start offering this bespoke rack to the PSU makers. They all watch your videos, so they'll want to make sure it passes on this exact same rack. You can really push the industry here. Well done. Open source the test interface hardware and software.","Likes":"1344.0","Sentiment":"2.0"}
{"":"11","Video ID":"b3x28s61q3c","Comment":"The lab is the most exciting thing in IT I've seen for a while. This is reallly going to shake up how the qualiity of even basic components are manufactured.","Likes":"198.0","Sentiment":"2.0"}
{"":"12","Video ID":"b3x28s61q3c","Comment":"Linus, I'm an engineer and love the LMG content across all the channels.  Very much looking forward to more lab content and hope your engineering team will get more on camera time and hosting roles.","Likes":"365.0","Sentiment":"2.0"}
{"":"13","Video ID":"b3x28s61q3c","Comment":"There used to be a time where Linus was the smartest guy in the room, this video clearly shows that the team he has built are experts in their respective fields and make Linus look like a child. Kudos to Linus and LMG, you've grown beyond what I imagined. All the best!","Likes":"211.0","Sentiment":"2.0"}
{"":"14","Video ID":"b3x28s61q3c","Comment":"Holy crap. I was looking at Chroma systems back when I was designing power supplies. Looks like you guys went all out! Re the multimeter: Most oscilloscopes are terrible for making accurate voltage measurements (8-10 bit ADCs). They are just for looking at the waveforms.","Likes":"821.0","Sentiment":"0.0"}
{"":"15","Video ID":"b3x28s61q3c","Comment":"I love the direction this channel is going. Most tech channels, even the best trusted ones are going to review products based on their own experience or at most some things they can measure with their pc, but you're really going to mathematically demonstrate if a product is a quality one and why it is, love it","Likes":"150.0","Sentiment":"2.0"}
{"":"16","Video ID":"b3x28s61q3c","Comment":"I am more excited for the LTT Lab than I have been for a lot of content for a while now. As everyone seems to be saying, it's exciting to see how enthusiastic this new crew is to get things running.","Likes":"49.0","Sentiment":"2.0"}
{"":"17","Video ID":"b3x28s61q3c","Comment":"I adore the working relationship Linus has with his team. 99% of employees walk on eggshells around their boss and I wish it could be more like this.","Likes":"19.0","Sentiment":"2.0"}
{"":"18","Video ID":"b3x28s61q3c","Comment":"LMGs growth is honestly something to truly aspire for, this IS the content we want to watch. \n\nMore technical, in depth, engineering oriented and science-based content will make us consumers much much more educated on these topics thus when picking a product not only will we pick the best choice but we'll know exactly why we picked it (which helps greatly with buyers remorse).","Likes":"17.0","Sentiment":"2.0"}
{"":"19","Video ID":"b3x28s61q3c","Comment":"I love all the people LTT has added for labs. Clearly they're knowledgeable and passionate about tech! Labs is gonna be killer. Love it!","Likes":"2808.0","Sentiment":"2.0"}
{"":"20","Video ID":"4mgePWWCAmA","Comment":"Linus!!! Just turn the key lights  180 and bounce them off the walls. You’ll get a much softer glow and shadow and way more even lighting. It’s such a simple fix. I’m not sure where along the lines people got the idea to beam the lights directly at your face 😅","Likes":"456.0","Sentiment":"2.0"}
{"":"21","Video ID":"4mgePWWCAmA","Comment":"Dan continues to be my new favorite, he has such an air of confidence about him and a comforting presence. Like Dan shows up and you just know things are going to be fine.","Likes":"962.0","Sentiment":"2.0"}
{"":"22","Video ID":"4mgePWWCAmA","Comment":"Dan managing to set up his soldering station on the one box they needed was incredibly amusing to me","Likes":"518.0","Sentiment":"2.0"}
{"":"23","Video ID":"4mgePWWCAmA","Comment":"Linus: *Gets on his employee's cases for all the stuff stolen from the office*\nAlso Linus: *Proudly talks about all the stuff stolen from work he's using in his upgraded setup*\n\nLinus: \"Why are you using this monitor as a table?\"\nAlso Linus: *Uses the monitor as a chair* \n\nThis video was hilarious","Likes":"194.0","Sentiment":"2.0"}
{"":"24","Video ID":"4mgePWWCAmA","Comment":"Linus: \"This is not a table.\"\nAlso Linus: Let's use this as a chair!","Likes":"304.0","Sentiment":"1.0"}
{"":"25","Video ID":"4mgePWWCAmA","Comment":"Dan the man. Saving the day. Riley needs to give him his own theme like Brian the Electrician.","Likes":"3371.0","Sentiment":"2.0"}
{"":"26","Video ID":"4mgePWWCAmA","Comment":"Dan continues to be a favourite for me. He's like the incredibly patient, but long-suffering Dad, who just gets on with things","Likes":"36.0","Sentiment":"2.0"}
{"":"27","Video ID":"4mgePWWCAmA","Comment":"Dan is a treasure. Your channel has long lacked a Mr. fixit type and while I am sad it's not me, Dan appears quite capable and funny.","Likes":"134.0","Sentiment":"2.0"}
{"":"28","Video ID":"4mgePWWCAmA","Comment":"Blows my mind how quickly Dan became the \"rock\" upon which all things Linus stands...Love it","Likes":"274.0","Sentiment":"2.0"}
{"":"29","Video ID":"4mgePWWCAmA","Comment":"Hey Linus, a good trick for streaming lights: bounce them off the wall.  Much easier on the eyes, and a nice softer look.\nAlso, for indoors, I'd recommend a hyper-cardioid mic (looks like a short shotgun) like the Audio-Technica AT4053B.","Likes":"13.0","Sentiment":"2.0"}
{"":"30","Video ID":"kXiYSI7H2b0","Comment":"Unstoppable experiments with liquid nitrogen 🎉🎉🔥🔥🔥","Likes":"182.0","Sentiment":"2.0"}
{"":"31","Video ID":"kXiYSI7H2b0","Comment":"\"one of the best things about dude is that he never takes credit for himself wheb he achieves something. He always respect us. the audience, and his  team, and he is always polite is all of his videos. We congratulate ourselves on this achievement. More to Come and everything to🇮🇳\"\"","Likes":"63.0","Sentiment":"2.0"}
{"":"32","Video ID":"kXiYSI7H2b0","Comment":"Liquid nitrogen ഇതുവരെ തീർന്നില്ലേ മച്ചാനെ.......😂❤️","Likes":"3660.0","Sentiment":"1.0"}
{"":"33","Video ID":"kXiYSI7H2b0","Comment":"Liquid nitrogen never ends🤗\nM4tech poli😎😎","Likes":"534.0","Sentiment":"2.0"}
{"":"34","Video ID":"kXiYSI7H2b0","Comment":"29minutes 48k views 9.3k likes 👍🏻 that is the power of M4Tech","Likes":"46.0","Sentiment":"2.0"}
{"":"35","Video ID":"kXiYSI7H2b0","Comment":"😻😅 കേരളത്തിൽ ആദ്യമായി പെട്രോളിനെ എയ്സ് ആക്കിയ M4Tech മച്ചാന്മാർ 💞🔥🔥💥","Likes":"380.0","Sentiment":"1.0"}
{"":"36","Video ID":"kXiYSI7H2b0","Comment":"Epozhum safety is first priority.... goggles on😂❤️","Likes":"21.0","Sentiment":"2.0"}
{"":"37","Video ID":"kXiYSI7H2b0","Comment":"Congratulations m4tech for achieving 8 million subscribers","Likes":"49.0","Sentiment":"2.0"}
{"":"38","Video ID":"kXiYSI7H2b0","Comment":"തന്നെ തളർത്താൻ നോക്കിയവർ പോലും അവന്റെ ഉയർച്ചയിൽ പകച്ച് നിന്നു പോയി 🔥🔥\nകഷ്ടപ്പാടും അദ്ധ്വാനവുംകൊണ്ട് 2 പേർ പടുത്തുയർത്തിയ ചാനൽ M4 TECH 💛💛","Likes":"278.0","Sentiment":"1.0"}
{"":"39","Video ID":"kXiYSI7H2b0","Comment":"എത്ര എടുത്താലും തീരാത്ത liquid nitrogen 😂","Likes":"75.0","Sentiment":"1.0"}
{"":"40","Video ID":"ErMwWXQxHp0","Comment":"Guys, a quick note that you do NOT need all the high-end tech in order to do well at college. If you can (and you should), save as much money as you can while at college, pay your tuition in full and student loans as soon as possible instead of spending on liabilities like gadgets. Get the bare minimum you need and only spend money on products you know you are going to be using for 4-6 years (such as laptop). Don't overspend on phone, headphones, lamps, tablets, etc.","Likes":"23964.0","Sentiment":"1.0"}
{"":"41","Video ID":"ErMwWXQxHp0","Comment":"this is hilarious. i was in a focus group over 4 years ago for Best Buy where they were asking college students how to advertise for Back to School. One of the kids next to me said \"Maybe you should have someone like MKBHD talk about your products\". Well... here we are","Likes":"415.0","Sentiment":"1.0"}
{"":"42","Video ID":"ErMwWXQxHp0","Comment":"Everyone has been saying it but I’ll throw my hat in as well. To any prospective college students, you DO NOT need to spend money on flagship products. I am about to graduate with a business degree and have been using a 7 year old laptop and the base iPad from late 2020. Both products have worked flawlessly and I have no intention of replacing them. The recommendations listed are ones I would never be able to afford even with my job I’m working as well. Do your own research on forums to see what your peers say the best value product is. I promise that if you buy a flagship product you will quickly see that you did not need it.","Likes":"35.0","Sentiment":"2.0"}
{"":"43","Video ID":"ErMwWXQxHp0","Comment":"Shoutout to my OnePlus phone and Huawei laptop for getting me through university feeling premium for MUCH less. Bonus ups for Ikea's articulating lamps ($20 and I can see all my homework incredibly well without eye strain), the old door I refinished to use as a desktop, and wired earbuds under hardware store earmuffs as my \"noise-cancelling headphones.\" And the same 2 sets of Hanes underwear from target for also lasting the whole ride.","Likes":"233.0","Sentiment":"2.0"}
{"":"44","Video ID":"ErMwWXQxHp0","Comment":"BEST BUY: We want to sponsor a back to school type video. But you can only push the high end stuff.\nMarques: say less","Likes":"104.0","Sentiment":"1.0"}
{"":"45","Video ID":"ErMwWXQxHp0","Comment":"Most of the items you recommend are pretty pricey for a student. I'm not a student myself anymore but if I were one, more budget alternatives would make this video a lot better!","Likes":"2106.0","Sentiment":"1.0"}
{"":"46","Video ID":"ErMwWXQxHp0","Comment":"You don't necessarily need the high-end and latest tech for University.  I used a 2009 macbook pro throughout my years at uni , had an iphone 6 and it worked out just fine. What's important is to remain focused on getting that degree and graduating.","Likes":"135.0","Sentiment":"2.0"}
{"":"47","Video ID":"ErMwWXQxHp0","Comment":"Personally I feel like this is really out of touch. Most students won't be able to afford these. In case anyone needs it: I believe Dave2D's back to school video are honestly the best ones I've seen on the topic. Consider checking them out too before making a purchase decision.","Likes":"17.0","Sentiment":"2.0"}
{"":"48","Video ID":"ErMwWXQxHp0","Comment":"Hey everyone. Good take on the video and love the recommendations. If you plan on making another video such as this, maybe you can also include some more budget options and best value options. \n\nWhat I can tell from my years of studying in college and university is that your tech and needs will be based on what courses/programme you took for your education.\nEngineering students require computer specs that can run BIM software. I'm not sure about the other programmes but from what I can see that most students at my place has 8GB of RAM for their laptops.\n\nAlso, here is my setup during my university years. Hope it can help anyone who are looking to buy something for their college/university years. All the best.\n\nLaptop - ASUS X455L (Upgraded to SSD with additional RAM)\nPhone - Vivo Y69/Redmi 10/Samsung A22 4G\nMouse - Logitech G102\nKeyboard - Tecware TKL ver","Likes":"82.0","Sentiment":"2.0"}
{"":"49","Video ID":"ErMwWXQxHp0","Comment":"I have used Galaxy Tab S7 during my Ph.D. It's been a lifesaver for me. First of all, it is really good for reading journals, note taking and scribbling on the pdf's, secondly, it doesn't strain your eye that much when you use a computer or a laptop always at a fixed distance, thirdly you get the premium version of noteshelf free with Tab s7 and lastly if you are from a STEM background and use a lot of illustrations or flow process diagrams, you can draw those easily with the stylus on Tab s7. I choose tab s7 over Apple Ipad Air for its ease of use, user interface, and cost (you get stylus for free with Tab S7 and in most cases keyboard too with a huge student discount).","Likes":"126.0","Sentiment":"2.0"}
{"":"50","Video ID":"18fwz9Itbvo","Comment":"When he says he's a 400 year old beer wizard, I believe him.","Likes":"5092.0","Sentiment":"1.0"}
{"":"51","Video ID":"18fwz9Itbvo","Comment":"This series is exactly what career day should've been, such interesting and knowledgeable people!","Likes":"765.0","Sentiment":"2.0"}
{"":"52","Video ID":"18fwz9Itbvo","Comment":"Regarding Cans vs. Bottles: At least in Germany the bottle is more environmentally friendly, since they get used again and again. You bring the empty bottles to the local grocery shop, they then get sent to a cleaning plant, where they pressurewash the bottles inside and out with steaming hot water. Afterwards they get reused for beer. The size and shape of most bottles is according to a standard, so different brewers use the same bottles.\n\nIt's far less energy intense than smelting and remanufacturing cans.","Likes":"693.0","Sentiment":"1.0"}
{"":"53","Video ID":"18fwz9Itbvo","Comment":"How does every person WIRED brings on this show act like they've been in front of cameras 5,000 times?","Likes":"263.0","Sentiment":"0.0"}
{"":"54","Video ID":"18fwz9Itbvo","Comment":"idk who’s picking these people, but give them a raise","Likes":"8073.0","Sentiment":"1.0"}
{"":"55","Video ID":"18fwz9Itbvo","Comment":"His face when describing hops killed me. “Some of them smell pretty… *Dank* “😂😂😂😂😂😂😂","Likes":"533.0","Sentiment":"0.0"}
{"":"56","Video ID":"18fwz9Itbvo","Comment":"Seasoned craft brewery tour guide here, and I’m so glad he ended on “Drink what you like.” Sometimes people get weirdly judgmental about the beer preferences of others. At the end of the day, there are hundreds of beer styles for a reason, so everyone can find at least one style they actually like.","Likes":"127.0","Sentiment":"2.0"}
{"":"57","Video ID":"18fwz9Itbvo","Comment":"This guy is a total bro. Not snobby at all and just wants people to enjoy beer in whatever way they want. Such a contrast with your stereotypical beverage elitists.","Likes":"150.0","Sentiment":"2.0"}
{"":"58","Video ID":"18fwz9Itbvo","Comment":"Y’all be picking the literal best professionals for these videos. Not only is everyone knowledgeable but they all seem passionate and eager to teach us.","Likes":"75.0","Sentiment":"2.0"}
{"":"59","Video ID":"18fwz9Itbvo","Comment":"This guy has a face made for movies, a voice made for radio, and a great personality!  I wanna see more of Garrett!","Likes":"1584.0","Sentiment":"2.0"}
{"":"60","Video ID":"jXf04bhcjbg","Comment":"Whenever we get people young enough to actually understand the internet, these giant tech companies might be broken up but as long as we have 90 year old senators asking tech CEOs how the internet works nothing will get done.","Likes":"10826.0","Sentiment":"0.0"}
{"":"61","Video ID":"jXf04bhcjbg","Comment":"I live for John's roasts of AT&T.","Likes":"787.0","Sentiment":"2.0"}
{"":"62","Video ID":"jXf04bhcjbg","Comment":"Mad respect to John Oliver and his team for not making us watch ads during the show. Major props.","Likes":"395.0","Sentiment":"2.0"}
{"":"63","Video ID":"jXf04bhcjbg","Comment":"One important aspect I'm surprised was left out is that many of these companies (like Amazon) literally power the internet. Almost 30% of the websites on the internet are stored on Amazon servers, giving them even more access to data trends and physical control over the internet.","Likes":"674.0","Sentiment":"2.0"}
{"":"64","Video ID":"jXf04bhcjbg","Comment":"Shout to you John Oliver for giving me a brief trip down memory lane.  I've been in the telecommunications industry for almost 25 years - and my first job was at....MCI.  Great company that got swallowed up in a horrible merger with WorldCom.  Bing it and see how that disaster played out.","Likes":"196.0","Sentiment":"1.0"}
{"":"65","Video ID":"jXf04bhcjbg","Comment":"Back in 2018 when John Oliver did the episode on Corporate Consolidation it inspired me so much that I applied for a Masters of Research program, got into a program, and did my entire research thesis on tech oligopolies. It was shocking to see how bad it really is; oligopolies that bordered in monopolies are rampant. My research essentially focused on the question of whether lack of enforcement of our antitrust laws caused this whole problem or whether lack of adequate laws were the core of the issue. The answer was that it was truly both. I thoroughly enjoyed my pre-doctoral masters thesis and am considering a PhD in the future. It's so lovely to see John talk about this, specifically on the tech sector!\n\nEdit: Wow! Thanks everyone for the great comments! I haven't published it yet, otherwise I would share it with all you lovely people ❤ I am now looking for a policy or qualitative research/analyst job so if anyone is hiring, let me know 😅","Likes":"6138.0","Sentiment":"0.0"}
{"":"66","Video ID":"jXf04bhcjbg","Comment":"John Oliver deserves an Oscar for his 'Can Dolphins love you?\" monologue","Likes":"75.0","Sentiment":"2.0"}
{"":"67","Video ID":"jXf04bhcjbg","Comment":"I would love to see these bills live. I live in a country where we had one company try and rule the internet, charging outrageous prices for it. They had specifically bought the copper network to do it. The government of NZ denied that as a defense as they were monopolising it, and forced them to open up. Suddenly it turned out it DIDN'T cost $300 to connect to unlimited internet, you could get that for $80!","Likes":"38.0","Sentiment":"1.0"}
{"":"68","Video ID":"jXf04bhcjbg","Comment":"Hey, something that might interest you. A couple of days ago my Amazon account was closed with no warning for after hours of wasted time they're telling me it's for excessive returns which I think is an error but that's beside the point. When they closed my Amazon account all my Amazon devices that I own for years primarily all my Echo devices stopped working. I lost access to the Amazon Photos and Prime Video which I pay for. So apparently the devices you already own are subject to be disabled by Amazon on your perceived shopping habits! I assume the same applies to all other Amazon devices and services like fire OS tablets, Ring cameras, and probably AWS as well. Just wanted to make other people aware of this because they definitely don't tell you this when you buy your hardware and services.","Likes":"19.0","Sentiment":"0.0"}
{"":"69","Video ID":"jXf04bhcjbg","Comment":"Points that were missed: \n\n- Apple arguably has a specific Monopoly in the US with smartphones because of iMessage not being open with other multi-platform messaging apps. This weirdly only applies in the States. The rest of the world favours things like WhatsApp and Facebook messenger ( both owned by meta, Which is its own issue). That's probably the main defence Apple will bring up. \n\n- they've been in trouble before but don't forget about Microsoft, Windows 11 has seen them go back to some of their old tricks like a favouring their own software and making it difficult to remove. \n\n- this kind of got glossed over but although Google play takes the same cut for purchases as Apple, you are free to install other app stores and install apps from wherever you like, so they avoid the heat there. Google play is still the most preferred store on Android phones, so Google likely takes advantage of that fact in promoting its own software.","Likes":"67.0","Sentiment":"1.0"}
{"":"70","Video ID":"2TqOmtTAMRY","Comment":"Hey hey, just a heads up, I DID turn the LED Hoodie on, it's just not very bright hen you're looking face-on at it! (you can still sort of see it on around the hood area though)! 🙌\nIf you had fun on this video, here's my collection of \"Extreme Unboxing\" videos: https://www.youtube.com/watch?v=nmY2kgWYwyQ&list=PLflqtq8EOGAL_OmnMixISKvdDwvWvoQGs&index=2","Likes":"2460.0","Sentiment":"2.0"}
{"":"71","Video ID":"2TqOmtTAMRY","Comment":"The safety belt would've paired perfectly with the unicycle and those roller boot things","Likes":"6495.0","Sentiment":"2.0"}
{"":"72","Video ID":"2TqOmtTAMRY","Comment":"That was seriously the most enjoyable thing I've seen in awhile. I forgot how rad this channel is. Well done sir.","Likes":"84.0","Sentiment":"2.0"}
{"":"73","Video ID":"2TqOmtTAMRY","Comment":"Dude, I love how genuine your reactions were! I've had fun watching this, and not only: I was really interested to see what each one of those gadgets did.","Likes":"14.0","Sentiment":"2.0"}
{"":"74","Video ID":"2TqOmtTAMRY","Comment":"Infinity Dodecahedrons are seriously cool. I bought another (smaller) one, and I really enjoy it. It's definitely an eye catcher and a conversation starter!","Likes":"13.0","Sentiment":"2.0"}
{"":"75","Video ID":"2TqOmtTAMRY","Comment":"I personally enjoy the old school phones.  I have such a hard time hearing my iPhone at max volume without the speaker on.  If I worked in an office I would definitely buy one.  People forget how ergonomic those old phones are.  It's not particularly comfortable holding a rectangle to your head.  I also have physically sensitive ears so any type of headphones, ear phones, whatever... cause me a bunch of pain.  Looks like a good product that can both be a gag and something for people out there like me who have a tough time using a regular mobile phone.","Likes":"7.0","Sentiment":"2.0"}
{"":"76","Video ID":"2TqOmtTAMRY","Comment":"The fact he didn't buy the Nicholas Cage spoon is outrageous.","Likes":"2389.0","Sentiment":"0.0"}
{"":"77","Video ID":"2TqOmtTAMRY","Comment":"I have to say it after watching this video it feels like the journey you're on this year has been effective. It simply feels like you're enjoying life and its what I enjoy most about watching your videos. You manage to pass that joy on. Just the musings of a random stranger. 😀","Likes":"11.0","Sentiment":"2.0"}
{"":"78","Video ID":"2TqOmtTAMRY","Comment":"I haven't laughed like this for years! Oh my gosh Arun, you've nailed this one! - Wendi 🤣","Likes":"5.0","Sentiment":"2.0"}
{"":"79","Video ID":"2TqOmtTAMRY","Comment":"Quality quality quality is everything about this channel. Arun makes my mood happier video after video. Let's be searious, the best part about this channel is Arun making his jokes and when he shows tech.","Likes":"2.0","Sentiment":"2.0"}
{"":"80","Video ID":"wLlL46pYcg4","Comment":"15. Spin Launch - 0:15\n14. Graphene - 1:59\n13. GPS 3 - 3:33\n12. Floating Farms - 4:53\n11. Edge Computing - 6:21\n10. Self-Healing Concrete - 8:11\n  9. Hydrogen Fuel Cells - 9:36\n  8. Satellite Constellations - 11:02\n  7. GPT-3 - 12:17\n  6. Connected Homes - 13:33\n  5. Lithium Metal Battery - 14:46\n  4. 3D Printing - 15:59\n  3. Blockchain - 17:14\n  2. Fighting Fire with Sound - 18:27\n  1. Quantum Computing - 19:39","Likes":"600.0","Sentiment":"1.0"}
{"":"81","Video ID":"wLlL46pYcg4","Comment":"\"If machines produce everything we need, the outcome will depend on how things are distributed. Everyone can enjoy a life of luxurious leisure if the machine-produced wealth is shared, or most people can end up miserably poor if the machine-owners successfully lobby against wealth redistribution. So far, the trend seems to be toward the second option, with technology driving ever-increasing inequality.\" -- Stephen Hawking","Likes":"103.0","Sentiment":"1.0"}
{"":"82","Video ID":"wLlL46pYcg4","Comment":"as somebody with a comp sci degree and a decent amount of irl experience i will say edge computing is problematic at its core because client side workload like this is a huge security breach.  this is why even online video games avoid client side scripting.  it is a huge vector for exploit.  it is always interesting to watch a video like this because you are blown away when you listen regarding these other technologies you may not know allot about but when they cover a technology you know about you realize you must question the quality of the info in the other cases where you cannot determine the quality yourself","Likes":"337.0","Sentiment":"0.0"}
{"":"83","Video ID":"wLlL46pYcg4","Comment":"7:15 edge of the cloud 9:30 hydrogen fuel cell 11:00 star link 12:45 AI  GPT 3 14 50 lithium ion battery  17:20 block chain 19:50 quantum computing.","Likes":"0.0","Sentiment":"1.0"}
{"":"84","Video ID":"wLlL46pYcg4","Comment":"Self-Healing Concrete is on paper a really good idea. There is just one small problem with it and comes from the fact that we are not using limestone for buildings as limestone has this one tiny problem with being rather frail. Yes it will make the concrete last a big longer, but it will also make it harder to see where the weaknesses of the structure is and only really postpone the disaster, if at all.","Likes":"45.0","Sentiment":"1.0"}
{"":"85","Video ID":"wLlL46pYcg4","Comment":"I've read that hydrogen can work it's way through any container material. In your piece about graphen it was  stated that it is impermiable to gases -- even the lightest one. Assuming the narrator meant hydrogen, it might be a solution to the long term storage of hydrogen, perhaps.","Likes":"6.0","Sentiment":"1.0"}
{"":"86","Video ID":"wLlL46pYcg4","Comment":"The fire suppression without water was incredible. It could save many lives and property especially if it could be auto activated like a heat detector. Imagine how much property and how many sleeping people could be saved, especially if this had a built in alarm and was rigged to keep hallways clear of fire. What an invention....WOW.","Likes":"51.0","Sentiment":"2.0"}
{"":"87","Video ID":"wLlL46pYcg4","Comment":"I'd really appreciate a study into the potential advantages of META Materials in manipulating light, EMF, heat and even replacing silicon as semiconductors. Nearly every industry can benefit from the improvements and cost reductions, META Materials can provide. Really enjoy your videos, thank you!","Likes":"12.0","Sentiment":"2.0"}
{"":"88","Video ID":"wLlL46pYcg4","Comment":"I was totally shocked that Fusion power generation wasn't included - possibly as big a leap as quantum computing in its impact on humanity.","Likes":"47.0","Sentiment":"0.0"}
{"":"89","Video ID":"wLlL46pYcg4","Comment":"I love the one about the hydrogen fuel cells....Considering this technology has been around for about 20 years...Just hasn't been used, due to a lack of pressure on the industry, and the fact that the patent was buried by large corporate interests.","Likes":"4.0","Sentiment":"2.0"}
{"":"90","Video ID":"R7qsau3X6Ks","Comment":"I like the meme that says, ‘if it bites you and you die, it’s venomous; if you bite it and you die, it’s poisonous.’ I actually think it sums it up pretty clearly.","Likes":"4026.0","Sentiment":"1.0"}
{"":"91","Video ID":"R7qsau3X6Ks","Comment":"I wish that when people talked about types of skin damage, they'd acknowledge what that looks like for people with darker skin. we don't get red rashes after sunburn. even my darkest bruises are often difficult to spot because of hyper-pigmentation. the stages of healing for cuts looks vastly different because we don't see the same change in colors around the wound sight. not to mention when you look for images to identify clinical signs, 99% of those images are of lighter skin and only marginally helpful to us looking to identify potentially serious medical issues.","Likes":"1038.0","Sentiment":"0.0"}
{"":"92","Video ID":"R7qsau3X6Ks","Comment":"She has a very effective way of delivering information in a way that is accessible. Love her!","Likes":"1812.0","Sentiment":"2.0"}
{"":"93","Video ID":"R7qsau3X6Ks","Comment":"\"If the lead singer is Bret Michaels then I'm sure it is Poison\". That had me laughing for ages 🤣","Likes":"2369.0","Sentiment":"2.0"}
{"":"94","Video ID":"R7qsau3X6Ks","Comment":"Anne is so cool she makes me want to reevaluate my life choices and return to college to become a toxicologist.","Likes":"892.0","Sentiment":"2.0"}
{"":"95","Video ID":"R7qsau3X6Ks","Comment":"Poison Support is one of the more interesting ones of this series I'm glad to see Anne back in the seat and schooling us.  Hoping for more!","Likes":"601.0","Sentiment":"2.0"}
{"":"96","Video ID":"R7qsau3X6Ks","Comment":"My son had botox injections in his legs for years to relax his muscles enough so he could wear splits. He has cerebral palsy. It's crazy knowing that this life changing treatment is also the most dangerous poison.","Likes":"885.0","Sentiment":"0.0"}
{"":"97","Video ID":"R7qsau3X6Ks","Comment":"My mom would've gone nuts for you while I was growing up lol. Her big \"parent fear\" was toxic chemicals and me getting poisoned so she was always lecturing me about stuff under the sink and making sure I didn't touch the pesticides for the farm. Once she figured out she could call PBS and they'd send her Mr. Yuck stickers the house and barn were *covered* in them","Likes":"309.0","Sentiment":"0.0"}
{"":"98","Video ID":"R7qsau3X6Ks","Comment":"I love how she says that it is poison in the right dose, instead of the wrong dose.","Likes":"120.0","Sentiment":"2.0"}
{"":"99","Video ID":"R7qsau3X6Ks","Comment":"My husband got sun poisoning last year. All the symptoms you described. It was not fun. He said his sick were he got burned felt tight for a few months after. Luckily he is a nurse and he was able to give me advice on how to help him in his recovery.","Likes":"281.0","Sentiment":"0.0"}
{"":"100","Video ID":"MEiq0oCUb_8","Comment":"The monitor looks pretty average size until Marques reaches his whole extended arm towards it and points out the 27” screen size and suddenly you realize… it’s a 55” monitor 🤯","Likes":"3480.0","Sentiment":"1.0"}
{"":"101","Video ID":"MEiq0oCUb_8","Comment":"Marques does a fantastic job highlighting the features of the Link. If you're looking for the next level of webcam look no further 😏 dope tech, dope video","Likes":"403.0","Sentiment":"2.0"}
{"":"102","Video ID":"MEiq0oCUb_8","Comment":"The camera is amazing! And there are so many people who could benefit from it A LOT","Likes":"243.0","Sentiment":"2.0"}
{"":"103","Video ID":"MEiq0oCUb_8","Comment":"I’ve been playing with the Insta360 Link for about a week now. As a college professor and edtech trainer, I can tell you that this is a complete game changer for online and hybrid teaching.  Switching from follow mode to whiteboard mode to top-down mode for demos etc. is a purely magical experience.","Likes":"72.0","Sentiment":"2.0"}
{"":"104","Video ID":"MEiq0oCUb_8","Comment":"I honestly have to say, while its still insanely expensive, 3500 for that monitor isn't as bad as I was expecting. And its almost 'reasonable'. Like, its still more than I would ever spend on a single display, and I'm far more into having separate displays but, given what its capable of, the specs, the tech behind it etc. its not that bad. I can see a few people getting real use out of something like that,.","Likes":"160.0","Sentiment":"2.0"}
{"":"105","Video ID":"MEiq0oCUb_8","Comment":"Imagine losing the cursor on that screen and trying to find it 💀","Likes":"8968.0","Sentiment":"0.0"}
{"":"106","Video ID":"MEiq0oCUb_8","Comment":"This Monitor is perfect for streaming. Three 27“ monitors in one is amazing 🤯\nBut man is it expensive 😭","Likes":"74.0","Sentiment":"2.0"}
{"":"107","Video ID":"MEiq0oCUb_8","Comment":"I can see this being good for editing and streaming reading the chat and playing the game on one screen. This is genius!!","Likes":"2.0","Sentiment":"2.0"}
{"":"108","Video ID":"MEiq0oCUb_8","Comment":"Geez, I need a dedicated studio for all of this dope tech in my future","Likes":"1.0","Sentiment":"2.0"}
{"":"109","Video ID":"MEiq0oCUb_8","Comment":"this has gotta be one of the best dope techs, everything here is a hit that i’m def writing down for later","Likes":"19.0","Sentiment":"2.0"}
{"":"110","Video ID":"pT_9hntWj34","Comment":"I’m always looking forward to these every month so thank you for making them. Honestly that little lamp and speaker caught my eye. The flickering is really cool to me and the speaker is a nice extra.","Likes":"317.0","Sentiment":"2.0"}
{"":"111","Video ID":"pT_9hntWj34","Comment":"The sound test killed me, that was hilarious. And the wrist rest is brilliant, I often get marks on my wrist from my mousepad.","Likes":"118.0","Sentiment":"2.0"}
{"":"112","Video ID":"pT_9hntWj34","Comment":"What a tough selection this month! Whether it be the soundbar, the lamp speaker or even the pc panel display they all seem something that would really improve my set up, but for me it may have to be the soundbar one,  looks smart, has nice RGB and a decent size and price. Very good month of tech this month!","Likes":"7.0","Sentiment":"2.0"}
{"":"113","Video ID":"pT_9hntWj34","Comment":"I absolutely love this series!  All of the items were neat but the only one I would actually benefit from would be the chair wheels.  I have a regular office chair that has to roll on carpet and it is kind of a pain.","Likes":"5.0","Sentiment":"2.0"}
{"":"114","Video ID":"pT_9hntWj34","Comment":"That sensor panel is definitely convenient. Been wanting to make my own with a raspberry pi but just find myself getting off track. Super cool to just be able to purchase and go!","Likes":"10.0","Sentiment":"2.0"}
{"":"115","Video ID":"pT_9hntWj34","Comment":"The RGB sound bar would be perfect for my setup! I’ve been using the speakers in my monitor as my main sound system, so it would be a nice upgrade for me.","Likes":"2.0","Sentiment":"2.0"}
{"":"116","Video ID":"pT_9hntWj34","Comment":"I always love franks energy i also look forward to the end of every month thinking about this series i love the tiltednation sound-bar and i need that for my set up😀😀.","Likes":"2.0","Sentiment":"2.0"}
{"":"117","Video ID":"pT_9hntWj34","Comment":"always great to see this series, so many cool things this month, my office setup could use those chair wheels.","Likes":"4.0","Sentiment":"2.0"}
{"":"118","Video ID":"pT_9hntWj34","Comment":"This series has helped me and my friends find some helpful tech that has helped our setups! The pc panel is gonna be a huge upgrade","Likes":"2.0","Sentiment":"2.0"}
{"":"119","Video ID":"pT_9hntWj34","Comment":"We need the under $100 for August as well!! This is the best series out there✌️🔥","Likes":"86.0","Sentiment":"2.0"}
{"":"120","Video ID":"cj4lxmHQV0o","Comment":"One really important point: those ionizers can produce potentially dangerous levels of ozone due to the negative ions they create in the air. I'd be cautious of all air ionizers, unless they are advertised specifically as bipolar ionizers. The one that you recommended DOES produce ozone, which can be very harmful","Likes":"1753.0","Sentiment":"0.0"}
{"":"121","Video ID":"cj4lxmHQV0o","Comment":"Been a good while since I've been a student but I still watched the vid to find out what cool gadgets are out there. Didn't think I'd be walking away from it with a productivity tip, that idea of the simple timer is so good, instead of devices that can also do time. Great vid ,Frank.","Likes":"46.0","Sentiment":"2.0"}
{"":"122","Video ID":"cj4lxmHQV0o","Comment":"The desktop lamp is definitely my favorite. It’s also something I’ve been looking for because I updated to a keyboard that doesn’t have shine through keycaps so it’s definitely a need too.","Likes":"13.0","Sentiment":"2.0"}
{"":"123","Video ID":"cj4lxmHQV0o","Comment":"I’m not a student, however I always love seeing the tech. Always looking to change and upgrade my desk setup for work!","Likes":"5.0","Sentiment":"2.0"}
{"":"124","Video ID":"cj4lxmHQV0o","Comment":"Fantastic video Frank. You always bring really cool stuff to the front that most of us haven't seen/heard anything about. Hope you and the fam are doing well XD\nBtw, that kb for only $100? I know they've gotten a lot cheaper but hot damn. I don't NEED it but I want it lol. My biggest complaint with 60% kb's is the lack of arrow keys and this has those and looks super sleek with those colors. Love it. Take care man!","Likes":"10.0","Sentiment":"2.0"}
{"":"125","Video ID":"cj4lxmHQV0o","Comment":"Ugh, hate when my summer holidays end. At least you brighten my mood with this \"top tech\" series. Thanks!","Likes":"206.0","Sentiment":"2.0"}
{"":"126","Video ID":"cj4lxmHQV0o","Comment":"the Forest app is a phone based timer app. Basically, you set a timer for however long you want to be focused for. At the beginning, it will plant a virtual tree in the app. If you leave the Forest app at all it will kill your tree","Likes":"63.0","Sentiment":"1.0"}
{"":"127","Video ID":"cj4lxmHQV0o","Comment":"Awesome variety of products! I also like that you had more than five or six items. Love the budget finds! 🔥🔥","Likes":"2.0","Sentiment":"2.0"}
{"":"128","Video ID":"cj4lxmHQV0o","Comment":"You missed a feature on the airbolt. Instead of using the big part of the loop to lock your zippers, lock the zippers on the loop where the 2 notches are. That way you can't open the bag 3 inches.","Likes":"40.0","Sentiment":"0.0"}
{"":"129","Video ID":"cj4lxmHQV0o","Comment":"Its so crazy to me ive watched you all the way through middle school till college now, over six years and youve grown so much. Keep working big man.\n\"Reguardless of your age middle school, highschool, college-university we gotchu covered\"","Likes":"11.0","Sentiment":"2.0"}
{"":"130","Video ID":"d-BdIo8_wpA","Comment":"☕ For all the coffee lovers, don’t forget to check out Cometeer and save $20 on your first order!\n➡ https://cometeer.com/excessorize\n\n➡️ WATCH: Best Gifts Under $20 - https://youtu.be/fTjzQll903I","Likes":"14.0","Sentiment":"2.0"}
{"":"131","Video ID":"d-BdIo8_wpA","Comment":"The KableCARD is by far my favorite item on this list! When I first saw you have it on the channel, I immediately bought it. So easy to carry and being able to charge anything with it is great.","Likes":"42.0","Sentiment":"2.0"}
{"":"132","Video ID":"d-BdIo8_wpA","Comment":"I just wanted to say THANK YOU for making such amazing content. We notice all the hard work you do and appreciate it so much","Likes":"17.0","Sentiment":"2.0"}
{"":"133","Video ID":"d-BdIo8_wpA","Comment":"As a specialty coffee lover those Cometeer pods are amazing. If I didn't enjoy the long process it takes to brew a fresh cup of coffee I'd 100% buy them all the time.","Likes":"5.0","Sentiment":"2.0"}
{"":"134","Video ID":"d-BdIo8_wpA","Comment":"I wasn’t prepared for the immediate start lol","Likes":"424.0","Sentiment":"0.0"}
{"":"135","Video ID":"d-BdIo8_wpA","Comment":"Thanks for consistently providing great videos. Every time I purchase a new device I come to your channel to find out the best products for it.","Likes":"57.0","Sentiment":"2.0"}
{"":"136","Video ID":"d-BdIo8_wpA","Comment":"Love these accessories. You always make great videos","Likes":"6.0","Sentiment":"2.0"}
{"":"137","Video ID":"d-BdIo8_wpA","Comment":"Love your videos. I really hope one day you make a WORKSITE edc like for construction workers or electricians. Much love.","Likes":"15.0","Sentiment":"2.0"}
{"":"138","Video ID":"d-BdIo8_wpA","Comment":"Love watching your videos, just waiting for that best accessories for Pixel 6 video","Likes":"3.0","Sentiment":"2.0"}
{"":"139","Video ID":"d-BdIo8_wpA","Comment":"Love your vids man,keep up the good work.","Likes":"2.0","Sentiment":"2.0"}
{"":"140","Video ID":"eFhhW6fsAbQ","Comment":"Be careful with the Katchy they are known to start smoking at the top so possible fire hazard. It's possible that this issue could have been fixed with the newer models but just giving you a heads up. Great video!","Likes":"210.0","Sentiment":"2.0"}
{"":"141","Video ID":"eFhhW6fsAbQ","Comment":"Am I the only one that ACTUALLY watches these with snacks and drinks?! 🌝\n\nBeen here since #1 😎","Likes":"320.0","Sentiment":"2.0"}
{"":"142","Video ID":"eFhhW6fsAbQ","Comment":"Gotta let your son pick some boxes now. He’s old enough to point one out. Start him in the family business early. 😁","Likes":"88.0","Sentiment":"2.0"}
{"":"143","Video ID":"eFhhW6fsAbQ","Comment":"I love all the interactions and laughs with everyone in this video. Personally I think J picked the best tech🤣","Likes":"29.0","Sentiment":"2.0"}
{"":"144","Video ID":"eFhhW6fsAbQ","Comment":"Okay J, that $130 was definitely worth it -- I might get me one, a good buy for a traveling tech head","Likes":"37.0","Sentiment":"2.0"}
{"":"145","Video ID":"eFhhW6fsAbQ","Comment":"Still the best series to watch while indulging in a meal. Can't believe it's already the 47th video!","Likes":"21.0","Sentiment":"2.0"}
{"":"146","Video ID":"eFhhW6fsAbQ","Comment":"I absolutely love your wife’s expressions when she’s interacting with you. Another Gundam, play games with you giggle… Cracks me up!","Likes":"17.0","Sentiment":"2.0"}
{"":"147","Video ID":"eFhhW6fsAbQ","Comment":"Thanks for the heads up about Grover. I'm a tech reviewer and had never heard of it. Could be a really nice way for me to get my hands on some items to review.\n\nVery appreciated.","Likes":"16.0","Sentiment":"2.0"}
{"":"148","Video ID":"eFhhW6fsAbQ","Comment":"I love you guys. I hope you know that. 😂 You guys brighten my day with these massive tech unboxing videos.","Likes":"7.0","Sentiment":"2.0"}
{"":"149","Video ID":"eFhhW6fsAbQ","Comment":"The whole idea of the \"Interchangeable battery to keep going\" of the Steel Series is exactly the reason why Xbox still uses AA batteries for their controllers :), I think is in an undervalued decision from Xbox :(,","Likes":"8.0","Sentiment":"0.0"}
{"":"150","Video ID":"N88OE2ZCHBM","Comment":"In my experience, burnout comes from realizing that improved performance doesn't produce improved rewards, it produces more work. The response to a job well done is never a couple days off or a timely bonus, instead good work is \"rewarded\" with the demand for twice as much work in the same amount of time. Firms see young workers as a productivity sponge to be squeezed for all it's worth, young people are almost never treated as the company's future.","Likes":"1419.0","Sentiment":"0.0"}
{"":"151","Video ID":"N88OE2ZCHBM","Comment":"I am 50 years old working in the high tech industry, mentally tired and sick of the weekly 8 to 5 routine. Never got a proper day off even through the pandemic.  Hats off to the millenials and GenZ that think differently and put more weight on LIVING rather than just WORKING.","Likes":"960.0","Sentiment":"0.0"}
{"":"152","Video ID":"N88OE2ZCHBM","Comment":"I think the pandemic has taught people the importance of multiple streams of income unfortunately having a job doesn’t mean security","Likes":"2066.0","Sentiment":"0.0"}
{"":"153","Video ID":"N88OE2ZCHBM","Comment":"Successful people don't become that way overnight. What most people see at a glance wealth, a great career, purpose-is the result of hard work and hustle over time. I pray that anyone who reads this will be successful in life..","Likes":"142.0","Sentiment":"2.0"}
{"":"154","Video ID":"N88OE2ZCHBM","Comment":"As someone who used to work 80 hours a week, quitting my job to become a freelancer was the best thing I have ever done. Sure I still work a lot of hours and often close to 70-80 hrs a week, I feel like I am doing this for myself and not some corporation.","Likes":"411.0","Sentiment":"2.0"}
{"":"155","Video ID":"N88OE2ZCHBM","Comment":"I have a high paying tech job that I’m about to leave. I feel incredibly blessed and privileged to have had it, even though I worked hard to get to where I am. I was promoted very fast after 5 years. I know it’s something many people would love to have and honestly I’m happy that someone else who has worked hard will get my spot. Ultimately I became burnt out and just need some time to reset my life. I have lived humbly, saved every thing I could, paid off debts as quickly as possible, and have enough to live for 8 months to a year. I’m hoping to come back into the industry as a healthier employee or have found something else fulfilling.\n\nFor anyone wishing they had one of these jobs or feel frustrated by people that appear to be complaining, I hope you achieve your dream and get one. You can do it, keep at it! Taking one of these jobs to be financially secure is a blessing. I am taking a break because my mental health and stress hospitalized me (don’t let that scare you, I just have my own personal stuff too 😄).","Likes":"352.0","Sentiment":"2.0"}
{"":"156","Video ID":"N88OE2ZCHBM","Comment":"I’m a Software developer. I understand the struggle but us tech workers should count our lucky stars. We are very privileged to be where we are. Most jobs outside of tech have less perks, much lower pay, and more stress. I am grateful everyday to be in this field. Once I accumulate enough wealth to purchase my freedom, I’ll see myself out.. maybe. In the meantime, I will run the race as long as I have to.","Likes":"253.0","Sentiment":"2.0"}
{"":"157","Video ID":"N88OE2ZCHBM","Comment":"The thing is, if you give someone all of these perks and a flexible schedule, you need to also give them the freedom to use that flexibility. You must make it clear that the company expects you to take down time, and you will not be frowned upon either officially or unofficially. Leadership needs to model that behavior by taking time off and making sure everyone knows they're taking time off. This also empowers your teams, letting them know that you trust them to work without constantly staring over their shoulders.","Likes":"48.0","Sentiment":"2.0"}
{"":"158","Video ID":"N88OE2ZCHBM","Comment":"\"Compare that to ... physicians, only 42% said they were burned out\" - Yes, indeed, a perfectly acceptable percentage.","Likes":"1041.0","Sentiment":"2.0"}
{"":"159","Video ID":"N88OE2ZCHBM","Comment":"I worked a low paying tech job for six years and still felt the burn out. The problem is that tech is very fast paced and competition focused. You can barely keep up. Though I got promoted regularly, my higher ups told me the truth before they left, they said that I was severely underpaid based on my skills (essentially I branded myself a one stop shop for the marketing department as I am both technically knowledgeable, people oriented and strategic). I maxed out at $50K. So I decided to jump ship with little planned. Now I run a financial agency with my husband and we make $250K a year as entrepreneurs and we have the freedom to set our own lifestyle.","Likes":"66.0","Sentiment":"0.0"}
{"":"160","Video ID":"PKATJiyz0iI","Comment":"STRATOSFERA ACQUATICA - 0:00\nINMO AIR - 1:25 \nSHINE - 2:23 \nCROWN - 3:15 \nMeural Canvas II - 4:07 \nOCTAV - 5:02 \nATMOS - 5:48 \nWYN Bullet - 6:32 \nSPLACH TRANSFORMER - 7:06 \nSQUEAKY CLEAN FEET - 7:54","Likes":"18.0","Sentiment":"1.0"}
{"":"161","Video ID":"PKATJiyz0iI","Comment":"That boat pod looks a lot like a saiyan space capsule…. I need one. Lol","Likes":"5.0","Sentiment":"2.0"}
{"":"162","Video ID":"PKATJiyz0iI","Comment":"Those window breakers seems like an easy way to rob someone’s car.","Likes":"36.0","Sentiment":"0.0"}
{"":"163","Video ID":"PKATJiyz0iI","Comment":"Ok, cool, the ball boat.\nMy question is, how do you launch it?\nTraditional boats come off a trailer when you dip them in the water. Looks to me as if you need a crane for the ball boat.","Likes":"3.0","Sentiment":"1.0"}
{"":"164","Video ID":"PKATJiyz0iI","Comment":"Anyone else notice how much the WYN Bullet resembles a firing pin.. if you have ever built your own firearms, you know the time and effort that goes into a firing pin with all of heating and cooling it takes to harden the steel and how easy it is to over harden the firing pin and no it's not feasible to soften a over hardened firing pin .","Likes":"2.0","Sentiment":"1.0"}
{"":"165","Video ID":"PKATJiyz0iI","Comment":"I would love the glasses and the digital artwork frame","Likes":"2.0","Sentiment":"2.0"}
{"":"166","Video ID":"PKATJiyz0iI","Comment":"That canvas one wouldn’t be a bad price if you didn’t have to pay for a monthly membership 🙄","Likes":"6.0","Sentiment":"1.0"}
{"":"167","Video ID":"PKATJiyz0iI","Comment":"Cool! ♥👍","Likes":"1.0","Sentiment":"2.0"}
{"":"168","Video ID":"PKATJiyz0iI","Comment":"Nice I love it🥰","Likes":"2.0","Sentiment":"2.0"}
{"":"169","Video ID":"PKATJiyz0iI","Comment":"Damn the mueral canvas is nice, too pricey","Likes":"1.0","Sentiment":"0.0"}
{"":"170","Video ID":"qiMnSaZWf3M","Comment":"If you could limit your products to things that are available retail it would be awesome. Kickstarter and Indiegogo etc don't count, too many scams and failed products and no protections.","Likes":"296.0","Sentiment":"0.0"}
{"":"171","Video ID":"qiMnSaZWf3M","Comment":"From all the stuff mentioned. I have the DJI Mic. Amazing recording device","Likes":"0.0","Sentiment":"2.0"}
{"":"172","Video ID":"qiMnSaZWf3M","Comment":"This guy must be the richest youtuber, I hear his voice on most tech channel 😂","Likes":"1.0","Sentiment":"2.0"}
{"":"173","Video ID":"qiMnSaZWf3M","Comment":"From all the stuff mentioned. I have the DJI Mic. Amazing recording device","Likes":"13.0","Sentiment":"2.0"}
{"":"174","Video ID":"qiMnSaZWf3M","Comment":"That motion alarm for protecting your laptop makes me laugh.  If you are taking a break away from your workplace do you really think that the alarm feature would deter a thief from simply knocking the device to the floor, pick up the laptop and (perhaps) step on the alarm and crush it in a moment of disdain.  By the time you get back with your latte after your phone notifies you of your impending bad luck your laptop will be off on an extended trip.","Likes":"14.0","Sentiment":"0.0"}
{"":"175","Video ID":"qiMnSaZWf3M","Comment":"That cable organiser would be incredible in my dorm room","Likes":"0.0","Sentiment":"2.0"}
{"":"176","Video ID":"qiMnSaZWf3M","Comment":"The Trene Control Alarm will not deter someone who really wants it.  They will just knock that gadget off and run with your property.","Likes":"16.0","Sentiment":"0.0"}
{"":"177","Video ID":"qiMnSaZWf3M","Comment":"For anyone considering the Vaultek LifePod (3:00), there is a video on the LockPickingLawyer channel where he opens the safe with a fork. Don't waste your money.","Likes":"22.0","Sentiment":"1.0"}
{"":"178","Video ID":"qiMnSaZWf3M","Comment":"Enjoyed your video and I gave it a Thumbs Up","Likes":"1.0","Sentiment":"2.0"}
{"":"179","Video ID":"qiMnSaZWf3M","Comment":"I like the engraver but when I went to check price I found it was just a kickstarter.","Likes":"13.0","Sentiment":"1.0"}
{"":"180","Video ID":"4AnyhHl3_tE","Comment":"I spent hours researching dash cams a  year or so ago and it’s almost maddening how awful, sparse and misrepresented information on dash cams is. I was totally surprised how under developed they are. This is a video that is really necessary.","Likes":"15300.0","Sentiment":"0.0"}
{"":"181","Video ID":"4AnyhHl3_tE","Comment":"Vids like these are definitely a service for looking out for everyone to avoid buying crap and hype in dashcams. Well done in the research! Thanks LTT!","Likes":"256.0","Sentiment":"2.0"}
{"":"182","Video ID":"4AnyhHl3_tE","Comment":"A favourite trick is to upscale a low resolution image before applying the compression - that way they get to claim a higher resolution on the box.  I've analysed a few of these now.","Likes":"72.0","Sentiment":"1.0"}
{"":"183","Video ID":"4AnyhHl3_tE","Comment":"I did not expect to love this video as much as I did... it epitomizes the very best of YouTube in my opinion - a well-made video with a well-constructed narrative, hosted flawlessly and provides a genuinely good service to everyone, even if they are not in the market for these products. Love your work LTT Team!","Likes":"62.0","Sentiment":"2.0"}
{"":"184","Video ID":"4AnyhHl3_tE","Comment":"Thank you Linus for spending the big bucks and testing all these cameras for our benefit. I will be keeping your recommendations in mind when I purchase my camera.","Likes":"166.0","Sentiment":"2.0"}
{"":"185","Video ID":"4AnyhHl3_tE","Comment":"THIS is the kind of content that we need. Calling out trash markets and helping people find honest answers, doing the side-by-side comparisons they can't do. Thanks for this! Glad to know the Rove R2-4K I got as a gift is not far from really the peak in the market and is \"good enough\" if not overpriced a bit.","Likes":"4789.0","Sentiment":"2.0"}
{"":"186","Video ID":"4AnyhHl3_tE","Comment":"Yup, it's amazing though how the market then changes brands for each country. In germany we have an entirely different line of knock-off chinese brands. Which ultimately look alike same goes for the Australian / american market. I am kinda stoked to see though what sort of dashcams are actually used within South Korea, Japan if anybody could give a hint to that! I mean surely they must have great dashcams right? Japan being the leading technology country in the 80s and having a severe amount of car enthusiasts, and well South Korea being well the main birth place of any technology centre and fab well at least a good portion in my mind.\r\n\r\nI bought this one due to a recommendation from a friend of mine. Problem I have with it is quality related the G-Sensor broke not long after I bought the thing and started using it kinda unfortunate. This creates an issue of the thing constantly making emergency recordings. And in that mode you can't disable the screen from flashing so at night drives you'll really get beamed in your faze and think someone put a flashlight up to your head nope. It's your f#+*^# dashcam You can improve further the video quality for e.g. when experincing intense sun glare which is usually caused on these by using a ND-Filter you just have to find your own way to mount them. Usually there is full filter clamping solutions. Because you'll have to overshoot with the filter anyhow.\r\n\r\nI didn't do this yet as I did not find it nessecary to do so but a big german dashcam clip compilation maker did recommend this in one of his dashcam review videos half a year ago or so \r\nname of the channel is \"Eure Videos Fahrnünftig\"\r\n\r\nGerman Amazon\r\nThiEye CV3-211 https://www.amazon.de/dp/B08DCWG1K5\r\n\r\nAmerican market\r\nJansite https://www.amazon.de/dp/B08DCWG1K5\r\n\r\nNexiGo D80 https://www.amazon.com/dp/B09CZ5MJ3C\r\n\r\nAustralian & NZ market\r\nVolway https://www.amazon.com/dp/B09HBY5KWH","Likes":"21.0","Sentiment":"2.0"}
{"":"187","Video ID":"4AnyhHl3_tE","Comment":"In all fairness, the VIOFO actually looks pretty great. Actually worth considering over the Thinkware F70 if the budget isn't too tight.","Likes":"29.0","Sentiment":"2.0"}
{"":"188","Video ID":"4AnyhHl3_tE","Comment":"When I went looking for a dashcam my main criteria was that it has a super cap instead of a battery, cause I really don't think the batteries would handle the -20 to -30c temps in winter and the exact opposite in the summer along with however much the sun heats up the interior. (I know you can take them off but I kinda wanted an install and forget about it kind of system)\n\nFor actual performance it's much better to just find someone elses footage cause the resolution and other specs are very misleading, unless you really know your camera sensor specs.","Likes":"24.0","Sentiment":"0.0"}
{"":"189","Video ID":"4AnyhHl3_tE","Comment":"I had my suspicions about this for a long time, thank you for finally calling this issue out.  It sounds like there's a hole in the market for a truly high quality dashcam that's not Chinese crap.  Hopefully some tech company sees this and swoops in.  I'm tired of all these countless trash brands on Amazon with unpronounceable names.","Likes":"115.0","Sentiment":"0.0"}
{"":"190","Video ID":"nmY2kgWYwyQ","Comment":"I've been wanting to make this video for SUCH a long time!  That Royole Display was just SO hard to get hold of by HOLY COW was it worth it!! \nTo check out my other Ridiculous Tech Unboxings: https://www.youtube.com/watch?v=w7ZcS2vEzIw&list=PLflqtq8EOGAL_OmnMixISKvdDwvWvoQGs&index=2","Likes":"3183.0","Sentiment":"0.0"}
{"":"191","Video ID":"nmY2kgWYwyQ","Comment":"I love the fact that you put “Thinnest Rick Roll” and “Can you legally employ a cat” on the search history even if it flashed on the screen for a second. You are one of the only creators that put 100% effort and detail into their content. Keep it up!","Likes":"2902.0","Sentiment":"2.0"}
{"":"192","Video ID":"nmY2kgWYwyQ","Comment":"His search history:\n“Thinnest windows laptop”\n“Thinnest keyboard” \n“world’s thinnest mouse”\n“Thinnest charger”\n“is it legal to employ a cat”\n“can cats edit YouTube videos”\n“Thinnest rickroll in the world”\n“thinnest Rick astley”","Likes":"90.0","Sentiment":"1.0"}
{"":"193","Video ID":"nmY2kgWYwyQ","Comment":"I’d say the coolest thing in this video is the desk pc. Saves room and it’s cool to see the desk, but I wonder how much it cost and if it’s worth buying?","Likes":"20.0","Sentiment":"2.0"}
{"":"194","Video ID":"nmY2kgWYwyQ","Comment":"I'm just here to say thank you to him, the generosity he has shown will forever be in my heart. Thanks for the perfect job","Likes":"0.0","Sentiment":"2.0"}
{"":"195","Video ID":"nmY2kgWYwyQ","Comment":"i own a remarkable 2 and that feeling surreal to hold was the same thing i felt when i got it, its great for anyone wanting a device to write with for school and so much thinner and easier to carry around than a notebook or binder, especially since you can import and export pdfs for downloading and submitting assignments online","Likes":"6.0","Sentiment":"2.0"}
{"":"196","Video ID":"nmY2kgWYwyQ","Comment":"Man, I love how he went from a smartphone focused creator to just all inventions overall. This is incredible keep it up Arun 😃","Likes":"8460.0","Sentiment":"2.0"}
{"":"197","Video ID":"nmY2kgWYwyQ","Comment":"Thankyou for the effort you put into your videos. You spend thousands on each video just for your fans. Respect ✊","Likes":"5.0","Sentiment":"2.0"}
{"":"198","Video ID":"nmY2kgWYwyQ","Comment":"That desk pc is now on my bucket list! 😍","Likes":"19.0","Sentiment":"2.0"}
{"":"199","Video ID":"nmY2kgWYwyQ","Comment":"I love the fact that you put hilarious search histories \nat 2:33 this is the kind of content YouTubers need to make keep up the good work 😊☺️☺️😊","Likes":"6.0","Sentiment":"2.0"}
{"":"200","Video ID":"HMqyLcNmsec","Comment":"Install Raid for Free ✅ IOS/ANDROID/PC: https://clcr.me/hG0u2y and get a special starter pack 💥 Available only for the next 30 days\nThis is the BEST iPhone accessory in 2022 ➡ https://geni.us/i1OibaB\nLike these Wallpapers? Download them here ➡ https://bit.ly/2WNc6Qw\niPhone 14 MagSafe Accessories ➡ https://geni.us/xYuw","Likes":"12.0","Sentiment":"2.0"}
{"":"201","Video ID":"HMqyLcNmsec","Comment":"In spite of the huge upgrades, especially for the Pro models, it would be interesting to see how many will upgrade to the iPhone 14 lineup, given that the iPhone 13 lineup is as popular as ever","Likes":"13.0","Sentiment":"2.0"}
{"":"202","Video ID":"HMqyLcNmsec","Comment":"Honestly can’t wait for the camera testing you do on the pros. As a iPhone 8 user anything will be an improvement though lol.","Likes":"5.0","Sentiment":"2.0"}
{"":"203","Video ID":"HMqyLcNmsec","Comment":"I’ve been holding out cause i just felt it wasn’t worth upgrading but with everything coming to the 14 pro and the diminishing battery on my current iPhone X, it might be time to retire my phone after 5 years.","Likes":"9.0","Sentiment":"1.0"}
{"":"204","Video ID":"HMqyLcNmsec","Comment":"Definitely upgrading from my 12 Pro Max to the 14 Pro Max, I'll get at least half the cost of the new phone back with trade in. Major upgrade in battery, camera, and the screen.","Likes":"30.0","Sentiment":"2.0"}
{"":"205","Video ID":"HMqyLcNmsec","Comment":"In my opinion the 13 mini is the best phone ever made. Seems I’m in a minority but it’s brilliant.","Likes":"40.0","Sentiment":"2.0"}
{"":"206","Video ID":"HMqyLcNmsec","Comment":"Eh, I’m sticking with my 13 Pro Max until probably the 15 or 16. The cameras on the 14 Pros are literally the biggest worthwhile change this year imo.","Likes":"72.0","Sentiment":"2.0"}
{"":"207","Video ID":"HMqyLcNmsec","Comment":"I'm going to wait for the scheduled iPhone 15 Pro which will be scheduled to release in October 2023 if everything goes to plan. It is expected to have a USB C port and faster charging like the iPhone 14 series. This is what really matters for me.","Likes":"6.0","Sentiment":"2.0"}
{"":"208","Video ID":"HMqyLcNmsec","Comment":"I'm getting the Pro. Been using the 12 Pro Max since it came out and I think it's too big for one hand use.","Likes":"3.0","Sentiment":"1.0"}
{"":"209","Video ID":"HMqyLcNmsec","Comment":"I might upgrade from my 11 Pro to the 14 Max. I guess I don’t care enough to spend the money on the pro Max, but I want the bigger display and better battery life","Likes":"4.0","Sentiment":"2.0"}
{"":"210","Video ID":"Q2ysbTVlPdk","Comment":"The information is easily digestible, thanks!","Likes":"10710.0","Sentiment":"2.0"}
{"":"211","Video ID":"Q2ysbTVlPdk","Comment":"I think we need to have \"Period\" Support with a Gynecologist next! 😉 I'm dying to answer some period health questions!","Likes":"6964.0","Sentiment":"1.0"}
{"":"212","Video ID":"Q2ysbTVlPdk","Comment":"This guy is so professional and has such a calm aura about him. Exactly what I would like my doctor to have.","Likes":"4364.0","Sentiment":"2.0"}
{"":"213","Video ID":"Q2ysbTVlPdk","Comment":"This guy is just wonderful, I like that sense of humor in a doctor. \"Dr, what is wrong with me?\" \"Yes.\"","Likes":"5322.0","Sentiment":"2.0"}
{"":"214","Video ID":"Q2ysbTVlPdk","Comment":"I had a great time with these questions!  Thanks WIRED 💚!!!","Likes":"2712.0","Sentiment":"2.0"}
{"":"215","Video ID":"Q2ysbTVlPdk","Comment":"1:09 ‘No, just you’ actually got me🤣🤣 I love how they choose professionals with such great fun and easy going personalities❤️It makes science a little less nerdy","Likes":"1771.0","Sentiment":"2.0"}
{"":"216","Video ID":"Q2ysbTVlPdk","Comment":"Seriously, how are these weird topics so engaging? Probably the professionals they feature, but this is a fantastic series.","Likes":"2560.0","Sentiment":"2.0"}
{"":"217","Video ID":"Q2ysbTVlPdk","Comment":"As someone with Ulcerative Colitis, I'm glad to see gastrointestinal issues being put on the spotlight. As well as a specialist educating people on this. Taking care of yourself before it becomes chronic is key!","Likes":"960.0","Sentiment":"2.0"}
{"":"218","Video ID":"Q2ysbTVlPdk","Comment":"Had the pleasure of working at the same practice as Dr Iroku during his time in NC. He truly is just as nice in person as he appears in this video. So nice to see a familiar face!","Likes":"569.0","Sentiment":"2.0"}
{"":"219","Video ID":"Q2ysbTVlPdk","Comment":"Dr Iroku has nailed perfect balance of being fun and informative while remaining professional. Perfect for this series!","Likes":"335.0","Sentiment":"2.0"}
{"":"220","Video ID":"zI8KQq5zmyM","Comment":"Reminder: DO NOT fall for the fake Telegram and WhatsApp accounts trying to have you claim a prize through texting them. It's fake and a scam. I personally contact the winners through my official account only.","Likes":"322.0","Sentiment":"0.0"}
{"":"221","Video ID":"zI8KQq5zmyM","Comment":"This was one of the best \"cool tech\" episodes in a while, wow... That pocket operator was awesome and I don't even make music","Likes":"338.0","Sentiment":"2.0"}
{"":"222","Video ID":"zI8KQq5zmyM","Comment":"1:20 Led Message Panel\n2:44 8k/4k HDMI 2.1 Switcher\n3:57 Womier Phantom Keyboard\n6:17 Pocket Operator\n8:52 Behringer UM-2 Audio Interface","Likes":"147.0","Sentiment":"1.0"}
{"":"223","Video ID":"zI8KQq5zmyM","Comment":"I used to have that audio interface. 10/10 for those who wanna switch from a usb mic to xlr. Great choice of items this month Frank 👌","Likes":"18.0","Sentiment":"2.0"}
{"":"224","Video ID":"zI8KQq5zmyM","Comment":"Love those pocket operators. Never heard of them until this video and now I've done a ton of research on em lol. Would like to pick one up someday. Thanks for bringing this dope tech to our attention good sir!","Likes":"7.0","Sentiment":"2.0"}
{"":"225","Video ID":"zI8KQq5zmyM","Comment":"That LED Message Board is super cool! So many options for use. Love watching your videos and seeing all of the cool affordable tech!","Likes":"4.0","Sentiment":"2.0"}
{"":"226","Video ID":"zI8KQq5zmyM","Comment":"Love the Wormier keyboard! I have a full size keyboard and the compact option looks amazing and will be a better fit for my small desk.","Likes":"2.0","Sentiment":"2.0"}
{"":"227","Video ID":"zI8KQq5zmyM","Comment":"I love how there's infinite possibilities that you can do with the pocket operator. Would love to pick up one of those for exploring it!","Likes":"2.0","Sentiment":"2.0"}
{"":"228","Video ID":"zI8KQq5zmyM","Comment":"My favorite cool tech gadget in this episode was definitely the audio interface as I am starting to get into the streaming world. Great episode and for the amazing content.","Likes":"0.0","Sentiment":"2.0"}
{"":"229","Video ID":"zI8KQq5zmyM","Comment":"Gotta say this is one of the best episodes of the series in a while! I actually think every single one of these things would be something I'd go out to buy, especially the LED sign. I finally am picking back up my plan to build my own PC and the flexibility of the sign adds a lot of, well, flexibility on how I want my endgame to turn out.","Likes":"1.0","Sentiment":"2.0"}
{"":"230","Video ID":"iEAlq1GPgnc","Comment":"Teachers: There are no stupid questions\n\nWolfgang Puck: \"Well, Tracey, that's a stupid question\"","Likes":"4813.0","Sentiment":"0.0"}
{"":"231","Video ID":"iEAlq1GPgnc","Comment":"he's a nice fun guy, he told my dad  ( at an event my dad was cooking at ) that \" he had never seen so many steaks cooked so perfectly so quickly\"  and it's one of his favorite memories. we have a signed picture with him and my parents in it   : D","Likes":"1014.0","Sentiment":"2.0"}
{"":"232","Video ID":"iEAlq1GPgnc","Comment":"He seems like such a fun person omg \n“Keep calm and smoke a joint”\n“Let me teach you English”\n“Tracy that’s a stupid question”\n“Idk what school you’re going to but maybe you should change schools”\nIM DEAD","Likes":"1666.0","Sentiment":"1.0"}
{"":"233","Video ID":"iEAlq1GPgnc","Comment":"Idk if this was intentional but I really like how he said “practice makes better” rather than “practice makes perfect”","Likes":"1631.0","Sentiment":"2.0"}
{"":"234","Video ID":"iEAlq1GPgnc","Comment":"“Have a drink or smoke a joint.” Thanks, Chef. I’ll do both.","Likes":"16674.0","Sentiment":"2.0"}
{"":"235","Video ID":"iEAlq1GPgnc","Comment":"If you settle a lemon, a great cheesecake and a chocolate soufflé in a circle and chant \"restauranteur\" three times in a mirror, Wolfgang Puck will appear behind you.","Likes":"880.0","Sentiment":"1.0"}
{"":"236","Video ID":"iEAlq1GPgnc","Comment":"I think its kinda cool that Elizabeth Haigh sent the tweet about nervous breakdowns the same month she opened her restaurant, and now that her question is being answered, she has a michellin star","Likes":"269.0","Sentiment":"2.0"}
{"":"237","Video ID":"iEAlq1GPgnc","Comment":"I like that he mentioned the omelette thing. Many years ago I took culinary classes when I considered trying to become a chef, and an instructor I had emphasized the importance of a good omelette for restaurant interviews. Glad to know I wasn't led astray in that","Likes":"505.0","Sentiment":"2.0"}
{"":"238","Video ID":"iEAlq1GPgnc","Comment":"I can’t wait to put edible flowers all over my morning Cheerios","Likes":"382.0","Sentiment":"2.0"}
{"":"239","Video ID":"iEAlq1GPgnc","Comment":"I love how he's wearing a bracelet that says ''allergic to stupidity''","Likes":"229.0","Sentiment":"2.0"}
{"":"240","Video ID":"IHnhSxizVOA","Comment":"The price of todays bikes is absolutely bonkers, doesnt make any sense whatsoever if you compare it to motorcycles or even cars","Likes":"68.0","Sentiment":"0.0"}
{"":"241","Video ID":"IHnhSxizVOA","Comment":"The price of the road-going Kawasaki really tells how overpriced the push bikes are.","Likes":"89.0","Sentiment":"0.0"}
{"":"242","Video ID":"IHnhSxizVOA","Comment":"Fun fact about horsepower: it's the amount of power a horse can sustain for an entire day so a galloping horse actually has 15 horsepower.","Likes":"22.0","Sentiment":"2.0"}
{"":"243","Video ID":"IHnhSxizVOA","Comment":"I love and ride both types of two wheeled  transportation 😂. #GCNtech your talking my language!!","Likes":"25.0","Sentiment":"2.0"}
{"":"244","Video ID":"IHnhSxizVOA","Comment":"Another great video, two 👍🏽 thumbs up. I know little to nothing about about motorcycle riding; nevertheless, the GCN team once again has brought another layer to overall world of cycling which for me makes even more interesting. Wishing the best for Scott & his team. 👍🏽","Likes":"0.0","Sentiment":"2.0"}
{"":"245","Video ID":"IHnhSxizVOA","Comment":"This was a fascinating look at something I love, by some genuinely interested people. I will add that you can build a significantly cheaper race bike, for a lower key series and still have fun on the track. I have a Minitwin which is relatively cheap to run, but a friend of mine has a litre plus missile and every time he crashes it, it costs about £5k and six months at least to fix! However, I far prefer long adventure rides to whizzing around the track, all of which you can do on a minitwin. 😁","Likes":"0.0","Sentiment":"2.0"}
{"":"246","Video ID":"IHnhSxizVOA","Comment":"Next week on Battle of the Tech: Hank vs Golden Retriever","Likes":"25.0","Sentiment":"1.0"}
{"":"247","Video ID":"IHnhSxizVOA","Comment":"You left off the most important consideration: How many bottle holders do you have?","Likes":"6.0","Sentiment":"1.0"}
{"":"248","Video ID":"IHnhSxizVOA","Comment":"Hopefully you were able to interview some of the riders who train on bicycles.","Likes":"0.0","Sentiment":"1.0"}
{"":"249","Video ID":"IHnhSxizVOA","Comment":"As a lapsed Superbike obsessive. It always bothered me hearing GCN call top road bikes Superbikes.\nNow I mostly watch cycling and I'm used to it.","Likes":"3.0","Sentiment":"0.0"}
{"":"250","Video ID":"Ql1-RZ2FUrc","Comment":"Hanging onto my 8T for now. Curious to see what OnePlus does after the 10 overall coz the 9 & 10 didn't move me. They keep constantly moving from what made them great with each variant 😩, the OnePlus 6 being their last great phone","Likes":"34.0","Sentiment":"2.0"}
{"":"251","Video ID":"Ql1-RZ2FUrc","Comment":"I’ve always wondered what it’s like for a tech reviewer to be constantly switching phones. Would love to see a how I set up my phone from a tech reviewer type video or something similar","Likes":"3.0","Sentiment":"1.0"}
{"":"252","Video ID":"Ql1-RZ2FUrc","Comment":"I’m waiting for the Oneplus 10S or P or Q","Likes":"3.0","Sentiment":"2.0"}
{"":"253","Video ID":"Ql1-RZ2FUrc","Comment":"Pretty happy with the oneplus 9. Camera is killer for sunny days on the beach. The oneplus carbon fiber case makes it feel excellent in the hand.","Likes":"3.0","Sentiment":"2.0"}
{"":"254","Video ID":"Ql1-RZ2FUrc","Comment":"OnePlus have been making some solid looking hardware these days. That being said it does feel like they have been sort of trying to become the next Samsung with the number of phones that they have been launching.","Likes":"1.0","Sentiment":"2.0"}
{"":"255","Video ID":"Ql1-RZ2FUrc","Comment":"You are the only youtuber who compared these two phones for the first time, thank you so much 🙂","Likes":"7.0","Sentiment":"2.0"}
{"":"256","Video ID":"Ql1-RZ2FUrc","Comment":"Always here for u chris. Mad respect.","Likes":"6.0","Sentiment":"2.0"}
{"":"257","Video ID":"Ql1-RZ2FUrc","Comment":"Oppo did OnePlus so dirty  \n😭 Heart breaks for OnePlus fans \nR.I.P  oxygen OS and OnePlus","Likes":"3.0","Sentiment":"0.0"}
{"":"258","Video ID":"Ql1-RZ2FUrc","Comment":"Man, OnePlus is in the wrong direction after Carl Pei left.\nFrom *flagship killer* to *forgettable company*","Likes":"13.0","Sentiment":"0.0"}
{"":"259","Video ID":"Fpof56HU6SY","Comment":"Depends on the company lol, my company was on a hiring freeze from 2021-2022 and now is hiring software engineers en masse.","Likes":"4.0","Sentiment":"1.0"}
{"":"260","Video ID":"Fpof56HU6SY","Comment":"Nice one Zoe. Great job. Keep us up to date on the latest computer programming news. Great job. 👍👏🤩","Likes":"4.0","Sentiment":"2.0"}
{"":"261","Video ID":"Fpof56HU6SY","Comment":"Lots of profit negative tech startup companies with an over abundant of overpaid employees…..honestly who hasn’t seen this coming?","Likes":"9.0","Sentiment":"0.0"}
{"":"262","Video ID":"Fpof56HU6SY","Comment":"It's just usual trimming of the fluff when excess liquidity is withdrawn. It's important to do it before you get to the down rounds.  That way VCs can decide which baby chicks to feed and which ones to shove out of the nest.","Likes":"0.0","Sentiment":"1.0"}
{"":"263","Video ID":"Fpof56HU6SY","Comment":"What slowdown lol? It was abnormally fast and now with the recession, VCs realized many of these startups aren’t profitable so they laid off people. The big ones are still hiring and tech adoption isn’t nearly as much for it to slow down anytime soon.","Likes":"2.0","Sentiment":"0.0"}
{"":"264","Video ID":"Fpof56HU6SY","Comment":"I work in Cybersecurity. It hasn’t slowed down much because you can’t just stop securing your systems.","Likes":"70.0","Sentiment":"1.0"}
{"":"265","Video ID":"Fpof56HU6SY","Comment":"Slow hirings may be caused by a rapid rising labor cost in hi tech ind","Likes":"2.0","Sentiment":"0.0"}
{"":"266","Video ID":"Fpof56HU6SY","Comment":"That's really a problem with service economy. Most tech companies don't even produce a nail. They do things that are intangible, you cay easily live without them. If Netflix goes down I am sure there will not be any catastrophic event. If some manufacturing companies goes down, let's say the one that makes baby formula, it could trigger a panic.","Likes":"12.0","Sentiment":"0.0"}
{"":"267","Video ID":"Fpof56HU6SY","Comment":"Startups and bitcoin tech? Definitely. Hiring freeze at big tech companies? Maybe/Nah. You still get regular churnovers that free up positions (especially now where ppl switch jobs every 2 yrs). \n\nCan you imagine a world without Amazon, Google, Microsoft? What are ppl gonna do? Switch to Linux and roll with Libra office and vim?","Likes":"3.0","Sentiment":"1.0"}
{"":"268","Video ID":"Fpof56HU6SY","Comment":"Good video as usual 👌👌","Likes":"3.0","Sentiment":"2.0"}
{"":"269","Video ID":"bbbQ_X45FaA","Comment":"The Future of Tech is looking more and more Amazing","Likes":"3.0","Sentiment":"2.0"}
{"":"270","Video ID":"bbbQ_X45FaA","Comment":"The future of Tech is soo beautiful","Likes":"4.0","Sentiment":"2.0"}
{"":"271","Video ID":"bbbQ_X45FaA","Comment":"Good day, Future Tech. I noticed your excellent video and am impressed with your amazing sharing on products. We'd love to collab on a new product experience we're working on, what would be the best email to contact you?","Likes":"1.0","Sentiment":"2.0"}
{"":"272","Video ID":"bbbQ_X45FaA","Comment":"Could Coolper become the average New Yorker’s dream? Hmm, make that every ‘coffee lover’..... can’t help but notice Pixy’s here again. A nice hands free it is.👍","Likes":"4.0","Sentiment":"2.0"}
{"":"273","Video ID":"bbbQ_X45FaA","Comment":"6:41 Russell Westbrook Need this ! 😅","Likes":"5.0","Sentiment":"1.0"}
{"":"274","Video ID":"bbbQ_X45FaA","Comment":"30meters per hour? Jezus I might just walk\nP.s. please include rough prices","Likes":"5.0","Sentiment":"1.0"}
{"":"275","Video ID":"bbbQ_X45FaA","Comment":"Enjoyed your video and I gave it a Thumbs Up for the support of your channel","Likes":"3.0","Sentiment":"2.0"}
{"":"276","Video ID":"bbbQ_X45FaA","Comment":"2:09 so I'm guessing when you make an ad for your product do you really want a guy sleeping right in the middle with an \"It is what it is\" pillow? >.< lol while everyone else is having fun\n2:37 and that blistering scooter speed of 0-30 meters.... per hour >.< I think you meant kilometers per hour. \nAll in all pretty cool stuff. I like the Coolper I can really see that taking off. Huupe seems to be novelty. I can imagine the horror as soon as someone forgets there is a TV there and slams a ball only to shatter the device lol. The life straw actually works. Ive seen several science channels take pond water and view it under a microscope then filter it and view it again. It really does work but it does not filter out chemicals in the water, just microparticles and microbes.","Likes":"3.0","Sentiment":"2.0"}
{"":"277","Video ID":"bbbQ_X45FaA","Comment":"I'm over this channel because 90% of the products they feature in their videos, are on Kickstarter, and honestly at this point they should change the name from, \"Kick Starter\"  to \"Never Starter\" LOL🤣😱🫣🤷🏾‍♀️, I'm just saying, as I'm also laughing my butt off, because that was hella funny, and it's also hella true, and yes it was also hella shady as well, sorry I couldn't help myself, anyway back to my point, because trust me it's a really good point, and just in case you're still laughing, let me get you back on track, so like I said 90% of the products featured on this channel and it's sister channel, or products that are on Kickstarter, and about 80% to 90% of the products on Kickstarter never even make it to market, that's right you read that correct, and my numbers are correct, because I did my research, so basically this channel, future tech and its sister channel, the future is now, both channels are useless, because over 90% of the products that they show you, you will never ever be able to purchase, so basically honestly it's a waste of everybody's YouTube time, unless you like looking at videos that feature products and gadgets, that will never come to market, and that you will never be able to purchase, seriously on being funny and sarcastic but also serious, because honestly I'm so over it and I'm over this channel, that's why I have unsubscribe and I'm telling everybody else to unsubscribe, so have you unsubscribed, please everybody unsubscribe, because at this point in time future tech and the future is now, and all those channels that display products that are on Kickstarter, and the keyword here is \"display\" because basically all the products are prototypes that are on display, and the public will never be able to buy them because they will never come to market, oh Kickstarter oops I'm sorry I mean never starter, oh my God I'm sorry I couldn't help myself because it's still so funny LOL, 🤣😂😭 but like I said these products never end up going to market and never end up being sold, so this whole useless channel is a waste of my time and your time and everybody else's time okay, now guess what... time's up so goodbye, and remember everybody please do yourself a big favor and unsubscribe!*🤷🏾‍♀️👍🏾👏🏾🤣😱🙊🙀🤯","Likes":"1.0","Sentiment":"2.0"}
{"":"278","Video ID":"bbbQ_X45FaA","Comment":"awesome","Likes":"1.0","Sentiment":"2.0"}
{"":"279","Video ID":"MtMkU-1p7-0","Comment":"This lady is awesome. Her voice makes my throat hurt but I could watch her for hours.","Likes":"5178.0","Sentiment":"2.0"}
{"":"280","Video ID":"MtMkU-1p7-0","Comment":"For all people after Covid who want their smell back : I did exactly what she described BUT went a step further and tried to smell back first SMELLS I USED TO HATE or made me want to puke. I feel that it trully helped getting my smell back faster !!! The hate in our brain is a true booster, it just triggers something XD \nPlease let me know if it worked for you too! Wishing all a speed recovery <3","Likes":"2681.0","Sentiment":"2.0"}
{"":"281","Video ID":"MtMkU-1p7-0","Comment":"It still blows my mind that companies have entire teams deciding whether or not a flavor is going to appeal to the masses, and yet somehow Swedish Fish flavored Oreos were still greenlit.","Likes":"560.0","Sentiment":"0.0"}
{"":"282","Video ID":"MtMkU-1p7-0","Comment":"Interesting note: Real wasabi is difficult to cultivate and package and ship. It also grows only in a specific riverbank environment, which makes real wasabi expensive and in low supply. When young, real wasabi is a bit sweet not spicy. The \"wasabi\" that comes with your sushi dinner in America, it is most often just horseradish with green food coloring. This green-dyed horseradish replacing actual wasabi is known in the food world as an ersatz or a replica food.","Likes":"213.0","Sentiment":"1.0"}
{"":"283","Video ID":"MtMkU-1p7-0","Comment":"That “section of the tongue” theory is so funny to me because it’s what I was taught as a fact in my high school anatomy class and I was trying to test that out on my own and never could, I would always taste every flavor no matter where it was in my mouth. I have never heard anyone say it wasn’t true so it’s cool to hear now","Likes":"891.0","Sentiment":"2.0"}
{"":"284","Video ID":"MtMkU-1p7-0","Comment":"This woman is unbelievably amazing - I want a PhD in taste and I want her to be my professor - I’m a lawyer and after this ONE video I’m prepared to quit and pursue taste 😂","Likes":"207.0","Sentiment":"2.0"}
{"":"285","Video ID":"MtMkU-1p7-0","Comment":"What she said about the packaging affecting the taste is so true! I always think delivery pizza smells so good, and it’s the pizza in the cardboard box that makes it smell amazing. Just not the same without the box 😆","Likes":"416.0","Sentiment":"2.0"}
{"":"286","Video ID":"MtMkU-1p7-0","Comment":"when I was a kid in kindergarten we did an experiment with that old fake 'five flavors' taste zones thing and I never got it. I could always taste everything on every part of my tongue.\nI felt vindicated like two decades later when it came out that that was horsecrap but I can't exactly go rub it in my kindergarten teacher's face can I","Likes":"398.0","Sentiment":"0.0"}
{"":"287","Video ID":"MtMkU-1p7-0","Comment":"The amount of people Wired gets to interview is amazing.....all of them has the passion of the kinds of job they r doing.... idk if \"job\" is the right word to use  when ua doing something what u love.","Likes":"4284.0","Sentiment":"2.0"}
{"":"288","Video ID":"MtMkU-1p7-0","Comment":"Also, the amount of carbonation to syrup isn't set in the soda machines, and can be changed.  A soda with more carbonation is a 'dry' soda. A restaurant I loved would mix their own rootbeer syrup, and you could ask for it to be a dry or sweet, whichever was your preference.","Likes":"686.0","Sentiment":"2.0"}
{"":"289","Video ID":"QYlXL_8ei6g","Comment":"Maybe it's because I know she's an audiologist but she annunciates everything beautifully and speaks with an even sound level. Like she clearly works with the hearing impared to naturally say every sound in a word to be heard as easily as possible","Likes":"1550.0","Sentiment":"2.0"}
{"":"290","Video ID":"QYlXL_8ei6g","Comment":"I’m so glad she talked about how hearing aids are more complicated than just a mic and speaker, as someone who has had two of them since I’ve been four I’ve had to explain that so many times (also having automatic Bluetooth ears is super cool)","Likes":"496.0","Sentiment":"2.0"}
{"":"291","Video ID":"QYlXL_8ei6g","Comment":"My doctor also told me that our ears are self-cleaning. But when I pressured her for some off-the-record advice, she finally conceded that if I really.. REALLY.. felt the need to clean inside my ear canal, I could go ahead and use my elbows. I just adore my doctor!","Likes":"104.0","Sentiment":"2.0"}
{"":"292","Video ID":"QYlXL_8ei6g","Comment":"Brilliant, well-spoken, well-enunciated, and a welcoming and animated face.  Great video!  I learned a lot.","Likes":"279.0","Sentiment":"2.0"}
{"":"293","Video ID":"QYlXL_8ei6g","Comment":"The way I was hyped to to this!! I was born with hearing loss, so I had to see MANY audiologist in my life so far. People like her made my life so much easier. Her talking about hearing aids and clearing up misconceptions or even spreading knowledge made me smile ear to ear.","Likes":"18.0","Sentiment":"2.0"}
{"":"294","Video ID":"QYlXL_8ei6g","Comment":"About earplugs at concerts - there are a variety of frequency-balanced earplugs that protect your hearing while preserving the sound quality of the music (Eargasm and Hearos are a couple of examples). I HIGHLY recommend them!","Likes":"195.0","Sentiment":"2.0"}
{"":"295","Video ID":"QYlXL_8ei6g","Comment":"As someone who has been to many loud concerts and been in infantry, combat, and is now nearing 60, you should wear hearing protection whenever you can, same as sun protection for skin and sun glasses for your eyes.","Likes":"265.0","Sentiment":"1.0"}
{"":"296","Video ID":"QYlXL_8ei6g","Comment":"Honestly, my main take away is that I've been saying \"tinnitus\" wrong my whole life.","Likes":"122.0","Sentiment":"0.0"}
{"":"297","Video ID":"QYlXL_8ei6g","Comment":"Loved this as someone who previously studied to be an audiologist in the past. Also just love all of the \"expert answers\" videos on this channel. Thanks WIRED and Dr. Emily!","Likes":"28.0","Sentiment":"2.0"}
{"":"298","Video ID":"QYlXL_8ei6g","Comment":"This was super fascinating, although the part about the ear drum being able to self repair was the most surprising to me.","Likes":"63.0","Sentiment":"2.0"}
{"":"299","Video ID":"zFCFe38EIfE","Comment":"The universal hate for printers is what unites humanity.","Likes":"16584.0","Sentiment":"0.0"}
{"":"300","Video ID":"zFCFe38EIfE","Comment":"I suddenly gained immense amount of respect for Dyson after watching this.","Likes":"1281.0","Sentiment":"2.0"}
{"":"301","Video ID":"zFCFe38EIfE","Comment":"I'm just shocked and saddened that they've ignored the most significant vacuum cleaner advance: the retractable cord.","Likes":"1537.0","Sentiment":"0.0"}
{"":"302","Video ID":"zFCFe38EIfE","Comment":"You know you’ve made it in life when you can wear glasses like that with absolute conviction.","Likes":"1645.0","Sentiment":"2.0"}
{"":"303","Video ID":"zFCFe38EIfE","Comment":"James Dyson is actually giving really good advice here. A lot of these types of Q&A's give really generic advice.","Likes":"262.0","Sentiment":"2.0"}
{"":"304","Video ID":"zFCFe38EIfE","Comment":"\"It's a printer\"\nLol. Doesn't even matter what kind of printer, everyone can relate.","Likes":"12859.0","Sentiment":"1.0"}
{"":"305","Video ID":"zFCFe38EIfE","Comment":"Probably the best interview/Answers so far. He leaps off the screen with his eloquent and articulate manner. It is very apparent that he is simply a genius.","Likes":"1379.0","Sentiment":"2.0"}
{"":"306","Video ID":"zFCFe38EIfE","Comment":"This was so entertaining, I had no idea the person behind Dyson was a true, genuine and passionate inventor. And to see him speak so nicely about independent designers and the unfair problems they face was amazing!","Likes":"71.0","Sentiment":"2.0"}
{"":"307","Video ID":"zFCFe38EIfE","Comment":"James Dyson: Makes legendary household appliances like vacums and hair dryers\nAlso James Dyson: Loves his cast aluminum pencil sharper. \n\nThe little things in life.","Likes":"83.0","Sentiment":"2.0"}
{"":"308","Video ID":"zFCFe38EIfE","Comment":"I really wish we could see his full answers. I imagine this was a much longer video that had to be edited down. Release the directors’ cut!","Likes":"366.0","Sentiment":"1.0"}
{"":"309","Video ID":"LOrkbagIpiY","Comment":"Your videos make my weekend. It is something perfect that I can watch with my 4-year-old what we have lunch and it distracts him because his mom is leaving to work. Your videos honestly are lifesavers. Thank you","Likes":"210.0","Sentiment":"2.0"}
{"":"310","Video ID":"LOrkbagIpiY","Comment":"For the 50th video you should let AUSTIN choose a box 📦 🤷🏿‍♂️","Likes":"113.0","Sentiment":"1.0"}
{"":"311","Video ID":"LOrkbagIpiY","Comment":"8:58 I got the ReMarkable as a note taking/planner. Its has a great design. Really lightweight and better than carrying a note book or two. Subscription, depending who you are, are a hit a miss","Likes":"30.0","Sentiment":"2.0"}
{"":"312","Video ID":"LOrkbagIpiY","Comment":"Must admit, that new MX Master Mechanical keyboard looks and sounds great! Thinking of getting myself one of them now","Likes":"17.0","Sentiment":"2.0"}
{"":"313","Video ID":"LOrkbagIpiY","Comment":"This man really does love gundam. Respect.","Likes":"16.0","Sentiment":"2.0"}
{"":"314","Video ID":"LOrkbagIpiY","Comment":"Man the Grid Studios is my favorite tech. That is definitely something to get. I got it on my Christmas list this year. I like the remarkable until I see the price tag, that's the remarkable part they can get away with selling it for prices that rival apple products.","Likes":"4.0","Sentiment":"2.0"}
{"":"315","Video ID":"LOrkbagIpiY","Comment":"Jay had whole lotta energy on this video 🔥","Likes":"10.0","Sentiment":"2.0"}
{"":"316","Video ID":"LOrkbagIpiY","Comment":"As per usual, your unboxing videos make me  happy! Actually, all of them, thanks again!","Likes":"4.0","Sentiment":"2.0"}
{"":"317","Video ID":"LOrkbagIpiY","Comment":"I’ve been looking at those remarkable tablets for a few years now. I just can’t justify the price when I can carry an old school notebook lol","Likes":"0.0","Sentiment":"1.0"}
{"":"318","Video ID":"LOrkbagIpiY","Comment":"Thank you for the amazon voucher, great content as always!","Likes":"1.0","Sentiment":"2.0"}
{"":"319","Video ID":"UK5OHUmIgcc","Comment":"Hey! By popular demand I made a list of all Cool Tech Under $50 products from the last 3 years archived so you can see it all on 1 page! https://lustre.ai/creator/randomfrankp","Likes":"342.0","Sentiment":"2.0"}
{"":"320","Video ID":"UK5OHUmIgcc","Comment":"My favorite product was definitely the wireless desk charger. Hope I can finally win one of these. Love your videos Frank, keep up the great work!","Likes":"645.0","Sentiment":"2.0"}
{"":"321","Video ID":"UK5OHUmIgcc","Comment":"On the wireless phone charger, I could see installing it under the wood in your nightstands if you have the right kind of furniture for the job. Also, the Echo Dot stand is super cute! Definitely made me think of Portal Turrets too!  Definitely my favorite!","Likes":"36.0","Sentiment":"2.0"}
{"":"322","Video ID":"UK5OHUmIgcc","Comment":"Loved the “invisible” charger, would definitely contribute to keeping my clean.","Likes":"72.0","Sentiment":"2.0"}
{"":"323","Video ID":"UK5OHUmIgcc","Comment":"Wow, that wireless desk charger is insanely cool. I would love one of those.","Likes":"27.0","Sentiment":"2.0"}
{"":"324","Video ID":"UK5OHUmIgcc","Comment":"This channel is actually really cool. Instead of being just a kickstarter compilation these are all actual product reviews. Going to watch a few more before subscribing but so far extremely good channel","Likes":"5.0","Sentiment":"2.0"}
{"":"325","Video ID":"UK5OHUmIgcc","Comment":"This might be the best episode of this series ever. So many great ideas!","Likes":"40.0","Sentiment":"2.0"}
{"":"326","Video ID":"UK5OHUmIgcc","Comment":"The charger was my favorite. The hidden feature is cool but what I really like is the easy under the desk installation that also saves space","Likes":"2.0","Sentiment":"2.0"}
{"":"327","Video ID":"UK5OHUmIgcc","Comment":"What an awesome video, I love to see new affordable products come out!  This makes me wonder why certain tech devices have such an immense shelf price.  If more technology can be produced at cheaper costs, there may be some advancement in the asking price from many everyday-used devices such as laptops or desktops","Likes":"3.0","Sentiment":"2.0"}
{"":"328","Video ID":"UK5OHUmIgcc","Comment":"I love wireless setups and the wireless charger is always a bonus! Thanks for the best content as always!","Likes":"2.0","Sentiment":"2.0"}
{"":"329","Video ID":"My2Tr3k1liw","Comment":"Oh imagine when they get those sound wave extinguishers in giant sizes to catch the forest fires real quick. The people, animals and homes saved would be amazing. Not to mention the forests as well. What a brilliant invention. 😁👍☘️","Likes":"10.0","Sentiment":"2.0"}
{"":"330","Video ID":"My2Tr3k1liw","Comment":"That fire extinguisher could potentially be attached to drones to put out lightning strike fires and prevent future forest fires","Likes":"8.0","Sentiment":"1.0"}
{"":"331","Video ID":"My2Tr3k1liw","Comment":"Imagine we could just buy a sized sheet of film like a screen protector then place it on any window or surface we like , such as a mirror , bench top or car windscreen , and then be able to utilise it like a touch screen 👍 would be more practical than buying an expensive mirror","Likes":"1.0","Sentiment":"2.0"}
{"":"332","Video ID":"My2Tr3k1liw","Comment":"In my opinion, despite my fascination for the topic, an exoskeleton is a an autonomous Robot built around the human shape with the purpose of giving its \"pilot\" (haha) a sense of being superior while executing lowest work dependent on the mood of it's programmer/superuser, replacing the pilot when needed and sending all his collectable data to the company that is worried about our future with the best intentions.\nTake a look at this no.1-picture: It may now be real, but every Buster Crabbe sci fi, sorry Buck Rogers ans Flash Gordon bw-series, is showing superior uniforms that look not half as clumsy and sluggish like this shown prosthesis.","Likes":"2.0","Sentiment":"1.0"}
{"":"333","Video ID":"My2Tr3k1liw","Comment":"Floating cities sound pretty promising, as free land is already scarce. The question is who will rescue the cities from violent storms, or protect them from armed pirates. A floating city will need its own defenses, but will that be allowed within the 12 mile territorial limit?","Likes":"3.0","Sentiment":"1.0"}
{"":"334","Video ID":"My2Tr3k1liw","Comment":"It’s awesome, but what happens to the humans that used to do these jobs?","Likes":"2.0","Sentiment":"2.0"}
{"":"335","Video ID":"My2Tr3k1liw","Comment":"I want to know what problem that Quantum computer solved in a few minutes that would take a normal computer 10,000 years.","Likes":"2.0","Sentiment":"1.0"}
{"":"336","Video ID":"My2Tr3k1liw","Comment":"AI is the most important one, a lot of people think AI is going to somehow mean self awareness, consciousness at some point.\nThe main implications of AI is that it is self improving, the true ramifications of this are not yet known but what is going to happen\nis that AI is going to overtake humans in a lot of things, including research and science. It is going to snowball at some point and this is going to change\neverything about life far more than the industrial era did. For  example, 300 years from now we can have an AI program that has been improving itself for 300 years.\nWe lose about 1.4 million people each year from car accidents, and that is just fatalities, there are also many more injuries. So while I understand people being\nskeptical about machines driving cars, as time goes on it is not even going to be close, AI is going to be able to do many, many things better than humans.\nAt some point, these quantum computers are going to make AI, they could program an AI to make a better AI of itself, an improved version.\nThen the 2nd one can make a 3rd one that is better then it, etc. etc.\nThere is really no telling what this is going to do because we are not there yet but it is going to change things very rapidly when it happens.","Likes":"3.0","Sentiment":"1.0"}
{"":"337","Video ID":"My2Tr3k1liw","Comment":"The claim about the quantum computer came and went. I'm not sure who is on top. I'd like to see more of the Chinese tech. We seem to have very little insight into what they are doing.","Likes":"0.0","Sentiment":"1.0"}
{"":"338","Video ID":"IUwqf08-FKU","Comment":"I can confirm her squirrel facts.  I raised an orphaned one, and it was the sweetest cuddliest pet until it almost grown.  Woke up one morning an she acted like a wild animal: biting, scratching, trying to eat my face off...  It was a sad day, but I've checked wanting a squirrel off my list!","Likes":"5662.0","Sentiment":"0.0"}
{"":"339","Video ID":"IUwqf08-FKU","Comment":"Adore the collection of people you have answering questions. They are so intelligent in their respective subject and superbly passionate. Love learning more.","Likes":"4836.0","Sentiment":"2.0"}
{"":"340","Video ID":"IUwqf08-FKU","Comment":"I swear to God, every \"can I have this exotic pet\" question can just be answered with the words \"Do you know what 'domestication' is and how long it takes?\"","Likes":"1798.0","Sentiment":"0.0"}
{"":"341","Video ID":"IUwqf08-FKU","Comment":"\"Some dogs will let you brush their teeth\"\n\n*Shows Jack struggling vehemently against having his teeth brushed*","Likes":"5528.0","Sentiment":"1.0"}
{"":"342","Video ID":"IUwqf08-FKU","Comment":"Declawing cats.\nStop calling it declawing, it has nothing to do with the claws.\nAs the vet said, it is amputating the toes.\nCats have claws. If you have a problem with claws, dont get a cat.","Likes":"2356.0","Sentiment":"0.0"}
{"":"343","Video ID":"IUwqf08-FKU","Comment":"THANK YOU for addressing declawing cats, and how awful and hurtful it is to the cat!","Likes":"2538.0","Sentiment":"0.0"}
{"":"344","Video ID":"IUwqf08-FKU","Comment":"I have a cat who was declawed by a previous owner. He has so many behavioral issues that are typical of declawed cats. He was just at the vet yesterday for litter box issues and the vet brought up the fact that he was declawed. Declawing inflicts lifelong trauma on the animal.","Likes":"989.0","Sentiment":"0.0"}
{"":"345","Video ID":"IUwqf08-FKU","Comment":"This woman was born to be a vet. You can just tell. She's the 1% of Kindergarten girls who's living the dream! 😎👍🏻🙏🏻","Likes":"739.0","Sentiment":"2.0"}
{"":"346","Video ID":"IUwqf08-FKU","Comment":"Exotic animals as pets should be illegal. Tigers don't belong in farms, sugar gliders don't belong in apartments. Sad to see that this happens still.","Likes":"3368.0","Sentiment":"0.0"}
{"":"347","Video ID":"IUwqf08-FKU","Comment":"If you decide to brush a cat's teeth, a fencing mask is highly recommended.","Likes":"415.0","Sentiment":"2.0"}
{"":"348","Video ID":"U48UrDpXGog","Comment":"Let us know your tech queries using #AskGCNTech 👇","Likes":"2.0","Sentiment":"1.0"}
{"":"349","Video ID":"U48UrDpXGog","Comment":"I had a recent fall at work and because I trained myself how to fall off a bike safely, I only had minor bruising on my butt. I did a tuck and roll like when I fall off the bike. Great advise Alex and Ollie.","Likes":"7.0","Sentiment":"2.0"}
{"":"350","Video ID":"U48UrDpXGog","Comment":"When I got right hooked a few years ago, I only had time to think “this is gonna suck” and then proceeded to roll a ways on the pavement. Fortunately, I came away with ‘only’ bruises and road rash. Nothing got broken, and I think in part it was because I didn’t have a chance to put my hands out. Also, glad I was wearing a helmet!","Likes":"2.0","Sentiment":"2.0"}
{"":"351","Video ID":"U48UrDpXGog","Comment":"I still have my copy of Eddie Borysewicz's \"Bicycle Road Racing\" (1985). In it he discusses practicing tumbling and diving somersaults in a gym to improve your crash response. Unfortunately I haven't practiced that, but my last inelegant dismount was at low speed, so only some skin lost.","Likes":"2.0","Sentiment":"1.0"}
{"":"352","Video ID":"U48UrDpXGog","Comment":"#AskGCNTech after two years of running tubes, I finally went tubeless a couple of months ago. I managed to puncture my tyre the other day. Sealant didn’t do the trick nor did a couple of slugs - even tried a patch inside the tyre. The puncture was not on the sidewall and may have been 3mm large. Given the tire had plenty of life left, I am gutted that I may have to discard the tire now. When would you come to a decision that a tubeless tire is KO?","Likes":"3.0","Sentiment":"0.0"}
{"":"353","Video ID":"U48UrDpXGog","Comment":"#askgcntech Riding in a strong crosswind the other day, I wondered if a high cadence would give a gyroscope effect and reduce buffeting from the wind.  Presumably from feet and shoes if so. Can Ollie show us the maths please.","Likes":"0.0","Sentiment":"1.0"}
{"":"354","Video ID":"U48UrDpXGog","Comment":"My last crash (3 yrs ago).  I was on the ground so fast, I had no time to react or prepare for the impact.  But the scar from my collar bone repair looks pretty cool...","Likes":"0.0","Sentiment":"2.0"}
{"":"355","Video ID":"U48UrDpXGog","Comment":"Another problem with filling tires with water is that the first bump you hit will probably cause the tire to blow off the rim.  Water is incompressible, unlike air, so it has to go somewhere when the tire volume gets changed due to an impact.","Likes":"3.0","Sentiment":"0.0"}
{"":"356","Video ID":"U48UrDpXGog","Comment":"#AskGCNTech As a heavier rider, I feel I’m always in the max range of gears, either hardest gear on flat’sh roads or my easiest gear when I see any sustained gradients. I currently run a compact chain set with a 12-30 cassette on the rear. Would I benefit from upping my chain set to give me more usable gears or would this just make my climbing problem even worse due to the worse range at the rear","Likes":"1.0","Sentiment":"0.0"}
{"":"357","Video ID":"U48UrDpXGog","Comment":"I bought an old tractor to help clear the land I was building on. \"Stick with me.\" \nI was towing a large log when I felt the back of my leg getting wet. No problem on the front of my trousers thank goodness. Turned out that a large sick had punctured one of the rear tires (tyres) \nApparently it was fairly common practice to half fill the rear tyres (tires) with water to improve traction due to the added weight. Maybe sealant would be a better idea. Expensive though.\nLove the show guys","Likes":"0.0","Sentiment":"2.0"}
{"":"358","Video ID":"-pTGc7cIBIA","Comment":"MKBHD's Dad: What do we gift him? He's a tech blogger. He has every freaking piece of tech.\n\nMKBHD's Mom: Let's get him a water bottle!","Likes":"5170.0","Sentiment":"1.0"}
{"":"359","Video ID":"-pTGc7cIBIA","Comment":"0:00-Intro\n0:37-Backpack\n1:40-16-Inch MacBook Pro/M1 Max\n2:23-SD Card Reader\n2:42-AirPods Max\n2:59-AirTags\n3:07-Body Cap For Canon R5\n3:13-Webcam\n3:47-Canon R5\n4:18-Cables\n4:54-Power Adapter/10W\n5:02-RealMe Power Adapter\n5:33-Apple Watch Charger\n6:00-Pens\n6:11-Adapter\n6:40-Wallet\n7:50-iPhone 13 Pro\n8:14-Pixel 6 Pro\n\n\nBye","Likes":"1060.0","Sentiment":"1.0"}
{"":"360","Video ID":"-pTGc7cIBIA","Comment":"Having shot Canon for 20 years I switched the Nikon in 2016. Love both brands, but prefered the Nikon ergonomics with the dual command dials rather than the Canon methodology of the 4 buttons on the top plate. R5 really improved that but I love the ISOless nature of the Nikon sensors. Canon is getting better in that regard but still behind Nikon and Sony.","Likes":"81.0","Sentiment":"2.0"}
{"":"361","Video ID":"-pTGc7cIBIA","Comment":"Hey Marques! I know these sound insignificant, but since you rarely update your little dongles/accessories that you carry around and your apps on your home screens, I think it would be interesting to get a little maybe quarterly series where you talk about any changes and what you'd like to see changed/simplified with those work flows. Just an idea!","Likes":"48.0","Sentiment":"2.0"}
{"":"362","Video ID":"-pTGc7cIBIA","Comment":"@MKBHD I\"m a photographer and use the Peak EDC V2.  I'm impressed you got a 16\" into the 20L  I'm sure it's a snug fit and doesn't leave alot of room for a ipad too.  Wanted to give you a little tip I found on that bag, here goes: The main compartment has a pass through to the top zip area where phones, airpods, etc go.  You just have to fish a cable through the corner.  I do this by unzipping the side compartment enough to fish through the cable.  It makes it so I can leave a pass through USB travel battery charger with folding prongs, that means I plug in all my devices when they're in the zip area (laptop, phone, tablet and airpods) and they all get charge from the battery AND when I get to the hotel late, I just plug one one cable into the wall outlet and I hear all my devices chime in unison that they are now charging neatly in place.  Not only that when they're done charging the battery starts charging.  I wake up with everything ready to go.  Hope you enjoy trying this out. :)","Likes":"44.0","Sentiment":"2.0"}
{"":"363","Video ID":"-pTGc7cIBIA","Comment":"Would love to see an EDC/daily tech for everyone else in The Studio!","Likes":"6583.0","Sentiment":"2.0"}
{"":"364","Video ID":"-pTGc7cIBIA","Comment":"Marques's reaction was genuine here. He was excited to know as what will come out of his bag next 🤪","Likes":"9.0","Sentiment":"2.0"}
{"":"365","Video ID":"-pTGc7cIBIA","Comment":"I went to check out the Opal camera because I need a webcam upgrade and it looked pretty legit. I loved everything I saw on the site up until the point of the $4/month fee to use their software?! on a $300 webcam?! I think I'll just get a capture card for my mirrorless or pick up a Logi webcam instead :/\n\nother than that, nice tech kit.\n\nAlso, yeah, your experience with the Pixel 6 mirrors my past experience with Pixel phones. I got one to try something different to the iPhone and I loved it for a few months. I tried a few customizations but found that leaving it stock was generally the best experience for me. Then it started unexpectedly slowing down or apps would wig out and crash on me out of nowhere or the camera just wouldn't or it would reboot in the middle of doing something.","Likes":"3.0","Sentiment":"2.0"}
{"":"366","Video ID":"-pTGc7cIBIA","Comment":"You are carrying great tech, and it makes total sense that you are rellying more and more on Apple, their ecosystem is really good. I am an Android user and don't stick to just one brand but my wife is All-Apple and she really likes how seemless everything is. Cool stuff Marques.","Likes":"3.0","Sentiment":"2.0"}
{"":"367","Video ID":"-pTGc7cIBIA","Comment":"Hey Marques, can you do an updated “The Ecosystem explained” I think a lot of viewers would appreciate a video not only for Apple side of the ecosystem but also Android, seeing as though a lot of new products are coming out in support for easy use for Androids. Love all your videos btw! 🖤","Likes":"2.0","Sentiment":"2.0"}
{"":"368","Video ID":"_f8Gb-vojoU","Comment":"I can see that exoskeleton helping people with limited mobility in the future. It's a marvelous piece of tech. Thanks for giving us a glimpse of things to come!","Likes":"208.0","Sentiment":"2.0"}
{"":"369","Video ID":"_f8Gb-vojoU","Comment":"the exoskeleton probably wouldn’t be affordable for everyone to use, and may have long term effects, but i think it would be amazing for rehabilitation and other medical related use!","Likes":"105.0","Sentiment":"2.0"}
{"":"370","Video ID":"_f8Gb-vojoU","Comment":"I've got that Azeron keypad. HIGHLY recommend it for all kinds of applications where quickness is ideal, but especially for gaming. Highly highly. You can even find certain models on Amazon usually. I ordered mine from the factory, for the color scheme and one of the newer designs. (the one on this video is the original design, which I'm sure is still just as phenomenal, but my fingers twitch randomly sometimes, so having the buttons above the knuckle could have been a problem.","Likes":"46.0","Sentiment":"2.0"}
{"":"371","Video ID":"_f8Gb-vojoU","Comment":"The game pad that you highlighted actually is already available. I am a right arm amputee and also a big gamer and was considering buying it but it’s over $200 US and you would still need a mouse. Also I have already become very proficient using a standard controller for gaming already and mostly mostly use an Xbox controller for my PC so I decided it wasn’t worth it. But it’s still a very good design in my opinion and I would love to see how it feels to use irl just not at that price point lol.","Likes":"43.0","Sentiment":"2.0"}
{"":"372","Video ID":"_f8Gb-vojoU","Comment":"Cyborg game controller looks pretty neat. I am from from Latvia and that company makes pretty high end gaming gear (expensive too).","Likes":"19.0","Sentiment":"2.0"}
{"":"373","Video ID":"_f8Gb-vojoU","Comment":"2:00 can you imagine being able to one day look out a window and determine what the weather is like? the future truly is here","Likes":"197.0","Sentiment":"1.0"}
{"":"374","Video ID":"_f8Gb-vojoU","Comment":"I will forever appreciate this channel, you've helped me and my family a lot, your videos, advice, lessons and funny words are Inspirational and helpful to us. My husband and I have been able to minimal, conscious in spending, saving and investing wisely, I now earn every week. You're such a blessing to this generation, we all love you","Likes":"97.0","Sentiment":"2.0"}
{"":"375","Video ID":"_f8Gb-vojoU","Comment":"Wow imagine having the ability to determine the weather simply by looking out the window, what a world we are living in.","Likes":"6.0","Sentiment":"1.0"}
{"":"376","Video ID":"_f8Gb-vojoU","Comment":"Man, to think one day I might be able to own a dehumidifier and a battery. Wow.","Likes":"66.0","Sentiment":"2.0"}
{"":"377","Video ID":"_f8Gb-vojoU","Comment":"Yes, the game pad is incredibly convenient, but incredibly expensive so seemingly lower quality production  than it's competitors, that being said I would sure love to have one.","Likes":"14.0","Sentiment":"2.0"}
{"":"378","Video ID":"MAeXrShneoQ","Comment":"When someone tells a lie,\r\ndeep down they know this is wrong.\r\nThey have no compassion.","Likes":"2.0","Sentiment":"0.0"}
{"":"379","Video ID":"MAeXrShneoQ","Comment":"When you as an employee are fired from a company and the reasons they are giving you are “poor performance, or lack of culture fit”, trust me when I tell you the real reasons are not disclosed. Been there, done that. Companies lie, HR works for the company and also lies, and a corporation hierarchy matters. When you lawyer up is when they start taking you a bit more seriously.","Likes":"14.0","Sentiment":"0.0"}
{"":"380","Video ID":"MAeXrShneoQ","Comment":"Great daily blog!!!  You all do a great job picking the most relevant daily headline to cover.  Such a high level discussion in such a short clip.  I watch or listen every day!!","Likes":"2.0","Sentiment":"2.0"}
{"":"381","Video ID":"MAeXrShneoQ","Comment":"The market cycle still hasn't met its balance, we keep going round in circles while waiting for that huge blow out on a huge support but in the mean time we could always ignore the market ups and downs and stay fully invested. Big thanks to Lily Alice for helping me earn over 14 btc by implementing her method and following her guide.","Likes":"51.0","Sentiment":"2.0"}
{"":"382","Video ID":"MAeXrShneoQ","Comment":"All the musk haters who said he was doing this for laughs are salty rn","Likes":"25.0","Sentiment":"0.0"}
{"":"383","Video ID":"MAeXrShneoQ","Comment":"Thank you for this report, well done and very helpful.","Likes":"9.0","Sentiment":"2.0"}
{"":"384","Video ID":"MAeXrShneoQ","Comment":"Most tech companies let things like this slide all the time….","Likes":"0.0","Sentiment":"0.0"}
{"":"385","Video ID":"MAeXrShneoQ","Comment":"Karma hit Twitter hard 😂😂","Likes":"4.0","Sentiment":"0.0"}
{"":"386","Video ID":"MAeXrShneoQ","Comment":"Zoe could be replaced by Siri and these videos would be exactly the same","Likes":"9.0","Sentiment":"1.0"}
{"":"387","Video ID":"MAeXrShneoQ","Comment":"When it comes to a person journalist slander up and down when it’s a company you say they are allegations?","Likes":"2.0","Sentiment":"0.0"}
{"":"388","Video ID":"AREK4H8k7Ng","Comment":"Fun Fact: even though the employees get $5,000 for an upgrade, it usually does not cover the cost of the things Linus breaks.","Likes":"7757.0","Sentiment":"1.0"}
{"":"389","Video ID":"AREK4H8k7Ng","Comment":"“Once you spend 5 to 10 grand on magic cards you kinda don’t wanna pay for them anymore” really hits home for me.","Likes":"449.0","Sentiment":"0.0"}
{"":"390","Video ID":"AREK4H8k7Ng","Comment":"It's almost impressive how many LTT employees even with a $5k upgrade have the jankiest setups I have ever seen.","Likes":"93.0","Sentiment":"2.0"}
{"":"391","Video ID":"AREK4H8k7Ng","Comment":"Just a note on the screw driver. Put some \"extended\" bits with it or a smaller precision screw driver in the set with it.  Its very common for some screws to be deep in a hole and having those small bits into hex end wont go in far enough down the hole to extract screw. I see this allot on Laptops, controllers that kinda thing. Sunk in screws suck.","Likes":"135.0","Sentiment":"0.0"}
{"":"392","Video ID":"AREK4H8k7Ng","Comment":"At this point I think that the whole point of labs was to fill it with more employees so that we never run out of Intel tech upgrades \n\nI will buy as many screwdrivers as it takes to pay their salaries plz just give me more Intel extreme tech upgrades","Likes":"131.0","Sentiment":"1.0"}
{"":"393","Video ID":"AREK4H8k7Ng","Comment":"LTT Extreme Tech Upgrades will never not be absolutely funny and (somewhat) informative :)","Likes":"3310.0","Sentiment":"2.0"}
{"":"394","Video ID":"AREK4H8k7Ng","Comment":"I think one of the things I love the most about these intel extreme upgrades is Linus learning and getting angry at his employees for everything about their lives.","Likes":"35.0","Sentiment":"2.0"}
{"":"395","Video ID":"AREK4H8k7Ng","Comment":"This episode has me cracking up hard! Love the rabbit hole that Nick has gone down with the keyboard mods. Respect.","Likes":"22.0","Sentiment":"2.0"}
{"":"396","Video ID":"AREK4H8k7Ng","Comment":"I love how even Linus doesnt want to fit all those hard drives in in a such a jank way. Im with you Linus, I'll do a lot to make things easier but thats a bit too far XD","Likes":"8.0","Sentiment":"2.0"}
{"":"397","Video ID":"AREK4H8k7Ng","Comment":"I love his space. It's messy, full of things that he could throw away if he really went through it all, but it's a catalog of and container for life as he's living it rather than just a show piece.","Likes":"8.0","Sentiment":"2.0"}
{"":"398","Video ID":"B0HI0RTZdJw","Comment":"After seeing the macro pad I was checking out their website and loved all their products. I've wanted a product like this for when I stream to make it easier, and this here is just what I need. It's a great product and I'd love it for my setup.","Likes":"296.0","Sentiment":"2.0"}
{"":"399","Video ID":"B0HI0RTZdJw","Comment":"Very surprised with this month's list, considering how every single item in the list feels like it could go with my setup or just seems super cool to me. Usually there's one or two items that I don't think I'd personally find useful, but I am 100% adding all these items to my wishlist!","Likes":"80.0","Sentiment":"2.0"}
{"":"400","Video ID":"B0HI0RTZdJw","Comment":"I absolutely loved the Hoto laser measuring tool. As an engineering student, I am constantly measuring objects and like using various rulers. I would love to own one of these Hoto laser measuring tools for sure! Also, this months list particularly caught my eye, as everything listed seems like something I would want to purchase in the near future.","Likes":"11.0","Sentiment":"2.0"}
{"":"401","Video ID":"B0HI0RTZdJw","Comment":"So many great products on this list! These are all incredibly practical too, especially the macropad. The abililty to customize literally every aspect of it is killer.","Likes":"9.0","Sentiment":"2.0"}
{"":"402","Video ID":"B0HI0RTZdJw","Comment":"The Hoto laser was a pretty good change of pace, loved it. Feels very complementary to the theme of office gadgets! Keep em coming! Ideas: specific under-desk drawers, and other more “furniture” alike stuff that will make your setup noice.","Likes":"7.0","Sentiment":"2.0"}
{"":"403","Video ID":"B0HI0RTZdJw","Comment":"TIMESTAMPS\n\n0:40 Hoto Laser Measuring Tool\n\n2:40 AXIS 16 Fan/Light\n\n4:23 Mechanical PC Switch\n\n6:20  Pikatea R26 Macropad\n\n8:45 Biometric Drawer Lock","Likes":"234.0","Sentiment":"1.0"}
{"":"404","Video ID":"B0HI0RTZdJw","Comment":"Just discovered your channel and the series. Going to be watching your older ones today while working. That macro pad is really cool. That would definitely be something I'd pick up and use.","Likes":"3.0","Sentiment":"2.0"}
{"":"405","Video ID":"B0HI0RTZdJw","Comment":"That macropad looks killer! Been looking for a segue into custom keyboards for a while and that seems like a great place to start. Looks like it would be incredibly useful for both work and personal applications too which is a huge plus. Would love to have one in the near future!","Likes":"3.0","Sentiment":"2.0"}
{"":"406","Video ID":"B0HI0RTZdJw","Comment":"I’ve actually been looking for macro pads recently and you just upload the very thing I needed! I love that you can customize it to fit your aesthetic, truly a must have for any setup","Likes":"0.0","Sentiment":"2.0"}
{"":"407","Video ID":"B0HI0RTZdJw","Comment":"That macropad looks so 🔥 love the customisation of it all!","Likes":"2.0","Sentiment":"2.0"}
{"":"408","Video ID":"Wuq7lS9rljw","Comment":"Yooo, long time no see!  Just so you're updated, I've spent the last week in North Carolina, and I've filmed no less than 3 BIG videos that are all dropping this July 🔥\nFor more Tech Fails: https://www.youtube.com/watch?v=IErvIekMD3U&list=PLflqtq8EOGAKyBKc12n4dPiIAex5n4NgC&index=1","Likes":"2487.0","Sentiment":"1.0"}
{"":"409","Video ID":"Wuq7lS9rljw","Comment":"Arun: \"This product killed over a hundred people\"\nAlso Arun: \"7 out of 10\"","Likes":"3105.0","Sentiment":"0.0"}
{"":"410","Video ID":"Wuq7lS9rljw","Comment":"Arun: \"This product destroyed the entirety of Earth\"\nAlso Arun: \"6 out of 10 fail\"","Likes":"251.0","Sentiment":"0.0"}
{"":"411","Video ID":"Wuq7lS9rljw","Comment":"Man, I seriously love this series and the fact that you buy these failed products, steps thing up a notch.","Likes":"141.0","Sentiment":"2.0"}
{"":"412","Video ID":"Wuq7lS9rljw","Comment":"Great to see you including a wider variety of stuff in these videos beyond just electronic devices, especially the pharmaceutical industry. If you're going to include banned medications then the top of the list in your next video should be Thalidomide. What it did was absolutely tragic, it was banned decades ago yet people are still suffering and living with severe disabilities to this day. Thousands of families destroyed and lives lost too.","Likes":"38.0","Sentiment":"0.0"}
{"":"413","Video ID":"Wuq7lS9rljw","Comment":"This is such a good video, Arun. The amount of research, locations, and editing that this video needed is enormous. Thank you for doing this 👌❤️","Likes":"19.0","Sentiment":"2.0"}
{"":"414","Video ID":"Wuq7lS9rljw","Comment":"Arun looks so fit now, I'm glad to see him taking care of himself too","Likes":"2731.0","Sentiment":"2.0"}
{"":"415","Video ID":"Wuq7lS9rljw","Comment":"There was also another problem with the fit-bit, when some of the straps would irritate your skin and leave a rash and still the company hasn't dealt with it yet.","Likes":"12.0","Sentiment":"0.0"}
{"":"416","Video ID":"Wuq7lS9rljw","Comment":"10:35\nThis is a common misconception. While part of the reason was the battery being too thin, the main issue was a manufacturing defect in the corner of most of the batteries at launch, which was a tiny dent in the top (left?) corner. This would cause the battery to eventually short out, as the dent caused both terminals to eventually touch each other. Most people's phones were exploding while fast charging, which was likely due to the increased power going through the battery, and lithium-ion batteries do not take well to being shorted out like that.\n\nEdit: Normally defects of that scale would be perfectly fine, and would never cause issues, but they made the battery too thin, meaning it shorted it out easier. Just wanted to clarify that.","Likes":"2.0","Sentiment":"0.0"}
{"":"417","Video ID":"Wuq7lS9rljw","Comment":"I now know I like this guy. I at first thought I had some type of prejudicial dislike of him maybe because he was too smooth and that goes against my grain but I love this guy because he does seem to care about things and many of them seem not to be regarding how much money he can make off of a ad for a person it seems as his reviews are sincere and these seem not to have to do with what I've seen only from him which is technology I really love the fact that this guy cares about people's safety and he brings up some safety issues which people should be concerned about if they have children especially with the toys and the baby monitors yeah this guy is getting a big a+ from me.","Likes":"5.0","Sentiment":"2.0"}
{"":"418","Video ID":"VuG4BcghOSg","Comment":"I'm hoping this video will blow you away!  SO much work has gone into it, and SO many people have been fed because of it 😂\nTo Check out the TINIEST Tech: https://youtu.be/syB1ezRvKpU","Likes":"4831.0","Sentiment":"2.0"}
{"":"419","Video ID":"VuG4BcghOSg","Comment":"Arun: ok now it’s time for the mouse pad!\nAlso Arun: *pulls out a yoga mat*","Likes":"3328.0","Sentiment":"1.0"}
{"":"420","Video ID":"VuG4BcghOSg","Comment":"Yes, you definitely need to fill the lighter with fluid. They are shipped empty for safety reasons. The smoke you were getting was because you were burning up the dry wick.","Likes":"62.0","Sentiment":"1.0"}
{"":"421","Video ID":"VuG4BcghOSg","Comment":"I really appreciate this Shaq episode and the effort that went into making it. normal looking  things scaled up seems much like mr.beast kinda thing. think u got inspired by him. \ni have seen the giant toblerone before in  'Sorted'. the incredible cooking channel has shown the chocolate bar in their occasion based pretentious product series. it cost may be 70 pounds.but what u showed is probably bigger than sorted one.it's actually  cool.\nand it is my  favourite chocolate bar too.","Likes":"18.0","Sentiment":"2.0"}
{"":"422","Video ID":"VuG4BcghOSg","Comment":"Those earbuds are actually pretty cool. Decorate it somewhere good and it’d act like good speakers","Likes":"3.0","Sentiment":"2.0"}
{"":"423","Video ID":"VuG4BcghOSg","Comment":"i actually have a mousemat that came with my desk thats larger than the one you have, its specifically designed to cover the entire surface of the 55 inch desk since its a desk built for gaming","Likes":"3.0","Sentiment":"2.0"}
{"":"424","Video ID":"VuG4BcghOSg","Comment":"Him: we’re gonna spend 10K on giant tech products in the next 4 mins.\nAlso him: *buys a 4.5kg chocolate bar*","Likes":"1451.0","Sentiment":"1.0"}
{"":"425","Video ID":"VuG4BcghOSg","Comment":"Wow! I never seen technology that big before!","Likes":"3.0","Sentiment":"2.0"}
{"":"426","Video ID":"VuG4BcghOSg","Comment":"6:50\nlittle did he know there was lots of those keyboards on amazon that\nhe could of got insted of doing that lol","Likes":"2.0","Sentiment":"1.0"}
{"":"427","Video ID":"VuG4BcghOSg","Comment":"i have so much respect for you feeding the homeless with the cake!","Likes":"0.0","Sentiment":"2.0"}
{"":"428","Video ID":"o-jUQhCeazQ","Comment":"If Gaiman decides to start a YouTube channel to talk about myths and history I would definitely watch that.","Likes":"6320.0","Sentiment":"2.0"}
{"":"429","Video ID":"o-jUQhCeazQ","Comment":"Neil Gaiman could read me my groceries list and I would still feel like he's reading us a story for the ages","Likes":"4239.0","Sentiment":"1.0"}
{"":"430","Video ID":"o-jUQhCeazQ","Comment":"I know this isn't entirely uncommon with authors, but I've always loved how much Neil Gaiman feels like a Neil Gaiman character.","Likes":"3956.0","Sentiment":"2.0"}
{"":"431","Video ID":"o-jUQhCeazQ","Comment":"You know it’s gonna be great when he says “unless it’s a furry Minotaur” and then specified that this is going to be great","Likes":"3071.0","Sentiment":"2.0"}
{"":"432","Video ID":"o-jUQhCeazQ","Comment":"He seems like the younger, nerdier, slightly crazy brother of Alan Rickman 😂","Likes":"1686.0","Sentiment":"1.0"}
{"":"433","Video ID":"o-jUQhCeazQ","Comment":"It's nice to see mr. Gaiman talk about Death as being kind. His friend (and occasional co-author) Terry Pratchett wrote about death in the same way.","Likes":"894.0","Sentiment":"2.0"}
{"":"434","Video ID":"o-jUQhCeazQ","Comment":"I love hearing Neil speak and explain things. He’s such a character 😂","Likes":"997.0","Sentiment":"2.0"}
{"":"435","Video ID":"o-jUQhCeazQ","Comment":"I have been in love with Mr. Gaiman for decades and I couldn't click on this video fast enough.  Major thanks to WIRED for this video and major thanks to Mr. Gaiman for doing this for all us fans who can't get enough of him.","Likes":"950.0","Sentiment":"2.0"}
{"":"436","Video ID":"o-jUQhCeazQ","Comment":"I want Neil Gaiman, Rick Riordan and Stephen Fry all in one room discussing myths and mythology.\nThat would be a colab of a century  for me.","Likes":"55.0","Sentiment":"1.0"}
{"":"437","Video ID":"o-jUQhCeazQ","Comment":"I love how he sings his words. \"Ragnarok essennntially beginnnnnnns with everything going wrong\"","Likes":"923.0","Sentiment":"2.0"}
{"":"438","Video ID":"-ju6y-pHByw","Comment":"You can tell he's serious about his craft, but not obnoxious about it. The best you can hope for","Likes":"4224.0","Sentiment":"2.0"}
{"":"439","Video ID":"-ju6y-pHByw","Comment":"Hes really respectful of people enjoying sushi differently.  Class act.","Likes":"942.0","Sentiment":"2.0"}
{"":"440","Video ID":"-ju6y-pHByw","Comment":"\"Nothing should look sad. It should look bright.\"\n\nGood to know when the aliens come down looking for human sashimi they won't be coming after me.","Likes":"1003.0","Sentiment":"2.0"}
{"":"441","Video ID":"-ju6y-pHByw","Comment":"You can tell he smiles all the time. He just has a happy atmosphere.","Likes":"332.0","Sentiment":"2.0"}
{"":"442","Video ID":"-ju6y-pHByw","Comment":"I love how positive this guy is. Never says a bad word about anyone. Made me feel like I'm not stupid even when he's dispelling my wildly inaccurate preconceptions.","Likes":"6053.0","Sentiment":"2.0"}
{"":"443","Video ID":"-ju6y-pHByw","Comment":"I met a sushi chef back in 1985 who had been living in the USA for thirty years at the time. He claimed to be the inventor of California roll. He said he developed it to warm customers to the concept of sushi. Sort of a beginner’s sushi.","Likes":"427.0","Sentiment":"1.0"}
{"":"444","Video ID":"-ju6y-pHByw","Comment":"\"(...) as long as people understand that this is not traditional\r\nchefs have the creative freedom to do whatever they want.\"\npitty so many prefer to gatekeep stuff and belittle others who merely do things differently\nrespect to Taka Sakaeda. what a lovely person","Likes":"162.0","Sentiment":"2.0"}
{"":"445","Video ID":"-ju6y-pHByw","Comment":"A friend of mine chastised me for eating sushi with my hands, saying it's not finger food. It was nice to hear the chef say the literal opposite of that.","Likes":"83.0","Sentiment":"1.0"}
{"":"446","Video ID":"-ju6y-pHByw","Comment":"Sushi chef is answering the real questions","Likes":"637.0","Sentiment":"1.0"}
{"":"447","Video ID":"-ju6y-pHByw","Comment":"I am so glad I got to see a sushi chef refer to sushi as finger food. \nI am tired of the snobs looking at me weird every time I decide to just pick up a piece and eat it.","Likes":"3462.0","Sentiment":"2.0"}
{"":"448","Video ID":"-VVLmBXHvL8","Comment":"Really appreciate you taking the time and effort of putting it out there. Look forward to watching more of your great content. In the past two years, assets like Gold 7%, Nasdaq 19%, and S&P 29% have all lagged behind the USD monetary inflation rate (M2 money supply is up 36%) while Bitcoin has appreciated 229% during the same period. <My stock portfolio over the last 2 years is massively down against my bitcoin using Thomas Fuller strategy. In my view Bitcoin has been one of the best holds during this uncertain market. My Bitcoin portfolio have been on a rise although the rates are capricious wiping out some of my profits i still have about 9.14' btc! worth of crypto assets. I can take a drop down to 20k and still be doing better than my stock portfolio. <I've stopped buying most stocks, I'm DCA'ing into Bitcoin, and I'm hoarding cash that will go entirely into Bitcoin if there's another good drop📊...","Likes":"16.0","Sentiment":"2.0"}
{"":"449","Video ID":"-VVLmBXHvL8","Comment":"The record I'll love to break is becoming the first millionaire in my family history, I've read about people coming from the dirt to making over $2millions in few years, and I'd love to know how to build wealth and amass good profit against all odds.","Likes":"58.0","Sentiment":"2.0"}
{"":"450","Video ID":"-VVLmBXHvL8","Comment":"Last week they said to sell it all. Now they say buy🤣😂 glad I never listen to these frauds","Likes":"1.0","Sentiment":"0.0"}
{"":"451","Video ID":"-VVLmBXHvL8","Comment":"What's the best way to make money from crypto investing?","Likes":"6.0","Sentiment":"1.0"}
{"":"452","Video ID":"-VVLmBXHvL8","Comment":"MY FINANCIAL GOAL IS TO BE MAKING AT LEAST UP TO $1,000,000 EVERY YEAR BY INVESTING HEAVILY BOTH IN CRYPTO AND STOCK. I NEED GUIDIANCE. please comment below....","Likes":"0.0","Sentiment":"1.0"}
{"":"453","Video ID":"UxjgqBamqDU","Comment":"Can definitely vouch for the Switch grip. I used to never play handheld mode because of how uncomfortable it was. Now I do it all the time with the grip!","Likes":"43.0","Sentiment":"2.0"}
{"":"454","Video ID":"UxjgqBamqDU","Comment":"Dude! that battery swap alone would sell me over the Sony H9, Steelseries hit it hard with that feature! I wish more peripherals had that ability!","Likes":"7.0","Sentiment":"2.0"}
{"":"455","Video ID":"UxjgqBamqDU","Comment":"It's a great month for tech with a lot of cool and reliable products. Love em all!","Likes":"15.0","Sentiment":"2.0"}
{"":"456","Video ID":"UxjgqBamqDU","Comment":"I gotta admit, that SteelSeries Headset is next level! Also the Switch grip being under $20 is a steal.","Likes":"3.0","Sentiment":"2.0"}
{"":"457","Video ID":"UxjgqBamqDU","Comment":"The Oivo grip is amazing! Have one for my V2 switch as well","Likes":"0.0","Sentiment":"2.0"}
{"":"458","Video ID":"UxjgqBamqDU","Comment":"The music in the background is just a classic for this channel! Love it!","Likes":"6.0","Sentiment":"2.0"}
{"":"459","Video ID":"UxjgqBamqDU","Comment":"Grover also lets you buy products if you keep renting every month until it reaches retail price. Realy like that laptop keep renting until it you've paid the equivalent of retail and its yours. Easy payment plan type vibes.","Likes":"7.0","Sentiment":"1.0"}
{"":"460","Video ID":"UxjgqBamqDU","Comment":"Yes, for your sponsor Grover. If you keep renting a product until you reach its retail price, you can keep it forever for a symbolic dollar. Or, if you fall in love with an item before that, you can also pay it off at any point. So the only issue I find with that is why must we have to pay retail for a refurbished  or used item?","Likes":"0.0","Sentiment":"1.0"}
{"":"461","Video ID":"UxjgqBamqDU","Comment":"Best part about the Novas is being able to use the switch with it since it has BT. I go from PC, play some ps5, then go off the grid with the switch all on one headset. It’s amazing.","Likes":"1.0","Sentiment":"2.0"}
{"":"462","Video ID":"UxjgqBamqDU","Comment":"When we moved to home working I got the Logitech MX Master 3, it’s been great as an all round mouse, I miss my setup when I have to go back i to the office lol. Although I could just take my mouse with me.","Likes":"3.0","Sentiment":"2.0"}
{"":"463","Video ID":"YvZPU-KBCiQ","Comment":"I love this series, the experts are not judgemental and very professional.","Likes":"5846.0","Sentiment":"2.0"}
{"":"464","Video ID":"YvZPU-KBCiQ","Comment":"For those who are curious: Not only is it widely accepted that an asteroid wiped out the dinosaurs, but we also know exactly WHERE the asteroid landed: it's called the Chicxulub crater. It's located on the northern coast of the Yucatan Peninsula and has been carbon-dated to have formed in that time period, and it size of the crater certainly looks catastrophic enough.","Likes":"1234.0","Sentiment":"0.0"}
{"":"465","Video ID":"YvZPU-KBCiQ","Comment":"Such innocence when he reads “godstiddies”. He is adorable.","Likes":"1394.0","Sentiment":"2.0"}
{"":"466","Video ID":"YvZPU-KBCiQ","Comment":"I would absolutely love to attend a paleontology course that guy was running. His enthusiasm is infectious.","Likes":"938.0","Sentiment":"2.0"}
{"":"467","Video ID":"YvZPU-KBCiQ","Comment":"the way he factually states \"the world is a sphere\" makes you feel like he's heard even weirder statements before and this is just another misconception he corrects 😅","Likes":"490.0","Sentiment":"0.0"}
{"":"468","Video ID":"YvZPU-KBCiQ","Comment":"\"Since when were pterodactyls not dinosaurs?\"\n\n\"Since ever\" That is probably one of the greatest answers","Likes":"3233.0","Sentiment":"2.0"}
{"":"469","Video ID":"YvZPU-KBCiQ","Comment":"Hearing this guy stay professional while reading the Username \"Godstiddies\" was the highlight of my day.","Likes":"761.0","Sentiment":"2.0"}
{"":"470","Video ID":"YvZPU-KBCiQ","Comment":"That was cool. I like that he said Jurassic Park was for entertainment not science. I often hear people complaining that things like Jurassic Park aren't scientifically accurate. Who cares. I watch that kind of stuff to be entertained. If I want to learn something I'll watch a documentary which I also do.","Likes":"391.0","Sentiment":"2.0"}
{"":"471","Video ID":"YvZPU-KBCiQ","Comment":"The fact that birds are technically dinosaurs is a fact that would have blown my mind as a kid. Which is why I try to bring it up with kids as often as I can! Growing up, Plesiosaurus was my favorite “dinosaur”, although it’s technically not a dinosaur. My other favorites are Maiasaura and Parasaurolophus","Likes":"351.0","Sentiment":"2.0"}
{"":"472","Video ID":"YvZPU-KBCiQ","Comment":"You can always tell when someone enjoys their job.  He is so enthusiastic and knowledgeable about dinosaurs.  What a great series.","Likes":"346.0","Sentiment":"2.0"}
{"":"473","Video ID":"--ixiTypG8g","Comment":"The biggest problem is colleges charging outrages tuition fees, causing this to happen","Likes":"104.0","Sentiment":"0.0"}
{"":"474","Video ID":"--ixiTypG8g","Comment":"So everyone who couldn’t afford college will have to pay for those who did……why not make college affordable in the first place?","Likes":"32.0","Sentiment":"0.0"}
{"":"475","Video ID":"--ixiTypG8g","Comment":"Now we need to cap these institutions. No more predatory pricing!! Honestly these colleges/universities should be paying back people the interest as well. (those who have and have not paid off their loans, last 30 years included.","Likes":"136.0","Sentiment":"0.0"}
{"":"476","Video ID":"--ixiTypG8g","Comment":"Today I learned “low income families” make up to 250k per year.","Likes":"216.0","Sentiment":"1.0"}
{"":"477","Video ID":"--ixiTypG8g","Comment":"Regulate college tuition so that this doesn’t happen again please. Otherwise this will be pointless","Likes":"93.0","Sentiment":"0.0"}
{"":"478","Video ID":"--ixiTypG8g","Comment":"My question is , if you are in public service for the 10 years, is the 120 qualifying payments still a requirement under this new announcement.","Likes":"23.0","Sentiment":"1.0"}
{"":"479","Video ID":"--ixiTypG8g","Comment":"When colleges knew about this, watch them charge more tuition. Then you will know why college is expensive in the first place.","Likes":"18.0","Sentiment":"0.0"}
{"":"480","Video ID":"--ixiTypG8g","Comment":"He needs to find a way to get schools to lower their tuition rates and quit trying to game a broken student loan system. This will just keep happening and its not going to stop idealistic young people from taking out massive debt on a useless degree. The schools need to be REGULATED. If they take govt funds, then they should be subject to immediate regulation.","Likes":"145.0","Sentiment":"0.0"}
{"":"481","Video ID":"--ixiTypG8g","Comment":"The states deregulated tuition and fees so the colleges could charge more. Then, they used that money to hire more administrators and build more buildings. The students are not just paying for their education. They are also paying for all the things the colleges wanted, but the states did not want to give them money for. Nobody talks about that.","Likes":"66.0","Sentiment":"0.0"}
{"":"482","Video ID":"--ixiTypG8g","Comment":"There is no such thing as loan cancellation, its merely a transfer... Do people not understand how this works?","Likes":"3.0","Sentiment":"0.0"}
{"":"483","Video ID":"4RkfqEWK2FI","Comment":"Click here for the latest news on the 2022 midterm elections: https://youtube.com/playlist?list=PLEb3ThbkPrFazrrDSiT46cq4Ms6ATJwvI","Likes":"0.0","Sentiment":"1.0"}
{"":"484","Video ID":"4RkfqEWK2FI","Comment":"I'm trying to hold onto hope and positivity for New York State, but every year it gets harder and harder!","Likes":"5.0","Sentiment":"0.0"}
{"":"485","Video ID":"4RkfqEWK2FI","Comment":"Nadler shouldn't be allowed to drive much less wield power.","Likes":"9.0","Sentiment":"0.0"}
{"":"486","Video ID":"4RkfqEWK2FI","Comment":"This is a good way to get rid of career politicians from one party by putting them both in the against each other meaning one of them will be gone at least","Likes":"12.0","Sentiment":"1.0"}
{"":"487","Video ID":"4RkfqEWK2FI","Comment":"Funny how democrats always choose the old white man lol","Likes":"36.0","Sentiment":"0.0"}
{"":"488","Video ID":"4RkfqEWK2FI","Comment":"A population of Mass Psychosis!","Likes":"7.0","Sentiment":"0.0"}
{"":"489","Video ID":"4RkfqEWK2FI","Comment":"NY-of course dems did well","Likes":"1.0","Sentiment":"2.0"}
{"":"490","Video ID":"4RkfqEWK2FI","Comment":"It never matter how win. The question is. Is the state is any better. Under either politicians. All politicians are very corrupt.","Likes":"0.0","Sentiment":"0.0"}
{"":"491","Video ID":"4RkfqEWK2FI","Comment":"What is Charlie? Republican, Democrat, Independent, Conservative, Liberal, Socialist? He has been them all.","Likes":"5.0","Sentiment":"1.0"}
{"":"492","Video ID":"4RkfqEWK2FI","Comment":"NY Democrats never cease to amaze me…..picking the absolute worst representatives possible. \nThanks\n~Jim Eagle","Likes":"53.0","Sentiment":"0.0"}
{"":"493","Video ID":"GK8CFuXExLw","Comment":"I feel for civilians that just want to live a peaceful normal life in Ukraine...","Likes":"26.0","Sentiment":"0.0"}
{"":"494","Video ID":"GK8CFuXExLw","Comment":"to be clear it's not alleged war crimes they have tried and convicted people for them already so yes war crimes are being committed in Ukraine just because you don't like saying it doesn't change that its actually happening to the people it affects.","Likes":"154.0","Sentiment":"0.0"}
{"":"495","Video ID":"GK8CFuXExLw","Comment":"I whole heartedly agree with the guy from NATO who was saying that Europe and the US will pay a high price this winter for supporting Ukraine this winter, but not supporting them will cost us even more\n\nThe biggest threat to Ukraine right now is that the rest of us will lose interest and abandon them\nUkraine needs to get all their territory back or Russia is just going to eat them in bites and then they will move to the next nation that they want to add back to the Soviet Union","Likes":"8.0","Sentiment":"0.0"}
{"":"496","Video ID":"GK8CFuXExLw","Comment":"Happy Independence Day to Ukraine and glory! \n🇮🇸❤️🇺🇦\nThe reason why I support Ukraine, because I’m human and I support human rights and if Ukraine surrenders, there will be no more Ukraine and it won’t save lives. It will only end up in a brutal occupation like Bucha, irpin and Mariupol massacre. The main goal of Russia is that they want to destroy Ukraine as a nation, just like Rome destroyed Carthage. Russians don’t treat Ukrainians as people.","Likes":"41.0","Sentiment":"0.0"}
{"":"497","Video ID":"GK8CFuXExLw","Comment":"He thought it would take him 3 days to take over all of Ukraine. It's been 6 months, and he barely took a small part of the East and South - and even there, Ukraine from time to time take some sections back. Ukraine deserves most of the credit - they have proven themselves not just brave and tenacious, but also skilled, capable. The West deserves the rest of the credit. Putin actually managed to unite us...","Likes":"96.0","Sentiment":"1.0"}
{"":"498","Video ID":"GK8CFuXExLw","Comment":"\"Putin is the greatest gift to NATO since the end of the cold war\". Now thats funny!","Likes":"162.0","Sentiment":"2.0"}
{"":"499","Video ID":"GK8CFuXExLw","Comment":"Happy independence day Ukrainian people..","Likes":"14.0","Sentiment":"2.0"}
{"":"500","Video ID":"GK8CFuXExLw","Comment":"What an excellent piece. Very good questions and thoughtful answers. Definitive predictions?  Of course not, events in war are hard to predict. Thank you for a very useful piece.","Likes":"1.0","Sentiment":"2.0"}
{"":"501","Video ID":"GK8CFuXExLw","Comment":"THANK YOU \"VERY MUCH\"\nFOR YOUR ANALYTICAL COMMENTS\nAND PREDICTIONS \nON THE WAR IN THE UCRAINE \"AS SUCH\".\n\nMORE VITAL WEAPONS SUPPLY /\nNATO EXPANDING\nWITH FINLAND AND SWEDEN TO FACE PUTIN'S\nWAR AGRESSION AND THREATS\nAND \"MORAL WORLDWIDE SUPPORT GROWING\nFOR \"A DEMOCRATIC AND FREE UCRAINE\"\nAS IT CAN \"DAILY BE SEEN\".","Likes":"10.0","Sentiment":"2.0"}
{"":"502","Video ID":"GK8CFuXExLw","Comment":"Something important to know, for all who are interested in history and/or support Ukraine: \n\nRus’ ought not to be confused with “Russia”, which derives its name from the Rus’ but historically is a completely different state, which almost all its existence was at war with the Rus’. \n\nJust like the Holy Roman Empire was actually Germany, Russia is actually Muscovy, despite their best attempts to convince everybody otherwise. \n\nIts name “Russia\" received only in 1721, when Peter I passed a decree to change Tsardom of Muscovy’s name into the “Russian” Empire (“Russia” originates from Rosia, name used by the Greek Orthodox Clergy in regards to Kyivan Rus')\nUnder the reign of Cathrine II Muscovites where even punished for continuing to identify as Muscovites, and were forced to call themselves “Russian”. \n\nLands that “Russia” claims were part of the original Rus’, but actually weren't, are Novgorod, Suzdal, and Ryazan, since in historical texts of XI-XII centuries they are mentioned as separate entities from Rus’. They can be considered parts of extended Rus’, although their culture was distinct from main Rus’.\n\nIn 1493 Moscow prince Ivan III appointed himself to be the Great Ruler of All Rus’. No other kings acknowledged that. From that point on Muscovy started to make false claims on Rus’ ownership.\n\n“Russia” is an offshoot of Ukraine and not the other way round, despite what Soviet and “Russian” historians have been trying to say for years. Kiev was a developed cultured capital when Moscow was just another swamp village.\n\n\n\n\nGermany used to call itself the Holy Roman Empire, that didn’t mean they became the Romans, and all of a sudden had a right to claim whole of Italy and its history, but yet, that’s exactly what “Russia” did in regards to Rus’-Ukraine, which is a horrible injustice!","Likes":"1.0","Sentiment":"1.0"}
{"":"503","Video ID":"95MMQzBkE30","Comment":"Do you remember what happens when we give unaccounted money and weapons to countries to fight proxy wars..??\nWe keep making the same mistakes over and over....","Likes":"72.0","Sentiment":"0.0"}
{"":"504","Video ID":"95MMQzBkE30","Comment":"“Victory is assured…if we receive $100,000,000,000 this time.”","Likes":"29.0","Sentiment":"2.0"}
{"":"505","Video ID":"95MMQzBkE30","Comment":"Notice how the guy calling in keeps saying \"we\" in regards to Ukraine. Weird.","Likes":"42.0","Sentiment":"0.0"}
{"":"506","Video ID":"95MMQzBkE30","Comment":"\"The end of the Cold War brought an end to many of the proxy wars through which the two sides struggled to exert their influence\"","Likes":"2.0","Sentiment":"1.0"}
{"":"507","Video ID":"95MMQzBkE30","Comment":"Glory to our knights in shining armour. The sword and shield of democracy; Ukraine.","Likes":"0.0","Sentiment":"2.0"}
{"":"508","Video ID":"95MMQzBkE30","Comment":"Our government  should be held accountable  for the pointless expense  on this war. They already have genocidal  Turkey helping  them and they will still lose at the end. All this money could have gone to people..Government  took 6 months with vacations to send us measly  dimes during  covid,but billions they send at a whim","Likes":"4.0","Sentiment":"0.0"}
{"":"509","Video ID":"95MMQzBkE30","Comment":"Armenia could have used that aid to fight against Azerbaijan during the 2020 Karabakh war.","Likes":"6.0","Sentiment":"1.0"}
{"":"510","Video ID":"95MMQzBkE30","Comment":"interesting news since Russia is advancing on every front right now.  Even Ukraine's own map shows that.  Sure wish these \"experts\" would actually tell the news for once","Likes":"46.0","Sentiment":"1.0"}
{"":"511","Video ID":"95MMQzBkE30","Comment":"I hate to say it but I don’t think the Ukrainians are going to be able to counter attack remember Ukraine uses 5,000 artillery shells a day Russia on the other hand is using 500,000 shells a day Russia has the most tanks in world there isn’t a shortage of there wasn’t a shortage then how come Luhansk has fallen ? Let’s not get ahold of ourselves","Likes":"2.0","Sentiment":"0.0"}
{"":"512","Video ID":"95MMQzBkE30","Comment":"Saddakur incoming when he can’t deliver.  The sheer overconfidence they project as underdogs is off putting. Not in touch with reality.","Likes":"3.0","Sentiment":"0.0"}
{"":"513","Video ID":"nv7owOSprnI","Comment":"Russia is being beaten at high-speed attrition warfare.  It is alarming how Russia is throwing away its best lives and equipment. 💛💙 Victory to Ukraine!  👊😎🤘","Likes":"11.0","Sentiment":"0.0"}
{"":"514","Video ID":"nv7owOSprnI","Comment":"always remember this ....you CANT operate an army without supply TRUCKS also FUEL trucks .....destroy or capture all russian trucks ....\n1. are they armored ??? no \n2. do they have heavy weapons on them ??? no \n3. is a army truck driver a high skilled soldier ??? NO  \n4. puncture truck tires or damage the engines!! .....","Likes":"1.0","Sentiment":"0.0"}
{"":"515","Video ID":"nv7owOSprnI","Comment":"Happy Independence Day Ukrainians!!!","Likes":"19.0","Sentiment":"2.0"}
{"":"516","Video ID":"nv7owOSprnI","Comment":"To be good at something you got to be doing it all the time. Why do you think the Americans are so good at war.","Likes":"1.0","Sentiment":"0.0"}
{"":"517","Video ID":"nv7owOSprnI","Comment":"THE WORLD NEEDS TO HELP CONGO GOVERNMENT FINANCIALLY TO SAVE \"SECOND LAST RAIN FOREST\" FROM BEING MINED.","Likes":"0.0","Sentiment":"1.0"}
{"":"518","Video ID":"nv7owOSprnI","Comment":"Happy Independence Day to Ukraine and glory! \n🇮🇸❤️🇺🇦\nThe reason why I support Ukraine, because I’m human and I support human rights and if Ukraine surrenders, there will be no more Ukraine and it won’t save lives. It will only end up in a brutal occupation like Bucha, irpin and Mariupol massacre. The main goal of Russia is that they want to destroy Ukraine as a nation, just like Rome destroyed Carthage. Russians don’t treat Ukrainians as people.","Likes":"3.0","Sentiment":"0.0"}
{"":"519","Video ID":"nv7owOSprnI","Comment":"As a former combat planner in Vietnam, I agree with General Hodges. Putin's 'attrition' strategy is not well thought out. Firstly, they don't have the right equipment, manpower or time. Ukraine has all of that except for 'equipment' in sufficient quantities. Over time, the West's resources will help Ukraine fill that gap.","Likes":"5.0","Sentiment":"0.0"}
{"":"520","Video ID":"nv7owOSprnI","Comment":"A decisive battle between civilization and savagery has begun. Even in the Second World War it was not like that. Because the two savages were on different sides of the front. It was an inter-German showdown: the Germano-Slavic ethnic  of the Deutschs against the Germano-Celtic French and the English, and the Russian savagery was either together with the savagery of the Deutschs or against them. Now the front line has clearly been drawn between civilization and savagery. I see the philosophical law of contradiction: civilization is definitely a positive phenomenon, but it is mixed with negativity in the form of shame and cowardice: civilization has hid behind Ukraine and is waiting for something unknown. The memory of civilization's victory in this war will be tainted with the memory of shame.","Likes":"0.0","Sentiment":"1.0"}
{"":"521","Video ID":"nv7owOSprnI","Comment":"Europe is forever in debt for the bravery of Ukraine. Hopefully russia shall pay to rebuild Ukraina. Slava!","Likes":"0.0","Sentiment":"0.0"}
{"":"522","Video ID":"nv7owOSprnI","Comment":"I wonder how many soldiers are now joining the resistance","Likes":"4.0","Sentiment":"1.0"}
{"":"523","Video ID":"rqbFOOt1q9M","Comment":"Click here for the latest on the FBI’s Mar-a-Lago search: https://youtube.com/playlist?list=PLEb3ThbkPrFaMJ6InL5jKPTcpPxFDUL67","Likes":"0.0","Sentiment":"1.0"}
{"":"524","Video ID":"rqbFOOt1q9M","Comment":"Archives:  We want the material returned.   DT:  Here they are.  Archives:  Is that all?   DT: Umm, found more.  Here you go.   Archives:  Are you sure that is all?   DT's Lawyers:  Yup.    NARA:   Bob, there are TS/SCI material missing. Any Idea of their location?   Bob:  ????     NARA to FBI:  Go fetch the material from the Florida resort...   NOW!","Likes":"20.0","Sentiment":"1.0"}
{"":"525","Video ID":"rqbFOOt1q9M","Comment":"I feel like I’m in a simulation at this point","Likes":"22.0","Sentiment":"0.0"}
{"":"526","Video ID":"rqbFOOt1q9M","Comment":"National Archives are meant for historical purposes. To be referred to for future Generations. Any president that thinks that they can hold on to documents needs to have the respect of that policy.","Likes":"1.0","Sentiment":"1.0"}
{"":"527","Video ID":"rqbFOOt1q9M","Comment":"Even though Trump can barely read, Putin sure can and has read every page Trump handed him.","Likes":"6.0","Sentiment":"1.0"}
{"":"528","Video ID":"rqbFOOt1q9M","Comment":"I got 25 seconds in and already call bullsh*t. I paused the video to comment,  but started reading other comments. I was amazed because every comment shows disdain for our media, including CBS News. SMH. Caused me to forget my original and now meaningless thought.","Likes":"5.0","Sentiment":"0.0"}
{"":"529","Video ID":"rqbFOOt1q9M","Comment":"I am so ready for the future. Together in Faith. Expose the documents! 8:18 🦋🌈✨👣💕🇺🇸","Likes":"7.0","Sentiment":"2.0"}
{"":"530","Video ID":"rqbFOOt1q9M","Comment":"There was a care and custody record for all of the top secret documents I want to know when each and every single one of them was taken from wherever they were taken from but some taking on January 6th but I'm taking on January 3rd or some taking on January 13th when were they taken?","Likes":"0.0","Sentiment":"1.0"}
{"":"531","Video ID":"rqbFOOt1q9M","Comment":"Did FBI agents also seize xerographic copies of top secret documents from the Mar-a-Lago abode?","Likes":"0.0","Sentiment":"1.0"}
{"":"532","Video ID":"rqbFOOt1q9M","Comment":"Is he just hiding documents in doughnut boxes I'm so confused","Likes":"11.0","Sentiment":"0.0"}
{"":"533","Video ID":"_XFJpfSFcpU","Comment":"Being a politician should not be a career choice. Term limits for everyone.","Likes":"102.0","Sentiment":"0.0"}
{"":"534","Video ID":"_XFJpfSFcpU","Comment":"Seeing young kids behind him cheering is just insane","Likes":"151.0","Sentiment":"2.0"}
{"":"535","Video ID":"_XFJpfSFcpU","Comment":"Term limit is desperately needed for both the House and the Senate.","Likes":"623.0","Sentiment":"1.0"}
{"":"536","Video ID":"_XFJpfSFcpU","Comment":"Term Limits is a must ! Tired of these crooked cryptic politicians. RETIRE!!!","Likes":"53.0","Sentiment":"0.0"}
{"":"537","Video ID":"_XFJpfSFcpU","Comment":"The voters get what they deserve.","Likes":"35.0","Sentiment":"1.0"}
{"":"538","Video ID":"_XFJpfSFcpU","Comment":"I love how new yorkers put pride over common sense as if there were anything to be proud of, they deserve exactly all the things are going through.","Likes":"225.0","Sentiment":"2.0"}
{"":"539","Video ID":"_XFJpfSFcpU","Comment":"Wow, you would think New Yorkers would learn.  Incredible.","Likes":"561.0","Sentiment":"2.0"}
{"":"540","Video ID":"_XFJpfSFcpU","Comment":"What's shocking is how many people like this guy? Pretty disgusting.","Likes":"41.0","Sentiment":"0.0"}
{"":"541","Video ID":"_XFJpfSFcpU","Comment":"He's more detached from the people he represents then any Representative in U'S' history.","Likes":"104.0","Sentiment":"0.0"}
{"":"542","Video ID":"_XFJpfSFcpU","Comment":"Are they really that hard up for candidates in New York?","Likes":"85.0","Sentiment":"1.0"}
{"":"543","Video ID":"fNHmQdrlIZE","Comment":"I knew he was saving this for the midterms.","Likes":"94.0","Sentiment":"1.0"}
{"":"544","Video ID":"fNHmQdrlIZE","Comment":"Biden: “Covid isn’t an emergency! Open the border!”\nAlso Biden: “the Covid emergency is going on so we must forgive student loans”","Likes":"2.0","Sentiment":"1.0"}
{"":"545","Video ID":"fNHmQdrlIZE","Comment":"All of this does nothing to correct the problem of high college tuition.  Schools will continue to leverage off government loans and at the same time, increase tuition to pay for their exorbitant pensions - the cycle continues.","Likes":"47.0","Sentiment":"0.0"}
{"":"546","Video ID":"fNHmQdrlIZE","Comment":"i like the part where he said the dept of education will no longer allow predatory loans so this doesnt happen again!","Likes":"7.0","Sentiment":"1.0"}
{"":"547","Video ID":"fNHmQdrlIZE","Comment":"I didn't realize up to 250K per family is consider low income?  People making way less than that will be paying for his forgiveness plan.  This administration is insane.","Likes":"1.0","Sentiment":"0.0"}
{"":"548","Video ID":"fNHmQdrlIZE","Comment":"Everyone knows money doesn't mean anything anymore, unless you have some the govt. can take.","Likes":"2.0","Sentiment":"0.0"}
{"":"549","Video ID":"fNHmQdrlIZE","Comment":"I’ll believe it when I see my credit report","Likes":"56.0","Sentiment":"2.0"}
{"":"550","Video ID":"fNHmQdrlIZE","Comment":"Can we do more to make College cheaper rather than give away government money to bloated universities?","Likes":"97.0","Sentiment":"1.0"}
{"":"551","Video ID":"fNHmQdrlIZE","Comment":"YES.  Perfect. I took out loans just in case he would cancel. I could have paid for school, but I invested it instead. Best decision.","Likes":"5.0","Sentiment":"2.0"}
{"":"552","Video ID":"fNHmQdrlIZE","Comment":"Brilliant analysis of the different things to watch for on the different time frames. Good to see everyone feels the same way when they lose money, everyone thinks they could do this or that with that money which is as good as gone, instead people refuse to seek help from professionals, Edward Joseph James set to be different and unique, I made about $470k already  from his day tradng, all i did was to copy his daily signals, am done having heart breaks hodling and trading myself lol.","Likes":"47.0","Sentiment":"1.0"}
{"":"553","Video ID":"zvS8Fmxv1_U","Comment":"As far as the weather, this is absolutely crazy what is going on. My deepest thoughts and prayers are with everyone across the globe who is in a danger zone and experiencing such hardships.","Likes":"1.0","Sentiment":"0.0"}
{"":"554","Video ID":"zvS8Fmxv1_U","Comment":"Thoughts and prayers to all of USA in waters. Stay safe. From the typhoon belt in the Pacific Las Islas Filipinas.","Likes":"14.0","Sentiment":"2.0"}
{"":"555","Video ID":"zvS8Fmxv1_U","Comment":"\"I don't care how many cops there.\" \"They are not going in to protect us.\".....Soooo sad.","Likes":"11.0","Sentiment":"0.0"}
{"":"556","Video ID":"zvS8Fmxv1_U","Comment":"It’s either floods, droughts or wildfires. Actually it’s all of them simultaneously. 20-30 years from now we might actually start to think seriously about reducing emissions, but I doubt it.","Likes":"3.0","Sentiment":"0.0"}
{"":"557","Video ID":"zvS8Fmxv1_U","Comment":"Thank you NBC more Americans get their news now from NBC then. Any  other source believe that😎🇺🇲💙","Likes":"0.0","Sentiment":"2.0"}
{"":"558","Video ID":"zvS8Fmxv1_U","Comment":"Love the Pilots to the Rescue story! Great job folks!!","Likes":"1.0","Sentiment":"2.0"}
{"":"559","Video ID":"zvS8Fmxv1_U","Comment":"Vermont is getting rain and thunder right now at 1:00 pm...Burlington VT.","Likes":"4.0","Sentiment":"1.0"}
{"":"560","Video ID":"zvS8Fmxv1_U","Comment":"WE  NEED  TO    FOCUS  IN  PLANTING  TRILLIONS  OF  TREES\r\n   IF  WE  WANT  TO  SURVIVE  AS  A  SPECIE.      WE  NEED  MORE  TREES  ,   MORE  AGRICULTURE  MORE  TECHNOLOGY  AND  MAINLY  LOVE  AND  PEACE  AMOUNT  US.\r\n YOU  HAVE  TO PLANT  A  TREE  DONT  WAIT  FOR THE GOVERMENT ,  MAKE SURE YOU PLANT  ONE.","Likes":"9.0","Sentiment":"1.0"}
{"":"561","Video ID":"zvS8Fmxv1_U","Comment":"32:52 The reaction from the host is priceless. Don't agree with some of these opinions.","Likes":"1.0","Sentiment":"1.0"}
{"":"562","Video ID":"zvS8Fmxv1_U","Comment":"It's time we spend money on where it worths. Build a system that can direct flood water to drought areas (e.g., California, Las Vegas) or at least can store the water.","Likes":"1.0","Sentiment":"1.0"}
{"":"563","Video ID":"OTFKyW-vc_Y","Comment":"And if loans forgiven it has to include and reimburse those who’ve already paid their loans emperor Nero","Likes":"34.0","Sentiment":"1.0"}
{"":"564","Video ID":"OTFKyW-vc_Y","Comment":"Biden: \"How much do you think we need to give them to secure their vote but leave some left over for future elections?\"\nAnswer: $10K","Likes":"47.0","Sentiment":"1.0"}
{"":"565","Video ID":"OTFKyW-vc_Y","Comment":"Which means the taxpayers will have to foot the bill.","Likes":"139.0","Sentiment":"0.0"}
{"":"566","Video ID":"OTFKyW-vc_Y","Comment":"Didn't Obama say \"Never underestimate Joe's ability to......\" well, you know the thing.","Likes":"4.0","Sentiment":"1.0"}
{"":"567","Video ID":"OTFKyW-vc_Y","Comment":"Going to be a lot of people upset when they realize what this does to the economy","Likes":"72.0","Sentiment":"0.0"}
{"":"568","Video ID":"OTFKyW-vc_Y","Comment":"Biden: “Hey! I can help you lose 5 pounds in 5 second without exercise!”\n\n*take out machete and cuts right arm off*\n\nBiden: “There! You’re welcome! Dont forget to vote for me in November!”","Likes":"11.0","Sentiment":"2.0"}
{"":"569","Video ID":"OTFKyW-vc_Y","Comment":"So people who paid their debt off just as people who immigrated to USA legally are slapped in the face by people who cannot or will not pay their debt.","Likes":"142.0","Sentiment":"0.0"}
{"":"570","Video ID":"OTFKyW-vc_Y","Comment":"I knew he would do this just ahead of midterms","Likes":"30.0","Sentiment":"1.0"}
{"":"571","Video ID":"OTFKyW-vc_Y","Comment":"\"Forgiveness\" means the debt goes away, never to be seen nor heard of again.  This is robbing Peter to pay Paul.","Likes":"3.0","Sentiment":"0.0"}
{"":"572","Video ID":"OTFKyW-vc_Y","Comment":"This administration is starting to remind me of a time in history called the taxation without representation TAXES TAXES TAXES. (BIDEN AND HARRIS. )","Likes":"58.0","Sentiment":"0.0"}
{"":"573","Video ID":"IH3DYzS4MdI","Comment":"*I like presidents who DON'T try to steal classified nuclear documents.*","Likes":"235.0","Sentiment":"1.0"}
{"":"574","Video ID":"IH3DYzS4MdI","Comment":"That's so weird. He's been screaming he wanted transparency the whole time and now he doesn't want anybody to look at the documents he stole?","Likes":"222.0","Sentiment":"0.0"}
{"":"575","Video ID":"IH3DYzS4MdI","Comment":"First the documents weren’t there, then the documents were planted and now he wants to ban them. What a joke.","Likes":"162.0","Sentiment":"0.0"}
{"":"576","Video ID":"IH3DYzS4MdI","Comment":"Simple as this: These documents do not belong to him and never did. Demanding they be returned when they shouldn’t have been in his home in the first place is ludicrous.","Likes":"66.0","Sentiment":"0.0"}
{"":"577","Video ID":"IH3DYzS4MdI","Comment":"How fast can the judge say \"motion denied\".","Likes":"61.0","Sentiment":"1.0"}
{"":"578","Video ID":"IH3DYzS4MdI","Comment":"Trump's a modern day obstructionist, especially about things and issues that can convict him.","Likes":"50.0","Sentiment":"0.0"}
{"":"579","Video ID":"IH3DYzS4MdI","Comment":"Trump files motion.  Judge falls out of chair laughing.","Likes":"38.0","Sentiment":"1.0"}
{"":"580","Video ID":"IH3DYzS4MdI","Comment":"So, first he never had it. Then the cult cried “planted documents”. Now he did have it but thinks it’s his……….you can’t make this stuff up😆Indict indict indict and indict 🇺🇸","Likes":"66.0","Sentiment":"0.0"}
{"":"581","Video ID":"IH3DYzS4MdI","Comment":"*This video is not for children, it's shocking* ALLTIME.ML\r\nMr. Dunn - respect to you.","Likes":"102.0","Sentiment":"0.0"}
{"":"582","Video ID":"IH3DYzS4MdI","Comment":"One asinine move after another from the Trump team concerning the search-and-seizure. I guess Trump didn't get the memo that he no longer has enablers in Congress or at the DOJ to bail him out.","Likes":"60.0","Sentiment":"0.0"}
{"":"583","Video ID":"q7sXUpqA_X4","Comment":"How can reporting on this be so bad? The president has the authority to declassified documents not a single one of those documents is classified…. do better","Likes":"5.0","Sentiment":"0.0"}
{"":"584","Video ID":"q7sXUpqA_X4","Comment":"Only trump would call a search warrant \"Unwarranted\"!!!","Likes":"12.0","Sentiment":"0.0"}
{"":"585","Video ID":"q7sXUpqA_X4","Comment":"I love how they let Swalwell speak on this situation whenever he was sleeping with a Chinese spy 🤣","Likes":"42.0","Sentiment":"1.0"}
{"":"586","Video ID":"q7sXUpqA_X4","Comment":"“We are learning how many documents were allegedly took”……. Lol\n\nDoes anyone but me understand that past presidents have clearance for classified material? And are briefed on a regular basis…..","Likes":"9.0","Sentiment":"1.0"}
{"":"587","Video ID":"q7sXUpqA_X4","Comment":"These people spending all this time and money to try to find dirt on Trump is getting old.","Likes":"8.0","Sentiment":"0.0"}
{"":"588","Video ID":"q7sXUpqA_X4","Comment":"ALLEGEDLY.  They say this to avoid being  sued. Learn how words work.","Likes":"21.0","Sentiment":"0.0"}
{"":"589","Video ID":"q7sXUpqA_X4","Comment":"If he was up to something he would have declassified them when he had the power. This is as stupid as the ones getting tickled about this raid.","Likes":"100.0","Sentiment":"0.0"}
{"":"590","Video ID":"q7sXUpqA_X4","Comment":"They really just don't want him to rerun for presidency.....he's not in the club.","Likes":"1.0","Sentiment":"0.0"}
{"":"591","Video ID":"q7sXUpqA_X4","Comment":"According to your video title, the FBI took Trumps property.","Likes":"1.0","Sentiment":"1.0"}
{"":"592","Video ID":"q7sXUpqA_X4","Comment":"Here’s one for ya… if they were so important, and they did know about this since he left office… why wait 1 1/2 years to get the warrant? Especially in an election year?\n\n::mind blown::\n\nStop being sheep","Likes":"23.0","Sentiment":"0.0"}
{"":"593","Video ID":"NS-9bd2hOOQ","Comment":"Cosatu is trying to manipulate the people of south africa..CYRIL said ,before the prices rose,,,he said he discussed that with stake holders and labour unions,,why cosatu and saftu are marching now ,,does this means they are not satisfied with the cost of living or they want to see how many south africans reacts?","Likes":"4.0","Sentiment":"0.0"}
{"":"594","Video ID":"NS-9bd2hOOQ","Comment":"Shluggishness to start the protest.\nThat could be a problem in our work environment as well.\nLets try to be more in time for work and work with greater vigour to make this a nicer country to live in.","Likes":"0.0","Sentiment":"0.0"}
{"":"595","Video ID":"NS-9bd2hOOQ","Comment":"If they were marching for change of government I could have joined. On this one even the so called ministers and or aspiring have joined. They can march trillion times a day no feedback.","Likes":"1.0","Sentiment":"1.0"}
{"":"596","Video ID":"NS-9bd2hOOQ","Comment":"Every year during the month of June and August they is a reason for people to lose jobs. These unions are getting paid for this disorder.","Likes":"0.0","Sentiment":"0.0"}
{"":"597","Video ID":"NS-9bd2hOOQ","Comment":"I thought foreigners are the ones earning below 🤣🤣🤣🤣🤣","Likes":"2.0","Sentiment":"0.0"}
{"":"598","Video ID":"NS-9bd2hOOQ","Comment":"They will just sign leave and get paid.","Likes":"1.0","Sentiment":"1.0"}
{"":"599","Video ID":"NS-9bd2hOOQ","Comment":"But all of you are the same people that wanted a new south africa.... \nWhy you complaining when you got a new south africa....","Likes":"7.0","Sentiment":"0.0"}
{"":"600","Video ID":"NS-9bd2hOOQ","Comment":"Nelspruit strike/shutdown in July was much better n radical","Likes":"0.0","Sentiment":"2.0"}
{"":"601","Video ID":"NS-9bd2hOOQ","Comment":"When u are unhappy with the current situation, u don't further destroy what's left of the economy, but u can cut ties with the ANC and put your hat in the ring in 2024, it's as simple as that","Likes":"2.0","Sentiment":"0.0"}
{"":"602","Video ID":"NS-9bd2hOOQ","Comment":"🙄","Likes":"0.0","Sentiment":"0.0"}
{"":"603","Video ID":"0IH09JBETbI","Comment":"Amanda crosta enaltecendo a Globo , colocando a globo como a melhor do mundo . Ela não cansa de passar vergonha... Faça perguntas sobre governo","Likes":"6.0","Sentiment":"1.0"}
{"":"604","Video ID":"0IH09JBETbI","Comment":"Que bom  que falhou o microfone  🎤 da Amanda deveria deixar no mudo, seria um bom serviço  para meus ouvidos 👂.","Likes":"12.0","Sentiment":"1.0"}
{"":"605","Video ID":"0IH09JBETbI","Comment":"presidente em mais um podcast vai estar no ironberg podcast do renato karine junto com o doutor Paulo muzy sexta feira","Likes":"4.0","Sentiment":"1.0"}
{"":"606","Video ID":"0IH09JBETbI","Comment":"Empresários, entrem com ação no STF, já com intuito de levar a organismos internacionais para pararem com este absurdo, de criar leis que não existem….","Likes":"0.0","Sentiment":"1.0"}
{"":"607","Video ID":"0IH09JBETbI","Comment":"A Amanta fala tanta asneira e viaja tanto, que nem o microfone aguentou!\nO MICROFONE PARECIA QUE TINHA TOMADO LSD!3:08:01\n😂🤪😂🤪😂🤪😂\nE o fantástico motta falou do coroné tiro gomes ou da Amanta?\nOLHA A CARA QUE ELA FICOU!😂😂😂👊🇧🇷👏🏻","Likes":"2.0","Sentiment":"1.0"}
{"":"608","Video ID":"0IH09JBETbI","Comment":"Não entendo porquê chamam o candidato Lula de \"presidente\". Ele é Ex presidente.","Likes":"4.0","Sentiment":"1.0"}
{"":"609","Video ID":"0IH09JBETbI","Comment":"Assim diz o SENHOR dos Exércitos: O filho honra o pai, e o servo, ao seu senhor. Se eu sou pai, onde está a minha honra? E, se eu sou senhor, onde está o respeito para comigo? Malaquias 1:6\nArrependa-se dos seus pecados. Receba a JESUS CRISTO como seu único e suficiente Senhor e Salvador. \nEm breve ELE virá!\nJESUS te ama muito!","Likes":"0.0","Sentiment":"1.0"}
{"":"610","Video ID":"0IH09JBETbI","Comment":"Violência política de gênero? Que p... é essa? Discrição contra homossexual. Essa deveria ser a acusação.","Likes":"1.0","Sentiment":"1.0"}
{"":"611","Video ID":"0IH09JBETbI","Comment":"O nome disso é COVARDIA!","Likes":"2.0","Sentiment":"1.0"}
{"":"612","Video ID":"0IH09JBETbI","Comment":"Gente , porque pedem pra repetir o horario???? kkkk","Likes":"1.0","Sentiment":"1.0"}
{"":"613","Video ID":"lX3EBSNjPII","Comment":"\"We the people are the rightful masters of both Congress and the courts. not to overthrow the Constitution but to overthrow the men who pervert the Constitution\". -Abe Lincoln","Likes":"210.0","Sentiment":"1.0"}
{"":"614","Video ID":"lX3EBSNjPII","Comment":"“That’s my drug stash - Iam taking it with me.” Cops come and confiscate the stash. “Your honor i’d like you to tell the cops not to look at the stash the took - ok with you?” 😂😂😂 unbelievable 🤪","Likes":"12.0","Sentiment":"1.0"}
{"":"615","Video ID":"lX3EBSNjPII","Comment":"Did Trump say he was going to be the Law and Order president? maybe we misunderstood him he meant the lawsuit president","Likes":"27.0","Sentiment":"1.0"}
{"":"616","Video ID":"lX3EBSNjPII","Comment":"Our legal system is broken. Loopholes exist that allow the wealthy to avoid the sort of jail time that would have been inflicted on someone who can't afford elite lawyer representation. I get sick of it, but I'm not sure what a challenge to the status quo would look like.","Likes":"121.0","Sentiment":"0.0"}
{"":"617","Video ID":"lX3EBSNjPII","Comment":"There is definitely more to this story. Like in June  the lawyer signed a document saying that was the last of the documents as well","Likes":"57.0","Sentiment":"1.0"}
{"":"618","Video ID":"lX3EBSNjPII","Comment":"How long will we allow this clown to continue thses charade. It's embarrassing to the nation and democracy,  no one else would even come close to being tolerated","Likes":"14.0","Sentiment":"0.0"}
{"":"619","Video ID":"lX3EBSNjPII","Comment":"\"It is impossible to simply walk off with these documents and keep them.  In order  to do that, you have to purposely want to take them away.  I can't understand it.\"  -  Mick Mulvaney","Likes":"38.0","Sentiment":"0.0"}
{"":"620","Video ID":"lX3EBSNjPII","Comment":"Wait but it was his fans that wanted them unveiled….","Likes":"9.0","Sentiment":"1.0"}
{"":"621","Video ID":"lX3EBSNjPII","Comment":"First he wanted it out, now he don’t, so typical of him.","Likes":"2.0","Sentiment":"0.0"}
{"":"622","Video ID":"lX3EBSNjPII","Comment":"He better get more than a slap on the wrist.","Likes":"16.0","Sentiment":"1.0"}
{"":"623","Video ID":"Tey5qEth4oA","Comment":"Our greatest concern is that Biden remains in office for another five minutes.","Likes":"418.0","Sentiment":"0.0"}
{"":"624","Video ID":"Tey5qEth4oA","Comment":"\"WE DEFEATED THE WRONG ENEMY!\" Now they are destroying us from within","Likes":"330.0","Sentiment":"0.0"}
{"":"625","Video ID":"Tey5qEth4oA","Comment":"If you still vote for Brandon after all this, you’re beyond trying to reason with.","Likes":"459.0","Sentiment":"0.0"}
{"":"626","Video ID":"Tey5qEth4oA","Comment":"I can see how much respect the Prime Minister has for the Fjb administration. He's right! This is madness!","Likes":"190.0","Sentiment":"1.0"}
{"":"627","Video ID":"Tey5qEth4oA","Comment":"We are very confident Biden will look into the situation as soon as he gets back from vacation...🌅","Likes":"83.0","Sentiment":"2.0"}
{"":"628","Video ID":"Tey5qEth4oA","Comment":"It is a shame that Ben has to go behind Joe and clean up his terrible policies","Likes":"81.0","Sentiment":"0.0"}
{"":"629","Video ID":"Tey5qEth4oA","Comment":"Do people remember when Joe the 10% big guy told Americans get ready for a dark winter! it'll be like you've never seen !","Likes":"125.0","Sentiment":"1.0"}
{"":"630","Video ID":"Tey5qEth4oA","Comment":"IF YOU SAY \"THIS IS THE WORST CHOICE YOU CAN IMAGINE\" , ITS GUARANTEED THAT THAT'S EXACTLY WHAT THIS ADMINISTRATION WILL DO.","Likes":"108.0","Sentiment":"0.0"}
{"":"631","Video ID":"Tey5qEth4oA","Comment":"“Leave them alone”, I absolutely agree. Another example of the Federal Government F ing things up.","Likes":"133.0","Sentiment":"0.0"}
{"":"632","Video ID":"Tey5qEth4oA","Comment":"If it's a dangerous threat to Americans and a bad deal, you can be sure biden will agree to it.🤗","Likes":"23.0","Sentiment":"0.0"}
{"":"633","Video ID":"L5p4Nov0KkU","Comment":"YES the airlines should pay for hotels food transportation from and to airports. Full refunds. They make billions on all if us and we get to sleep in the airports floors. 😡 Yes make them all responsible for their mess ups","Likes":"25.0","Sentiment":"0.0"}
{"":"634","Video ID":"L5p4Nov0KkU","Comment":"Airlines need to STOP TAKING MONEY for services they CANNOT RENDER .","Likes":"27.0","Sentiment":"0.0"}
{"":"635","Video ID":"L5p4Nov0KkU","Comment":"Very glad AWP was requested to come help. Jared and Doug are a registered charity and rely on donations and support to help families for free. They take their efforts very seriously. Now after two years and 23 solved cases they offer training to local police, expanded to two teams with a dive master and training Ozark adventures to create a third.\nHope they stay safe and their dedication pays off to provide answers to the family.","Likes":"13.0","Sentiment":"2.0"}
{"":"636","Video ID":"L5p4Nov0KkU","Comment":"My strength is with the family of the missing teen.","Likes":"48.0","Sentiment":"1.0"}
{"":"637","Video ID":"L5p4Nov0KkU","Comment":"“There’s no way to enter a serial number, and search for the owner.”\nHow are we ever supposed to stop gun violence with a stupid law like that?","Likes":"69.0","Sentiment":"0.0"}
{"":"638","Video ID":"L5p4Nov0KkU","Comment":"I was just one of the person's that asked for adventures with Purpose to come in and help. I have watched this team for a long while now. They are the very best !! I wish them safety and hope.\nI'm praying this young lady is found soon. Best of luck to these men. If she is in the water , they will find her.","Likes":"43.0","Sentiment":"2.0"}
{"":"639","Video ID":"L5p4Nov0KkU","Comment":"Sorry for the 16 year old! My child at 16 yrs. could not be out partying at 12 midnight. No way no how! Hate me now. Love me later!","Likes":"16.0","Sentiment":"0.0"}
{"":"640","Video ID":"L5p4Nov0KkU","Comment":"Just knowing that First Responders took pictures and shared them with friends would cause me major distress! Just because they weren't on social media doesn't mean the \"public\" didn't see them! I hope she wins big and they are forced into reprimanding the staff along with making policy changes!","Likes":"32.0","Sentiment":"0.0"}
{"":"641","Video ID":"L5p4Nov0KkU","Comment":"Kudos to the Ukrainian Freedom Orchestra...it's quite refreshing to see this side of Ukraine... continue to fight with your instruments for your culture...we do appreciate every one of you.... stay strong.","Likes":"40.0","Sentiment":"2.0"}
{"":"642","Video ID":"L5p4Nov0KkU","Comment":"If you are watching this., I wish you the best with everything that you do, I wish you the best with everything you go through.  🙏🙏🙏","Likes":"35.0","Sentiment":"2.0"}
{"":"643","Video ID":"MSTmUJU48g4","Comment":"The Market has been pretty bad until today it decided to surge. Everybody was Practically Crying then. It kept dipping. That's what you get when you feel you can navigate the process on your own. Big thank to Hilder Ferguson. I'm not bothered with how bad the Market is because my assests are insured due to her advice and I still receive my profits","Likes":"33.0","Sentiment":"0.0"}
{"":"644","Video ID":"MSTmUJU48g4","Comment":"Not only on the wrong track but off the rails Chuck.","Likes":"31.0","Sentiment":"0.0"}
{"":"645","Video ID":"MSTmUJU48g4","Comment":"Conveniently leaving out voters' opinions on the media, by far the worst of the institutions.","Likes":"39.0","Sentiment":"0.0"}
{"":"646","Video ID":"MSTmUJU48g4","Comment":"why would they be angry.   they voted for it.","Likes":"14.0","Sentiment":"0.0"}
{"":"647","Video ID":"MSTmUJU48g4","Comment":"If you read Barbara Walter's How Civil Wars Start you would know that there are two issues that lead to violence - anocracy and factionalization. Democracies don't fight, nor do authoritarian states, it's the transition from one system to the other where the hazards are found - that's anoncracy. Factions in the book means when people sort themselves by ethnic or sectarian attributes, rather than policy preferences, and this sorting creeps into their entire lives. We've been on that course since the Tea Party started. The only cure is doubling down on democratic participation. The GOP is pointedly NOT doing that anywhere they've got their hands on the controls. We are being steered right for the ditch, so I'm glad at least one in five of us say that's the #1 problem we face.","Likes":"12.0","Sentiment":"0.0"}
{"":"648","Video ID":"MSTmUJU48g4","Comment":"Wage slavery during the apocalypse polls poorly.  Who would have guessed?","Likes":"16.0","Sentiment":"0.0"}
{"":"649","Video ID":"MSTmUJU48g4","Comment":"21% making 💵\n74% struggling","Likes":"9.0","Sentiment":"0.0"}
{"":"650","Video ID":"MSTmUJU48g4","Comment":"Most Important Issue:  Too much money in politics.  \n\nWe desperately need campaign finance reform.","Likes":"14.0","Sentiment":"0.0"}
{"":"651","Video ID":"MSTmUJU48g4","Comment":"Spending billions on space when we have much to do here on earth","Likes":"12.0","Sentiment":"1.0"}
{"":"652","Video ID":"MSTmUJU48g4","Comment":"Do a poll to see who is responsible for all of this. One single man with only his own personal interest has done all of this.","Likes":"24.0","Sentiment":"0.0"}
{"":"653","Video ID":"Sdm1WsGGU0w","Comment":"पत्रकार को बहुत जल्दी पता चलता है कि ak47  कहाँ है जब झारखंड में आदिवासी मूल वासी अपनी हक अधिकार के लिए  1932 और स्थानीय नीति को लेकर आंदोलन कर रहे है ये सभी बातें मिडिया के कानों में नहीं आती अब झारखंड सांत है  तो अशांति फैलाना बंद करे जय झारखंड जोहार झारखंड","Likes":"3.0","Sentiment":"1.0"}
{"":"654","Video ID":"Sdm1WsGGU0w","Comment":"क्या RSS के पास इतना हथियार है उसको आपलोग छापेमारी क्यों नहीं करते है","Likes":"0.0","Sentiment":"1.0"}
{"":"655","Video ID":"Sdm1WsGGU0w","Comment":"Bihar me ba","Likes":"0.0","Sentiment":"1.0"}
{"":"656","Video ID":"XHKojSQxTs0","Comment":"Bihar ko barbad karega nitish.","Likes":"0.0","Sentiment":"1.0"}
{"":"657","Video ID":"XHKojSQxTs0","Comment":"Who does not have any principle is Nitish .","Likes":"0.0","Sentiment":"0.0"}
{"":"658","Video ID":"XHKojSQxTs0","Comment":"Wtf ak47😯","Likes":"0.0","Sentiment":"0.0"}
{"":"659","Video ID":"voU9-39bicg","Comment":"火災があったのはラブホテルじゃん。。。","Likes":"0.0","Sentiment":"1.0"}
{"":"660","Video ID":"88w5Q03Lcro","Comment":"Good luck sri lanka team win the match 🇱🇰❤️💪","Likes":"0.0","Sentiment":"2.0"}
{"":"661","Video ID":"88w5Q03Lcro","Comment":"මොකුත් කියන්නෑ සිංහ්ල්ලයට තේරෙන්නැති නිසා","Likes":"3.0","Sentiment":"1.0"}
{"":"662","Video ID":"88w5Q03Lcro","Comment":"Vipaksa unta raja magul biththara \nAmathiyata kondapanana ..gattu thiranaya wanaskaranawa.","Likes":"0.0","Sentiment":"1.0"}
{"":"663","Video ID":"88w5Q03Lcro","Comment":"රාජපක්ෂ kaalakanni වගේම meponsiyath  රට haansi karalama makabaawila යැයි wage .","Likes":"0.0","Sentiment":"1.0"}
{"":"664","Video ID":"88w5Q03Lcro","Comment":"සේනාධි ගුරාට සේවන්දි මෑනියන්ගේ  පිහිටයි.😂😂","Likes":"0.0","Sentiment":"1.0"}
{"":"665","Video ID":"88w5Q03Lcro","Comment":"Yako oita wada hodai mokuthma anayanaya nokara lankawe minissuth marenda erala pitaratin minssu anayanaya karanam","Likes":"1.0","Sentiment":"1.0"}
{"":"666","Video ID":"88w5Q03Lcro","Comment":"Ape..aege...thiyena....keeli...tika....aran...anna..puluwande","Likes":"0.0","Sentiment":"1.0"}
{"":"667","Video ID":"88w5Q03Lcro","Comment":"Mewa ratin  gennath barida apita","Likes":"0.0","Sentiment":"1.0"}
{"":"668","Video ID":"88w5Q03Lcro","Comment":"Thiroda ratha sadaha petrol labadena pamanaya wedikaranu","Likes":"1.0","Sentiment":"1.0"}
{"":"669","Video ID":"B0ga0OUkb9c","Comment":"If \"Rule of Law\" can be implemented, this country still has some hope. BTW please do take action against those who have slandered  and attacked the chief judge and the jurisdiction institution.","Likes":"199.0","Sentiment":"1.0"}
{"":"670","Video ID":"B0ga0OUkb9c","Comment":"Nobody is a clear winner here. It is a great lesson for Politicians out there. But I beliwve there are still pretty much many more \"Najib\" out there in our Political & Government institutions.","Likes":"191.0","Sentiment":"1.0"}
{"":"671","Video ID":"B0ga0OUkb9c","Comment":"This gives hope to all malaysian citizens...justice is prevail...","Likes":"264.0","Sentiment":"2.0"}
{"":"672","Video ID":"B0ga0OUkb9c","Comment":"Hopefully after this...our judiciary system will always be free from corrupt politicians","Likes":"16.0","Sentiment":"1.0"}
{"":"673","Video ID":"B0ga0OUkb9c","Comment":"What a victory for Malaysians!   Much thanks to the Judiciary that refuse to take nonsense to delay and frustrate.   PMs are not fallible and you can’t  get away with crimes as such.   That also goes to show that politicians are not invincible and must be accountable for their actions.   Tahniah!","Likes":"123.0","Sentiment":"1.0"}
{"":"674","Video ID":"B0ga0OUkb9c","Comment":"Semoga Malaysia semakin berjaya\nFrom Indonesia","Likes":"31.0","Sentiment":"1.0"}
{"":"675","Video ID":"B0ga0OUkb9c","Comment":"2 rekod die buat\n\n1)Perdana menteri pertama yang dijatuhkan melalui pilihan raya\n2)Perdana menteri pertama ke penjara.....","Likes":"45.0","Sentiment":"1.0"}
{"":"676","Video ID":"B0ga0OUkb9c","Comment":"Alhamdullilah....semoga najib tabah dan terima ini sebangai pengajaran yg amat berharga dlm hidupnya","Likes":"29.0","Sentiment":"1.0"}
{"":"677","Video ID":"B0ga0OUkb9c","Comment":"Peribahasa ‘orang tamak selalu rugi’ tu benar. Apa lagi yang tak cukup dengan Jawatan dan Gaji yang besar sebagai Perdana Menteri? Apa yang kurang dalam kehidupan seorang Perdana Menteri? Lebih menyedihkan, seorang muslim, beragama Islam, seorang pemimpin yg sepatutnya jadi teladan tapi berkelakuan sebaliknya. Semalam, beliau buat sumpah laknat, hari ni beliau ke penjara. Sedangkan semua bukti telah ditunjukkan di mahkamah bahawa ternyata beliau melakukan kesalahan, beliau masih berani bersumpah dengan nama Allah. Begitu mudah ucap dan permainkan nama Allah serta agamanya. Cukup ada seorang penyangak Najib di Malaysia ni, jangan kita benarkan dan lahirkan lebih ramai penyangak seperti Najib di masa akan datang. Jangan jadikan Malaysia kotor dan jijik di pndangan negara dunia lain.","Likes":"99.0","Sentiment":"1.0"}
{"":"678","Video ID":"B0ga0OUkb9c","Comment":"Peluang membela diri sejak minggu lalu disia-siakan dengan tindakan bersumpah laknat, berpakat malukan CJ Dan sandiwara.. Memang tiada niat nak Bela diri kerana terjerat habis dengan penipuan sendiri..!!","Likes":"23.0","Sentiment":"1.0"}
{"":"679","Video ID":"--hxd1CrOqg","Comment":"It’s really unfortunate that the intended target was missed.","Likes":"49.0","Sentiment":"0.0"}
{"":"680","Video ID":"--hxd1CrOqg","Comment":"My heartfelt condolences to the  car","Likes":"35.0","Sentiment":"1.0"}
{"":"681","Video ID":"--hxd1CrOqg","Comment":"RIP to the Toyota Lancruiser also killed in the bombing.  It would have reach a retiring million Km mark with proper motor oil, transmission oil and gear cases maintenance. It will be missed by the local dealership & mechanic.","Likes":"52.0","Sentiment":"0.0"}
{"":"682","Video ID":"--hxd1CrOqg","Comment":"I feel so bad for the victim of that bombing. My heart goes out to the car.","Likes":"69.0","Sentiment":"0.0"}
{"":"683","Video ID":"--hxd1CrOqg","Comment":"Sucks to suck, Dugin. Unfortunate a car was destroyed in the process.","Likes":"4.0","Sentiment":"0.0"}
{"":"684","Video ID":"--hxd1CrOqg","Comment":"Ukrainians express their deepest condolences to the vehicle she was in.","Likes":"3.0","Sentiment":"1.0"}
{"":"685","Video ID":"--hxd1CrOqg","Comment":"Slava Ukraini !! I really hope that Mr. Dugin knows what the pain is when losing your shared ones.. like all the parents in Ukraine who lost daughters, sons, babies,Mom and Dad during that sad war !","Likes":"43.0","Sentiment":"0.0"}
{"":"686","Video ID":"--hxd1CrOqg","Comment":"The ignorance of the people vilifying someone who tragically was assassinated is asinine. Also doesn't help, when you realize that Russia is using her death as a Franz Ferdinand moment. So yeah keep vilifying til your world ends, not a threat an analyzation.\n\nWith this, Russia won't stop til Ukraine falls.","Likes":"1.0","Sentiment":"0.0"}
{"":"687","Video ID":"--hxd1CrOqg","Comment":"I’m dead serious about this, he switched cars at the last second, now why would he do that? Felt his safety was in danger? Something doesn’t  add up about all this.","Likes":"173.0","Sentiment":"0.0"}
{"":"688","Video ID":"--hxd1CrOqg","Comment":"I feel bad for the daughter, not for the father","Likes":"17.0","Sentiment":"0.0"}
{"":"689","Video ID":"o3TQPM5OkEU","Comment":"The case was brought to Federal Court only to have another year of freedom. His side clearly had no proper counter arguments from the start. Pity the court of having to deal with this drama.","Likes":"89.0","Sentiment":"0.0"}
{"":"690","Video ID":"o3TQPM5OkEU","Comment":"My salute to the judges. They are not swayed by threats, accusations against them. Justice is served.","Likes":"77.0","Sentiment":"2.0"}
{"":"691","Video ID":"o3TQPM5OkEU","Comment":"This is the real meaning of MERDEKA...for RAKYAT.🙏","Likes":"91.0","Sentiment":"2.0"}
{"":"692","Video ID":"o3TQPM5OkEU","Comment":"Imagine a Prime Minister this corrupted. Can you think of the people in his circle?","Likes":"46.0","Sentiment":"0.0"}
{"":"693","Video ID":"o3TQPM5OkEU","Comment":"Fair and transparent trial and appeal despite vile attempts to delay and frustrate justice","Likes":"123.0","Sentiment":"0.0"}
{"":"694","Video ID":"o3TQPM5OkEU","Comment":"The best day of my life, the best news ever. Whatever goes around comes around. Justice prevailed, thank God","Likes":"49.0","Sentiment":"2.0"}
{"":"695","Video ID":"o3TQPM5OkEU","Comment":"There is hope for our nation! Thank you to the prosecution and judiacry.","Likes":"76.0","Sentiment":"2.0"}
{"":"696","Video ID":"o3TQPM5OkEU","Comment":"This year Merdeka is probably one of the most memorable ones after Najib's final verdict. The judges are our last straw of hope to bring corruptors behind the bars","Likes":"31.0","Sentiment":"2.0"}
{"":"697","Video ID":"o3TQPM5OkEU","Comment":"The court had done its job. Now the rakyat's turn. If BN wins the next PRU, it'll likely be that they ask for royal pardon to free him. It'll be difficult to know if Agong will grant it seeing this is a serious crime of trustworthiness and integrity. We do not know. It's our job to make sure BN has no such opportunity.","Likes":"116.0","Sentiment":"0.0"}
{"":"698","Video ID":"o3TQPM5OkEU","Comment":"Finally justice has been served to Najib Razak!","Likes":"72.0","Sentiment":"1.0"}
{"":"699","Video ID":"lHDn25SLgdk","Comment":"Thank God for the people who called it in and the officers who responded.","Likes":"1397.0","Sentiment":"2.0"}
{"":"700","Video ID":"lHDn25SLgdk","Comment":"Whoever saw him and said something saved untold innocent lives.","Likes":"1539.0","Sentiment":"1.0"}
{"":"701","Video ID":"lHDn25SLgdk","Comment":"Great job to everyone that was aware and made a call to action. You helped save lives. Unfortunately this is becoming the normal but if we are alert and step in, we can avoid a tragedy.","Likes":"781.0","Sentiment":"2.0"}
{"":"702","Video ID":"lHDn25SLgdk","Comment":"Shows what a tremendous difference we can make by being alert and notifying the authorities when suspicious. Better to be safe than sorry. The police aren’t able to do this on their own without us all being aware and responsible citizens. Massive thank you to all those involved especially those who did chose to speak up! 🙏🏻🕊","Likes":"421.0","Sentiment":"2.0"}
{"":"703","Video ID":"lHDn25SLgdk","Comment":"I’m grateful that someone was paying attention and called it in and everyone is safe. I’m sad for the young lady though who feels like it was the only place she could go to feel accepted. I hope she can find some peace and friendship in a more permanent way.","Likes":"314.0","Sentiment":"2.0"}
{"":"704","Video ID":"lHDn25SLgdk","Comment":"Bless the witnesses who reported this and the police who responded. We should all take note and keep our eyes out to protect each other.","Likes":"237.0","Sentiment":"1.0"}
{"":"705","Video ID":"lHDn25SLgdk","Comment":"My friends were there last night. FUCKING PROPS to those that called it in!","Likes":"519.0","Sentiment":"0.0"}
{"":"706","Video ID":"lHDn25SLgdk","Comment":"Excellent job to the Grant county sheriff's office and to the people attending the concert who kept an eye out and reported it.","Likes":"377.0","Sentiment":"2.0"}
{"":"707","Video ID":"lHDn25SLgdk","Comment":"Thank God that someone was observant and took action to prevent another mass shooting.","Likes":"364.0","Sentiment":"1.0"}
{"":"708","Video ID":"lHDn25SLgdk","Comment":"This is terrifying. A couple days ago I was just talking to my friend who went to a music festival where the security didn't even check bags. She was kinda scared how an event like that could easily be the target of mass shooting.","Likes":"36.0","Sentiment":"0.0"}
{"":"709","Video ID":"kSKxCN8M-WE","Comment":"චීනය සක්කිලී රටක් උන් බොර දියෙත් මාලූ බානෝ තව නය දිදී ✊","Likes":"7.0","Sentiment":"1.0"}
{"":"710","Video ID":"kSKxCN8M-WE","Comment":"අනවශ්‍ය භාන්ඩ ආනයනය තහනම්  \nකරපු එක ඉතා හොදයි. කෝටි ගානක  කොසු ඉදල්       \nපනා ගෙනාව කියන්නෙ කවුද අවසර දුන්නෙ","Likes":"4.0","Sentiment":"1.0"}
{"":"711","Video ID":"kSKxCN8M-WE","Comment":"සජියො ඔබගෙ තාත්ත ගෙ කාලෙ  අමතකද තරුන කොල්ලො කෙල්ලො හැටදාහක් මරන කොට ඔබ කොහෙද හිටියෙ ඔබත් බලය ගන්න දගලන දැගලිල්ල","Likes":"2.0","Sentiment":"1.0"}
{"":"712","Video ID":"kSKxCN8M-WE","Comment":"අනෙ යකො සුපඩීසල් ගොවිතැනට නොව තොපෙ සුපගිබොග වාහන සදහා    තොපෙ ඉපදෙන හො ඉපදිලා ඉන දරුවන්ටත් එක්ක හෙන 7ගහනව යකො","Likes":"2.0","Sentiment":"1.0"}
{"":"713","Video ID":"kSKxCN8M-WE","Comment":"මේ ඝන ගෙඩියො ටික නම් එලවන්න ඕනෙ රටෙන්ම","Likes":"2.0","Sentiment":"1.0"}
{"":"714","Video ID":"kSKxCN8M-WE","Comment":"අනේ පලයල්ල ජි එල් පිනක් දහමක් කරගන ඉදපන්","Likes":"1.0","Sentiment":"1.0"}
{"":"715","Video ID":"kSKxCN8M-WE","Comment":"Kukul kama mila adukaranna appo, munta posathwenna paribogikayo munge biththare kanna kiyana kiyana ganata, masa3,4,k warjane karama biththare welenawa hellenawa, athakota kohomada vikunanne, kikiliyonta  wada bithara danne mafiya karayone,","Likes":"0.0","Sentiment":"1.0"}
{"":"716","Video ID":"kSKxCN8M-WE","Comment":"🤟","Likes":"1.0","Sentiment":"1.0"}
{"":"717","Video ID":"kSKxCN8M-WE","Comment":"Aaepalaballayanna.tuopiltteeknsalliaran.hodatanatuwa.aperatakapuballo.tuopi.ltteeknwththa.janadipathimandirakawena.tuopi.aperatahodamahariyavinasakara.nesajyo.ube.ththakarapuwada.apihodatadannawa.katawhpiyballo","Likes":"0.0","Sentiment":"1.0"}
{"":"718","Video ID":"kSKxCN8M-WE","Comment":"Mepitaratawl.walinaperatata.hamadatama.athadanakanbalagainne.aperateharkka.aperataginithiyapu.ballo.eliyatadannakiyanauntha.hiredannaona.mehamuduruo.pawatamahanawela.munasurugalawannaona.munhamuduruo.ganuassarigriganodakin","Likes":"0.0","Sentiment":"1.0"}
{"":"719","Video ID":"fHCk3o_5l7o","Comment":"So sorry about Mr. Engle's son. condolences to the family.","Likes":"131.0","Sentiment":"0.0"}
{"":"720","Video ID":"fHCk3o_5l7o","Comment":"Dear Richard Engel and his wife, my sincere condolences on your loss. Your pain cannot be imagined but your bravery and courage in sharing your son's struggles is felt and now his legacy may hold a cure down the road for other families so they will never have to endure your heartbreak. Sending you blessings and hugs. Please stay safe and strong.❤️🙏","Likes":"62.0","Sentiment":"2.0"}
{"":"721","Video ID":"fHCk3o_5l7o","Comment":"I'll be so glad when the whole tRump Drama is over. 5 years of a bad play is too much for any audience member to endure.","Likes":"39.0","Sentiment":"0.0"}
{"":"722","Video ID":"fHCk3o_5l7o","Comment":"Two of the most important jobs are sadly also the most underappreciated... teachers and nurses deserve so much more. More money. More respect. More support.","Likes":"14.0","Sentiment":"2.0"}
{"":"723","Video ID":"fHCk3o_5l7o","Comment":"So sorry for Richard and his family. I hope they find the strength they need to go through this process.","Likes":"83.0","Sentiment":"0.0"}
{"":"724","Video ID":"fHCk3o_5l7o","Comment":"My condolences to Richard and his family. He is a great journalist.","Likes":"65.0","Sentiment":"2.0"}
{"":"725","Video ID":"fHCk3o_5l7o","Comment":"my prayers are with Richard and his family, heartbreaking","Likes":"66.0","Sentiment":"1.0"}
{"":"726","Video ID":"fHCk3o_5l7o","Comment":"When money plays out those millionaires have many ways to evade prosecution. But when poor people get in trouble they are doomed.","Likes":"39.0","Sentiment":"0.0"}
{"":"727","Video ID":"fHCk3o_5l7o","Comment":"It’s never easy to lose a child, nor is it easy to lose a sibling. Richard, Mary, and Theo- sending positive thoughts your way. RIP Henry.","Likes":"125.0","Sentiment":"1.0"}
{"":"728","Video ID":"fHCk3o_5l7o","Comment":"Rest in peace Henry, and fly high with the angels 😇 🙏","Likes":"29.0","Sentiment":"2.0"}
{"":"729","Video ID":"8NL6YyEW2ww","Comment":"I heart goes out to Richard Engel. I am literally crying my eyes out right now and yes I’m a man. It is so sad for our own Richard to lose his son. I’m so sorry for your lost Richard. I hope you take some time off and be with your family. God bless you and your family. 🥲🥺😢😭💪🏼🙏🏼","Likes":"7.0","Sentiment":"0.0"}
{"":"730","Video ID":"8NL6YyEW2ww","Comment":"Deepest condolences 💐 to Richard n family\nRIP precious Henry","Likes":"1.0","Sentiment":"1.0"}
{"":"731","Video ID":"8NL6YyEW2ww","Comment":"Airlines intentionally mislead customers. It’s discussing. They got a high amount of money from the government and now they over books all flights.","Likes":"1.0","Sentiment":"0.0"}
{"":"732","Video ID":"8NL6YyEW2ww","Comment":"I never thought Oklahoma would have more water than most of the US. We’ve had rain and we have no ban on watering.","Likes":"2.0","Sentiment":"1.0"}
{"":"733","Video ID":"8NL6YyEW2ww","Comment":"Thank you Pete??  Planning a trip and missing a wedding or a funeral. No excuse for over selling every flight. They need to factor weather in the schedule.","Likes":"1.0","Sentiment":"0.0"}
{"":"734","Video ID":"8NL6YyEW2ww","Comment":"We need a program to encourage builders to build reasonable priced homes. \n$400,000 is too high for most people.","Likes":"0.0","Sentiment":"1.0"}
{"":"735","Video ID":"8NL6YyEW2ww","Comment":"that that judge said even if we have to bend the law or broke it in the good faith of the white privilege that's what they'll do","Likes":"0.0","Sentiment":"1.0"}
{"":"736","Video ID":"8NL6YyEW2ww","Comment":"My Condolence To Richard And Family","Likes":"4.0","Sentiment":"2.0"}
{"":"737","Video ID":"8NL6YyEW2ww","Comment":"*Investing in crypto now should be in every wise individuals list, in some months time you'll be ecstatic with the decision you made today.*","Likes":"31.0","Sentiment":"2.0"}
{"":"738","Video ID":"8NL6YyEW2ww","Comment":"\"I worried because my grass is dead.\" \n\nWow, you aren't ready for this world, lady.","Likes":"8.0","Sentiment":"0.0"}
{"":"739","Video ID":"uDSR4wV_zno","Comment":"All wars are terrible but honourable in defence of one's country! \nSlava Ukraine!!!","Likes":"231.0","Sentiment":"0.0"}
{"":"740","Video ID":"uDSR4wV_zno","Comment":"You’re in the middle of a ground invasion/occupation of a neighboring country and don’t feel even a little ridiculous complaining that someone ruined your navy parade? 🤦🏻‍♂️","Likes":"1067.0","Sentiment":"0.0"}
{"":"741","Video ID":"uDSR4wV_zno","Comment":"Proud of my Ukrainian blood.  Even more proud of the strength of cousins I've never met. I'm with you in mind and spirit. ❤️","Likes":"82.0","Sentiment":"2.0"}
{"":"742","Video ID":"uDSR4wV_zno","Comment":"Glory to Ukraine 🇺🇦 from 🇺🇲 the brave stand against evil","Likes":"42.0","Sentiment":"2.0"}
{"":"743","Video ID":"uDSR4wV_zno","Comment":"Stay Strong Ukraine Russia go home","Likes":"64.0","Sentiment":"1.0"}
{"":"744","Video ID":"uDSR4wV_zno","Comment":"I am romanian but have many polish friends and I am also ex Romanian military. I don t think Poland wouldn t be backed up by my country in a possible conflict against the russians .Romania has a long history of being against russian politics and also let s remember the same way the ukrainians have sunk the admiral ship Moskva in recent days the romanians did the same during ww. Soooo..I don t think Poland would stand alone. Good on you Poland and good on you Polish people for readying your armed forces for any future challenges and don t forget Romania will be there for you.","Likes":"332.0","Sentiment":"1.0"}
{"":"745","Video ID":"uDSR4wV_zno","Comment":"As a Romanian, I'm eagerly awaiting to vacation in friendly, sovereign and free Ukrainian Crimea. Slava Ukraini!","Likes":"146.0","Sentiment":"2.0"}
{"":"746","Video ID":"uDSR4wV_zno","Comment":"Ukraine amazing people, amazing Army .  Cant wait to visit this country once its liberated .","Likes":"130.0","Sentiment":"2.0"}
{"":"747","Video ID":"uDSR4wV_zno","Comment":"Slava Ukraine from Hungary.  🇺🇦👍🇺🇦","Likes":"72.0","Sentiment":"1.0"}
{"":"748","Video ID":"uDSR4wV_zno","Comment":"How dare they defend themselves after being invaded , what's the world coming too 🙄","Likes":"67.0","Sentiment":"0.0"}
{"":"749","Video ID":"f2TK2lpFFzs","Comment":"happy first day of school, stay safe everyone, God bless to all 🙂","Likes":"2.0","Sentiment":"2.0"}
{"":"750","Video ID":"f2TK2lpFFzs","Comment":"no need na mag asukal, diet is the key :)","Likes":"0.0","Sentiment":"2.0"}
{"":"751","Video ID":"f2TK2lpFFzs","Comment":"24 Oras Livestream: Augt 22, 2022 _ Replay","Likes":"1.0","Sentiment":"1.0"}
{"":"752","Video ID":"f2TK2lpFFzs","Comment":"GMA NEWS Subscribe \n  DZBB","Likes":"1.0","Sentiment":"1.0"}
{"":"753","Video ID":"f2TK2lpFFzs","Comment":"DZ Dobol B","Likes":"1.0","Sentiment":"1.0"}
{"":"754","Video ID":"f2TK2lpFFzs","Comment":"Pag member po ba ng 4ps ay di pwedrng makakuha","Likes":"0.0","Sentiment":"1.0"}
{"":"755","Video ID":"f2TK2lpFFzs","Comment":"Oky","Likes":"0.0","Sentiment":"1.0"}
{"":"756","Video ID":"f2TK2lpFFzs","Comment":"Iukikuik","Likes":"0.0","Sentiment":"1.0"}
{"":"757","Video ID":"8Vqj8Ls29HI","Comment":"Miss tharine sir chandana thank you swarnawhine 💖❤👍🇦🇪🇱🇰","Likes":"1.0","Sentiment":"2.0"}
{"":"758","Video ID":"8Vqj8Ls29HI","Comment":"Ranila bhanda a ayanam kirem nawata dama rate eturu tikat kannay hadanne 👎👎👎👎","Likes":"0.0","Sentiment":"1.0"}
{"":"759","Video ID":"8Vqj8Ls29HI","Comment":"Mokakda.ratata.karapu.sewaya.rata.kewa.wensa.kara.ekada.karapu.sewaya.😁😁😁😁😁😁","Likes":"0.0","Sentiment":"2.0"}
{"":"760","Video ID":"8Vqj8Ls29HI","Comment":"වතුරත් පිටරටින්???","Likes":"0.0","Sentiment":"1.0"}
{"":"761","Video ID":"8Vqj8Ls29HI","Comment":"Gota pohora natey kala rata kawa 😡😡😡","Likes":"0.0","Sentiment":"0.0"}
{"":"762","Video ID":"8Vqj8Ls29HI","Comment":"Singhayo...singhayo...kiyala umbalama muddharayak ghaganna Epa. Dhan peechan kiyala anith rataval vala eun Katha karana Ava rata inna Api thamaiii dhanne ...🤪","Likes":"0.0","Sentiment":"1.0"}
{"":"763","Video ID":"8Vqj8Ls29HI","Comment":"Atakota,parli,mantuva,hora,hatta,vitarada,hamba,karaganna,kabna,bonna,monavada,ma,ahinsaka,minissu,api,rata","Likes":"0.0","Sentiment":"1.0"}
{"":"764","Video ID":"8Vqj8Ls29HI","Comment":".ranilta.redi.netuwa.inna.kiyapalla.modaya.oya.naki.heganno.tikat.gedara.yawapalla","Likes":"0.0","Sentiment":"1.0"}
{"":"765","Video ID":"8Vqj8Ls29HI","Comment":"Welcome sri lanka crekets team u a e  ❤❤❤👍👍👍🇦🇪🇱🇰🇦🇪🇱🇰","Likes":"0.0","Sentiment":"2.0"}
{"":"766","Video ID":"8Vqj8Ls29HI","Comment":"Bala.lobi.sajabe.panala.p._._.a.denawa.","Likes":"0.0","Sentiment":"1.0"}
{"":"767","Video ID":"uVmNImDu0rQ","Comment":"The CDC was only partly to blame. Our for-profit healthcare system also failed us, as iit does every day.","Likes":"42.0","Sentiment":"0.0"}
{"":"768","Video ID":"uVmNImDu0rQ","Comment":"Praying for those miners.","Likes":"49.0","Sentiment":"1.0"}
{"":"769","Video ID":"uVmNImDu0rQ","Comment":"Lester, you are the only news I listen to these days. It is such a relief to have one outlet to hear the current news REPORTED in a neutral factual way. Everywhere else there is no reporting, just drama and opinions about current events. Thank you, thank you, thank you!","Likes":"4.0","Sentiment":"2.0"}
{"":"770","Video ID":"uVmNImDu0rQ","Comment":"In a heartbeat, I'll vote for her.💯💯","Likes":"1.0","Sentiment":"2.0"}
{"":"771","Video ID":"uVmNImDu0rQ","Comment":"Interesting news coverage and very informative, definitely things to know about.","Likes":"7.0","Sentiment":"2.0"}
{"":"772","Video ID":"uVmNImDu0rQ","Comment":"Cdc couldve responded whatever way they wanted, but as we all saw  during the pandemic, too many people would have simply not cared.  Heck it was too much for them to even wear a mask","Likes":"23.0","Sentiment":"0.0"}
{"":"773","Video ID":"uVmNImDu0rQ","Comment":"What a great story by a honorable and honest man. I believe him,and am also someone who has had contact. Much love and peace to all.","Likes":"0.0","Sentiment":"2.0"}
{"":"774","Video ID":"uVmNImDu0rQ","Comment":"Didn’t need the cdc to make that announcement we knew they didn’t do their job","Likes":"8.0","Sentiment":"0.0"}
{"":"775","Video ID":"uVmNImDu0rQ","Comment":"-A country is not great until it can protect ALL its people with free healthcare.\n-Is Pence feeling the heat getting closer ?\n- sorry about Cheney, Wyoming got its priority really wrong.","Likes":"37.0","Sentiment":"0.0"}
{"":"776","Video ID":"uVmNImDu0rQ","Comment":"Liz Liz displays common sense and a desire to do the right thing.","Likes":"25.0","Sentiment":"2.0"}
{"":"777","Video ID":"_JGrWrwOoD8","Comment":"Garibo ke masiha abbas ansari jindabad","Likes":"5.0","Sentiment":"1.0"}
{"":"778","Video ID":"_JGrWrwOoD8","Comment":"Masiha Mukhtar Ansari","Likes":"3.0","Sentiment":"1.0"}
{"":"779","Video ID":"_JGrWrwOoD8","Comment":"Desh ka kanoon, sambidhan  superem court, election commission me koi educated log nhi h ki jo aafami jail gaya ho ,balatkari ho ,aatanki spot, mudar kiya ho en log ko leader  kyo,  jinko sambidhan  ki abacd malum nhi aaj bharat me leader h to kya vikas hoga ghanta","Likes":"0.0","Sentiment":"1.0"}
{"":"780","Video ID":"_JGrWrwOoD8","Comment":"Ya tu Shahrukh ke dialogues ha Don parkahna mushkeen he nhe ne mumkeen ha 😀😀😀😀\nKab tak Bakri ke maa kher manai gee\nComon Yogi laga raha Buldozer BABA","Likes":"0.0","Sentiment":"1.0"}
{"":"781","Video ID":"_JGrWrwOoD8","Comment":"Jab baap se pala padta h tb bhagne k lia raste km pad jate😁😁😁😁😔😁😁😁😁","Likes":"0.0","Sentiment":"2.0"}
{"":"782","Video ID":"_JGrWrwOoD8","Comment":"Vidhayak na name sahi se lijiye patrakar jiii","Likes":"0.0","Sentiment":"1.0"}
{"":"783","Video ID":"_JGrWrwOoD8","Comment":"Mujhe esa  lag raha police se jayad aap ke dard ho rha he","Likes":"0.0","Sentiment":"1.0"}
{"":"784","Video ID":"_JGrWrwOoD8","Comment":"Abbas Ansari jindabad Mukhtar Ansari jindabad","Likes":"2.0","Sentiment":"1.0"}
{"":"785","Video ID":"_JGrWrwOoD8","Comment":"Sala tum media walo desh me jo ve drama karwa do","Likes":"0.0","Sentiment":"1.0"}
{"":"786","Video ID":"_JGrWrwOoD8","Comment":"Jaesa tum bol rahe ho ayesa hi himmat bjp ke liya dikha do","Likes":"0.0","Sentiment":"1.0"}
{"":"787","Video ID":"hPy7QFsTaLw","Comment":"0:06 this is how we Ukrainians feel when your missiles fly over us all the time watching our fellow friends and family die at your hands","Likes":"165.0","Sentiment":"0.0"}
{"":"788","Video ID":"hPy7QFsTaLw","Comment":"\"It was a beautiful car explosion. A perfect car explosion. People tell me they've never seen such as perfect car explosion.\"","Likes":"93.0","Sentiment":"2.0"}
{"":"789","Video ID":"hPy7QFsTaLw","Comment":"someone wanted to take him out but ended up hurting him one million times more.","Likes":"62.0","Sentiment":"0.0"}
{"":"790","Video ID":"hPy7QFsTaLw","Comment":"It hurt ha ? \nNow the father can feel the pain he likes to influenced.","Likes":"75.0","Sentiment":"0.0"}
{"":"791","Video ID":"hPy7QFsTaLw","Comment":"He has lost what is most precious to himself , his no claims bonus .","Likes":"27.0","Sentiment":"0.0"}
{"":"792","Video ID":"hPy7QFsTaLw","Comment":"Well he now knows how the families of the victims of the Novichok attack feel in Britain.","Likes":"100.0","Sentiment":"0.0"}
{"":"793","Video ID":"hPy7QFsTaLw","Comment":"He’ll probably blame everyone else but himself after immersing himself in hatred.  He will probably be genuinely perplexed as to why anybody might want to kill them","Likes":"170.0","Sentiment":"0.0"}
{"":"794","Video ID":"hPy7QFsTaLw","Comment":"Instant karma. Feel the pain of many ukrainian fathers who have lost their sons and daughters in Ukraine. This is much painful than being assassinated.","Likes":"168.0","Sentiment":"0.0"}
{"":"795","Video ID":"hPy7QFsTaLw","Comment":"The fear he (and others with him) will suffer every time he gets into a car now.","Likes":"147.0","Sentiment":"0.0"}
{"":"796","Video ID":"hPy7QFsTaLw","Comment":"It's tragic that someone loses their life like that... but don't forget that one violence is the cause of another violence. The young woman's father propagated violence, and now it came back to him with violence against his family..... use your brain, violence is always the worst option!","Likes":"59.0","Sentiment":"0.0"}
{"":"797","Video ID":"s-XXxzZCkLg","Comment":"Prayers that everyone in their family get to dry ground and stay safe. But also this is a blessing so many of these areas really needed this water","Likes":"16.0","Sentiment":"2.0"}
{"":"798","Video ID":"s-XXxzZCkLg","Comment":"Hope  the person missing in Zion National Park is found safe.Hopefully they were able to get to higher ground.","Likes":"41.0","Sentiment":"2.0"}
{"":"799","Video ID":"s-XXxzZCkLg","Comment":"It'll never hit home, till it actually hits home, for some people...","Likes":"32.0","Sentiment":"0.0"}
{"":"800","Video ID":"s-XXxzZCkLg","Comment":"The rain is greatly needed in some areas but, I want folks to be safe also 🙏🏽","Likes":"12.0","Sentiment":"2.0"}
{"":"801","Video ID":"s-XXxzZCkLg","Comment":"The potential tropical storm passed thru here in Merida, Yucatan a couple days ago & was pretty fierce. Our strongest storm of the 2022 rainy season. Definitely needed to place objects that can become airborne in a safe place!  Hopefully, Monterrey will get the much needed rains they've been praying for.","Likes":"8.0","Sentiment":"2.0"}
{"":"802","Video ID":"s-XXxzZCkLg","Comment":"Wow...at same time I had flooding Inside my house in Caribbean. Pushing flood water out my mind went on gratitude that others have it worse not knowing same occuring simultaneously. I hope all recover quickly","Likes":"19.0","Sentiment":"0.0"}
{"":"803","Video ID":"s-XXxzZCkLg","Comment":"When the land is hit by heat waves and dries, water usually can't get in and that's a recipe for floods when it rains.","Likes":"84.0","Sentiment":"0.0"}
{"":"804","Video ID":"s-XXxzZCkLg","Comment":"maybe we could build more water reservoirs on a smaller scale to gather this much needed water, just an idea","Likes":"86.0","Sentiment":"1.0"}
{"":"805","Video ID":"s-XXxzZCkLg","Comment":"This is what happens when we continue to neglect the environment when our lakes are drying up. The only way to stop future tragedies like this is to get on top of our climate issues","Likes":"0.0","Sentiment":"0.0"}
{"":"806","Video ID":"s-XXxzZCkLg","Comment":"Yes, my fellow Texans, stay alert, because if anything happens we are on our own. \nAbbott will likely spend 5 mins blaming the windmills then go back to his cocktail party while millions go without drinking water.","Likes":"74.0","Sentiment":"0.0"}
{"":"807","Video ID":"bLHeJmGUyWQ","Comment":"අහිංසක  මිනිස්සු ට උපකාර  කරන  සියලු දෙනාටම","Likes":"0.0","Sentiment":"1.0"}
{"":"808","Video ID":"bLHeJmGUyWQ","Comment":"සහතික  ඇත්ත","Likes":"0.0","Sentiment":"1.0"}
{"":"809","Video ID":"bLHeJmGUyWQ","Comment":"ත්‍රස්තවාදි ඉන්න රටකට විදේශීකය පැමිණිම ලකුනක්.😡","Likes":"0.0","Sentiment":"1.0"}
{"":"810","Video ID":"bLHeJmGUyWQ","Comment":"ගජ මිතුරැ සංගමයට ජයක්.","Likes":"0.0","Sentiment":"1.0"}
{"":"811","Video ID":"bLHeJmGUyWQ","Comment":"පට්ට හොිරැ කලබලේ.","Likes":"0.0","Sentiment":"1.0"}
{"":"812","Video ID":"bLHeJmGUyWQ","Comment":"🙏🙏🙏🙏🙏🙏🙏👍👍👍👍🐎","Likes":"0.0","Sentiment":"2.0"}
{"":"813","Video ID":"bLHeJmGUyWQ","Comment":"ගජමිතුරැ සංගමයට සහනයක්.😡😡","Likes":"0.0","Sentiment":"0.0"}
{"":"814","Video ID":"bLHeJmGUyWQ","Comment":"සජි ඔයගෙ තත්තා හිටියනම් ටැයර්එකෙ යවන්නෙ නෙද සජිත්  බිත්තර 30  දිපල්ල  වැඩිකොලොත් ගන්න එපා","Likes":"0.0","Sentiment":"1.0"}
{"":"815","Video ID":"bLHeJmGUyWQ","Comment":"අනිවාර්යයෙන් ම","Likes":"0.0","Sentiment":"1.0"}
{"":"816","Video ID":"bLHeJmGUyWQ","Comment":"පක්ෂ 8 පට්ට හෝරැ...😡😡😡👉👌👉👉👌👉👌","Likes":"0.0","Sentiment":"0.0"}
{"":"817","Video ID":"h4VjpOOWzZ0","Comment":"That boy and girl just at the end of the report they're so happy in spite of the invasion of their country. Those two are great 👍😊❤️","Likes":"0.0","Sentiment":"2.0"}
{"":"818","Video ID":"h4VjpOOWzZ0","Comment":"Today 33 years ago (23 August 1989) millions of people from Latvia, Lithuania and Estonia formed the longest human chain ever (600 KM) across the three countries, to express their will to get rid of soviet totalitarism and imperialism. Few months later, they eventually would become free, independent states.\n\nThree countries I deeply respect, at the frontline of stoneage, barbarian Russian imperialism.","Likes":"9.0","Sentiment":"1.0"}
{"":"819","Video ID":"h4VjpOOWzZ0","Comment":"Common sense !! I really think a lot more is needed!!!","Likes":"2.0","Sentiment":"1.0"}
{"":"820","Video ID":"h4VjpOOWzZ0","Comment":"We need more Britt coverage.  😉","Likes":"42.0","Sentiment":"2.0"}
{"":"821","Video ID":"h4VjpOOWzZ0","Comment":"6 months....and at times we had to be reminded a war was going on","Likes":"11.0","Sentiment":"0.0"}
{"":"822","Video ID":"h4VjpOOWzZ0","Comment":"Rumi, a 13th century Persian philosopher's view on wars, \"Wars, like childrens fights, are meaningless, pitiless and contemptible.\"","Likes":"0.0","Sentiment":"0.0"}
{"":"823","Video ID":"h4VjpOOWzZ0","Comment":"Have you considered why somehow the war should not be taken onto Russian territory or Russians should be in any way immune from the horrors of the war of conquest that Russians have started, the trillions in damage the Russians have done to Ukraine in terms of infrastructure and lost economic output, the 10s of thousands of people they've killed, the millions of people they've displaced?","Likes":"17.0","Sentiment":"0.0"}
{"":"824","Video ID":"h4VjpOOWzZ0","Comment":"If you can’t sleep at night. Just listen to joe Biden you will go to bed within minutes . No need to buy an app 😂","Likes":"0.0","Sentiment":"2.0"}
{"":"825","Video ID":"h4VjpOOWzZ0","Comment":"But it's okay to invade Ukraine but once Russia is getting attacked its a crime","Likes":"18.0","Sentiment":"0.0"}
{"":"826","Video ID":"h4VjpOOWzZ0","Comment":"Wars are worst things in life and sadly we keep continuing same mistakes because of bloody old politicians who thirst for wars for their interests and leave people die . All governments are involved in world and no one is innocent . Imagine no wars everywhere and peace , but that is impossible , because evils surround us .","Likes":"1.0","Sentiment":"0.0"}
{"":"827","Video ID":"CBNHQyXOcjE","Comment":"47 में ही जनसंख्या बदली हो गई होती तो आज देश में गद्दार नहीं होते","Likes":"53.0","Sentiment":"1.0"}
{"":"828","Video ID":"CBNHQyXOcjE","Comment":"विवादित कैसे है? \nसाबित करो\nजो उस में लिखा \nउसको पढने मात्र से विवाद \nहो जाता है तो उस को मिटा दो  ?","Likes":"30.0","Sentiment":"1.0"}
{"":"829","Video ID":"CBNHQyXOcjE","Comment":"ये पहले भारत से बाहरी मझब मुस्लिम में कन्वर्ट होते और फिर हमारे घर भारत में भारत के मूल निवासी को हिंदुओं को ही आँख दिखाते 😡 नहीं चलेगा","Likes":"50.0","Sentiment":"1.0"}
{"":"830","Video ID":"CBNHQyXOcjE","Comment":"जय भवानी we support T raja singh","Likes":"12.0","Sentiment":"1.0"}
{"":"831","Video ID":"CBNHQyXOcjE","Comment":"हिंदुस्तान का  एक ही धर्म है सनातन जिनको दूसरा धर्म और संविधान पसंद है वह वहा जाकर रह सकते ही","Likes":"14.0","Sentiment":"1.0"}
{"":"832","Video ID":"CBNHQyXOcjE","Comment":"रशिद , शदाब पहले मुस्लिम में कन्वर्ट होते और फिर बाहरी मझब के चक्कर में हमारे ही घर में हमको ही आँख दिखाते 😡 नहीं चलेगा","Likes":"15.0","Sentiment":"1.0"}
{"":"833","Video ID":"CBNHQyXOcjE","Comment":"ये कांग्रेस के नेता को जेल भेजो ये ना संविधान को मानते ना देश को मानते हैं मुसलमान","Likes":"14.0","Sentiment":"1.0"}
{"":"834","Video ID":"CBNHQyXOcjE","Comment":"कोई भी विपक्षी नेता हो अथवा समर्थक जेहाद पर सर तन से जुदा के मामले पर एक लाइन मे मजम्मत करके हमे नफरती बताते नही थकते अरे भाई हम नफरत करने वाले लोग किसी का गाला नही काटते लेकिन मुनौवर फारूखी के खिलाफ एक शब्द नही लेकिन डी राजा के लिए बड़े बड़े बकवास करने वाले","Likes":"13.0","Sentiment":"1.0"}
{"":"835","Video ID":"CBNHQyXOcjE","Comment":"बेबी चौहान,मुन्नवर फारूखी जब हमारे अराध्य का मजाक बनाया,तब तो चुप था।","Likes":"34.0","Sentiment":"1.0"}
{"":"836","Video ID":"CBNHQyXOcjE","Comment":"जो किताब मे लिखा है।वो भि नही बोलना चाहिए।क्या है यार -जितने भी ताकतवर देस है सबको सोचना चाहिए।ये बहुत गम्भीर हे।","Likes":"8.0","Sentiment":"1.0"}
{"":"837","Video ID":"Ccc0GvjuqkQ","Comment":"The problem with this that by focusing on totally different thing rather than better content we, subscribers are paying the price with increasing subscription fee.","Likes":"207.0","Sentiment":"0.0"}
{"":"838","Video ID":"Ccc0GvjuqkQ","Comment":"Netflix is getting into video games for the same reason Apple is launching a car and Amazon is getting into healthcare. These high high tech company have to constantly keep growing in order to justify their insane valuations, and in many cases their core businesses wont offer enough revenue to satisfy investors growth expectations","Likes":"534.0","Sentiment":"1.0"}
{"":"839","Video ID":"Ccc0GvjuqkQ","Comment":"Netflix in a lot of trouble now especially as more market competition comes in from other distributors. This move into gaming will not do them any favours.","Likes":"204.0","Sentiment":"0.0"}
{"":"840","Video ID":"Ccc0GvjuqkQ","Comment":"The reason Netflix is struggling is because they keep losing content, their own content, when it's good, is constantly neglected, and they keep raising the price without adding commensurate value to justify it. Getting into games demonstrates that they are not recognizing what they're doing wrong and simply trying to find a new source of revenue instead of fixing their faults. People are getting sick of having the price increased while more and more good content disappears or takes far too long to update. People are used to getting the next season of a series once every year, but many of them are taking 2 to 3 years to release, even before COVID.","Likes":"9.0","Sentiment":"0.0"}
{"":"841","Video ID":"Ccc0GvjuqkQ","Comment":"When I first got into watching Netflix, there were a lot of low budget but very original and interesting documentaries and TV series on it. However in recent times, I feel like a lot of the diversity in the platform has gone.","Likes":"53.0","Sentiment":"2.0"}
{"":"842","Video ID":"Ccc0GvjuqkQ","Comment":"This is the problem with these big companies, their core offering starts to fail and they think moving focus elsewhere is the answer instead of making sure their core offering is decent.","Likes":"412.0","Sentiment":"0.0"}
{"":"843","Video ID":"Ccc0GvjuqkQ","Comment":"I worked in retail for most of my life and the one thing I have never forgotten is the fact that once you lose a customer you are going to play hell trying to get them back regardless of what you do.","Likes":"65.0","Sentiment":"0.0"}
{"":"844","Video ID":"Ccc0GvjuqkQ","Comment":"I think it’s so silly that Netflix feels the need to compete with YouTube and TikTok. I think these platforms should be able to exist together in harmony as they each offer very different products. Eg. People can follow along with reactions/reviews and video essays while watching a Netflix series.\n\nPeople also don’t typically like when YouTubers are given a large budget like with YouTube Red originals, so Netflix buying out certain YouTubers is not the right idea…","Likes":"36.0","Sentiment":"0.0"}
{"":"845","Video ID":"Ccc0GvjuqkQ","Comment":"Honestly maybe it would have made more sense to commission more games based on their original IPs. Yeah it takes longer to come out, but you’ll get better quality and hopefully better return on investment","Likes":"87.0","Sentiment":"2.0"}
{"":"846","Video ID":"Ccc0GvjuqkQ","Comment":"I think this is gonna take Netflix back to its feets, it just needs more perseverance. And the ability to be positive minded","Likes":"4.0","Sentiment":"2.0"}
{"":"847","Video ID":"4mgePWWCAmA","Comment":"Linus!!! Just turn the key lights  180 and bounce them off the walls. You’ll get a much softer glow and shadow and way more even lighting. It’s such a simple fix. I’m not sure where along the lines people got the idea to beam the lights directly at your face 😅","Likes":"456.0","Sentiment":"2.0"}
{"":"848","Video ID":"4mgePWWCAmA","Comment":"Dan continues to be my new favorite, he has such an air of confidence about him and a comforting presence. Like Dan shows up and you just know things are going to be fine.","Likes":"962.0","Sentiment":"2.0"}
{"":"849","Video ID":"4mgePWWCAmA","Comment":"Dan managing to set up his soldering station on the one box they needed was incredibly amusing to me","Likes":"518.0","Sentiment":"2.0"}
{"":"850","Video ID":"4mgePWWCAmA","Comment":"Linus: *Gets on his employee's cases for all the stuff stolen from the office*\nAlso Linus: *Proudly talks about all the stuff stolen from work he's using in his upgraded setup*\n\nLinus: \"Why are you using this monitor as a table?\"\nAlso Linus: *Uses the monitor as a chair* \n\nThis video was hilarious","Likes":"194.0","Sentiment":"2.0"}
{"":"851","Video ID":"4mgePWWCAmA","Comment":"Linus: \"This is not a table.\"\nAlso Linus: Let's use this as a chair!","Likes":"304.0","Sentiment":"1.0"}
{"":"852","Video ID":"4mgePWWCAmA","Comment":"Dan the man. Saving the day. Riley needs to give him his own theme like Brian the Electrician.","Likes":"3371.0","Sentiment":"2.0"}
{"":"853","Video ID":"4mgePWWCAmA","Comment":"Dan continues to be a favourite for me. He's like the incredibly patient, but long-suffering Dad, who just gets on with things","Likes":"36.0","Sentiment":"2.0"}
{"":"854","Video ID":"4mgePWWCAmA","Comment":"Dan is a treasure. Your channel has long lacked a Mr. fixit type and while I am sad it's not me, Dan appears quite capable and funny.","Likes":"134.0","Sentiment":"2.0"}
{"":"855","Video ID":"4mgePWWCAmA","Comment":"Blows my mind how quickly Dan became the \"rock\" upon which all things Linus stands...Love it","Likes":"274.0","Sentiment":"2.0"}
{"":"856","Video ID":"4mgePWWCAmA","Comment":"Hey Linus, a good trick for streaming lights: bounce them off the wall.  Much easier on the eyes, and a nice softer look.\nAlso, for indoors, I'd recommend a hyper-cardioid mic (looks like a short shotgun) like the Audio-Technica AT4053B.","Likes":"13.0","Sentiment":"2.0"}
{"":"857","Video ID":"wXjxEphvceM","Comment":"What’s your favorite SPORT? 🏀⚽️🏐🎾🏈⚾️🏒⛳️🥅🥊⛸⛷🏋️‍♀️🏂 https://youtu.be/A-nAyt1ATbk","Likes":"68.0","Sentiment":"1.0"}
{"":"858","Video ID":"wXjxEphvceM","Comment":"Let’s all appreciate the effort he makes in his videos just so we don’t miss anything and to *keep us happy* \n💙 💙","Likes":"50.0","Sentiment":"2.0"}
{"":"859","Video ID":"wXjxEphvceM","Comment":"*Let’s all appreciate the effort he makes in his videos just so we don’t miss anything and to keep us happy* 💙 💙","Likes":"36.0","Sentiment":"2.0"}
{"":"860","Video ID":"wXjxEphvceM","Comment":"*Can we just take a moment to appreciate how much time and effort he put into these videos?*\n It's unbelievable, and I think they deserve a lot more than that  💘 💘","Likes":"34.0","Sentiment":"2.0"}
{"":"861","Video ID":"wXjxEphvceM","Comment":"*Let's take the moment to appreciate how much effort and time he puts into his content for us*  💙 💙","Likes":"34.0","Sentiment":"2.0"}
{"":"862","Video ID":"wXjxEphvceM","Comment":"Can  we just appreciate how much work he puts into his videos just to entertain us?! It’s amazing!!","Likes":"0.0","Sentiment":"2.0"}
{"":"863","Video ID":"wXjxEphvceM","Comment":"*26:10*\n*Let’s just appreciate how they always manage to put a smile on our faces whenever we feel negative!*\n🙂","Likes":"0.0","Sentiment":"2.0"}
{"":"864","Video ID":"wXjxEphvceM","Comment":"*31:35*\n*Let’s just appreciate how they always manage to put a smile on our faces whenever we feel negative!*\n😀","Likes":"1.0","Sentiment":"2.0"}
{"":"865","Video ID":"wXjxEphvceM","Comment":"*19:57*\n*Let’s just appreciate how they always manage to put a smile on our faces whenever we feel negative!*\n😀","Likes":"0.0","Sentiment":"2.0"}
{"":"866","Video ID":"wXjxEphvceM","Comment":"*55:13*\n*I'm honestly impressed by the time and effort you put into these videos, Keep it up!*\n😁","Likes":"0.0","Sentiment":"2.0"}
{"":"867","Video ID":"iRxsHyRJnnQ","Comment":"Selamat mister udah 1JT semoga bisa nyampe 2 JT Aminn👏🤝","Likes":"12.0","Sentiment":"1.0"}
{"":"868","Video ID":"iRxsHyRJnnQ","Comment":"Sehat selalu mister dan semoga mister 2 JT subscriber dan semangat terus mister bikin konten nya ✨⚡","Likes":"6.0","Sentiment":"1.0"}
{"":"869","Video ID":"iRxsHyRJnnQ","Comment":"Selamat 1 juta subs Mister😁","Likes":"4.0","Sentiment":"1.0"}
{"":"870","Video ID":"iRxsHyRJnnQ","Comment":"SEmagat mister!bikin kontenya𓆩😁𓆪","Likes":"4.0","Sentiment":"1.0"}
{"":"871","Video ID":"iRxsHyRJnnQ","Comment":"Semagat mister semoga mister sehat selalu aminnn mister lanjut hungry shark dong please","Likes":"4.0","Sentiment":"1.0"}
{"":"872","Video ID":"iRxsHyRJnnQ","Comment":"Halo mister coba besok mister main stumble guys lagi dong mister☺️☺️☺️","Likes":"2.0","Sentiment":"2.0"}
{"":"873","Video ID":"iRxsHyRJnnQ","Comment":"Selamat mister dapet 1 jt 🥳🥳🥳","Likes":"2.0","Sentiment":"2.0"}
{"":"874","Video ID":"iRxsHyRJnnQ","Comment":"Mister lanjutin dong stumble guys👍👍","Likes":"2.0","Sentiment":"2.0"}
{"":"875","Video ID":"iRxsHyRJnnQ","Comment":"Selamat mister udah 1 JUTA subscriber semoga mister bisa mecapai 2 JUTA subscriber AMIN!!!","Likes":"0.0","Sentiment":"1.0"}
{"":"876","Video ID":"iRxsHyRJnnQ","Comment":"Mister kalo mister dapet 2jt subscriber mister mau ngapain??","Likes":"2.0","Sentiment":"1.0"}
{"":"877","Video ID":"WBK2_lD7KGA","Comment":"I respect to everyone who were involved in this, Seriously the best piece that I' ve ever seen on YouTube, HATS OFF TO WELL ALL ! LOVE YOUR VIDEOS!! 😊🥰🥰....","Likes":"10.0","Sentiment":"2.0"}
{"":"878","Video ID":"WBK2_lD7KGA","Comment":"\"\"\"\"I Respect every one who were involved in this, seriously the best piece that I've ever seen on YouTube, hats off to well all  ! Love your videos  ❤❤🤍🤍❣️😈😈","Likes":"1.0","Sentiment":"2.0"}
{"":"879","Video ID":"WBK2_lD7KGA","Comment":"One of the best thing about Dude is that he\r\nnever takes credit for himself when he achieves,\r\nsomething. He always request us the audience\r\nand his team, and he is always polite in all of his\r\nvideos. We congratulations ourselves on this\r\nachievement. More to come and everything to\r\ncome💜","Likes":"0.0","Sentiment":"2.0"}
{"":"880","Video ID":"WBK2_lD7KGA","Comment":"Let's take the moment to appreciate how much effort he puts into the content for us ... ❤","Likes":"24.0","Sentiment":"2.0"}
{"":"881","Video ID":"WBK2_lD7KGA","Comment":"One of the best thing about Dude is that he\r\nnever takes credit for himself when he achieves,\r\nsomething. He always request us the audience\r\nand his team, and he is always polite in all of his\r\nvideos. We congratulations ourselves on this\r\nachievement. More to come and everything to\r\ncome💜","Likes":"0.0","Sentiment":"2.0"}
{"":"882","Video ID":"WBK2_lD7KGA","Comment":"One of the best thing about Dude is that he\r\nnever takes credit for himself when he achieves,\r\nsomething. He always request us the audience\r\nand his team, and he is always polite in all of his\r\nvideos. We congratulations ourselves on this\r\nachievement. More to come and everything to\r\ncome💜","Likes":"0.0","Sentiment":"2.0"}
{"":"883","Video ID":"WBK2_lD7KGA","Comment":"One of the best thing about Dude is that he\r\nnever takes credit for himself when he achieves,\r\nsomething. He always request us the audience\r\nand his team, and he is always polite in all of his\r\nvideos. We congratulations ourselves on this\r\nachievement. More to come and everything to\r\ncome💜","Likes":"0.0","Sentiment":"2.0"}
{"":"884","Video ID":"WBK2_lD7KGA","Comment":"One of the best thing about Dude is that he\r\nnever takes credit for himself when he achieves,\r\nsomething. He always request us the audience\r\nand his team, and he is always polite in all of his\r\nvideos. We congratulations ourselves on this\r\nachievement. More to come and everything to\r\ncome💜","Likes":"0.0","Sentiment":"2.0"}
{"":"885","Video ID":"RRaznaiwf9A","Comment":"Je suis tranquillement en train de regarder une vod de MV sur Issac.\nEt la paf une vidéo de M4f avec écrit DU SANG ET DES CRANES !!! Merci M4f de toujours me faire marrer.","Likes":"4.0","Sentiment":"1.0"}
{"":"886","Video ID":"RRaznaiwf9A","Comment":"On croit en toi la caméra ! Ne lâche pas!","Likes":"4.0","Sentiment":"1.0"}
{"":"887","Video ID":"RRaznaiwf9A","Comment":"27:22 oui ! je constate l'effet de netteté et de clarté , c'est tellement mieux maintenant M4f Wahouu !😊","Likes":"0.0","Sentiment":"2.0"}
{"":"888","Video ID":"RRaznaiwf9A","Comment":"Oh oui enfin je vais pouvoir revoir ces élus de Khorne à hache double !!!!!","Likes":"3.0","Sentiment":"1.0"}
{"":"889","Video ID":"RRaznaiwf9A","Comment":"Salut.\nHey 😄tu oublies toujours tes héros qui ne sont pas dans les armées...\nTu pourrais éventuellement leurs faire prendre des niveaux en leurs faisant des actions contre les hommes bêtes?😅","Likes":"2.0","Sentiment":"1.0"}
{"":"890","Video ID":"RRaznaiwf9A","Comment":"Y a pas à dire, Khorne, c'est quand même la classe.\nBon, faut effectivement aimer le rouge, sinon c'est compliqué, mais les modèles sont quand même magnifiques.","Likes":"0.0","Sentiment":"1.0"}
{"":"891","Video ID":"RRaznaiwf9A","Comment":"Bonjour m4f merci pour tes videos :) je t'ecrit pour te demander quelque chose ^^ j'aimerais savoir si c'est normal qu'en jouant morati sur IE qund je prend une porte d'ultuan aucune garnison n'apparait et aussi si c'est normal que en jouant boris ursus possedant totalement la province ou on debute et n'ayant plus du tout de corruption je recrute un nouveau seigneur il prend de l'usure ?? merci et bonne journée","Likes":"0.0","Sentiment":"1.0"}
{"":"892","Video ID":"RRaznaiwf9A","Comment":"mes vasseaux se font déchirer à chaque fois que j'essai de m'etendre d'un coté avec valkia c'est affolant :o","Likes":"1.0","Sentiment":"1.0"}
{"":"893","Video ID":"RRaznaiwf9A","Comment":"C'est quand même dommage... qu'il n'y ai pas des aspirants champions de Khorne.","Likes":"0.0","Sentiment":"1.0"}
{"":"894","Video ID":"RRaznaiwf9A","Comment":"La miniature est trop stylé !","Likes":"1.0","Sentiment":"1.0"}
{"":"895","Video ID":"YeqhIN6Dg_U","Comment":"ILets all appreciate the amount of effort this man puts in his videos, amazing. Keep grinding bro, I love the videos❤","Likes":"51.0","Sentiment":"2.0"}
{"":"896","Video ID":"YeqhIN6Dg_U","Comment":"Hey I have being a fan since you guys started I followed you guys since I was young.keep up the great work 😊","Likes":"5.0","Sentiment":"2.0"}
{"":"897","Video ID":"YeqhIN6Dg_U","Comment":"2:16 that face tho😂","Likes":"2.0","Sentiment":"1.0"}
{"":"898","Video ID":"YeqhIN6Dg_U","Comment":"Great job guys! Love watching you guys with my 5 year old son.  Wish I had seen this video a couple days ago before we spent so much time confused by all the Dragon Ball Z stuff too 😂","Likes":"1.0","Sentiment":"2.0"}
{"":"899","Video ID":"YeqhIN6Dg_U","Comment":"Dragon Ball: Goku is a kid with a monkey tail where he lives in a small house with a dragon ball. He meets Bulma and they go searching for Dragon balls to summon a dragon name shenron. He grants you one wish. He trains with a kid name Krillin which they become best friends. Krillin get killed by a demon king, the demon king gets killed by Goku with a kamehameha. He spits out an egg with his son in it name Piccolo. Goku is a teenager. He meets Chi Chi in the Martial Arts Tournament and all his friends. He fight Piccolo and wins the Tournament. Goku and Chi Chi have a son and Gohan. That’s the end of Dragon Ball. Now for Dragon Ball Z","Likes":"1.0","Sentiment":"1.0"}
{"":"900","Video ID":"YeqhIN6Dg_U","Comment":"You Guys make my day every time you play together as a family like this keep it up 👍","Likes":"0.0","Sentiment":"2.0"}
{"":"901","Video ID":"YeqhIN6Dg_U","Comment":"You’ll do awesome videos I always love watching them","Likes":"0.0","Sentiment":"2.0"}
{"":"902","Video ID":"YeqhIN6Dg_U","Comment":"WOW you guys are amazing I've been watching you forever and I LOVE your videos. Keep up the great work!!","Likes":"0.0","Sentiment":"2.0"}
{"":"903","Video ID":"YeqhIN6Dg_U","Comment":"Great job keep the content up kcity fam🙂","Likes":"0.0","Sentiment":"2.0"}
{"":"904","Video ID":"YeqhIN6Dg_U","Comment":"Love you guys so much ❤️ please keep up the good work","Likes":"0.0","Sentiment":"2.0"}
{"":"905","Video ID":"4ndP7aEL48w","Comment":"Wie fandet ihr die OPENING NIGHT LIVE?","Likes":"22.0","Sentiment":"1.0"}
{"":"906","Video ID":"4ndP7aEL48w","Comment":"Hui... das noch um 1:30Uhr rauszuhauen, ist ne feine Sache 😃👍\n\nDanke. Hab ich was für den Rest der Nachtschicht 🥳","Likes":"33.0","Sentiment":"2.0"}
{"":"907","Video ID":"4ndP7aEL48w","Comment":"Ede war meistens derjenige, der am offensten den Ankündigungen gegenüberstand. What a time to be alive :D","Likes":"106.0","Sentiment":"2.0"}
{"":"908","Video ID":"4ndP7aEL48w","Comment":"Vielen Dank, dass ihr euch die Mühe gemacht und die einzelnen Kapitel erstellt habt ❤️","Likes":"40.0","Sentiment":"2.0"}
{"":"909","Video ID":"4ndP7aEL48w","Comment":"Eine tolle Opening Night, Danke euch!","Likes":"1.0","Sentiment":"1.0"}
{"":"910","Video ID":"4ndP7aEL48w","Comment":"berti verdammt guten job gemacht! gz","Likes":"9.0","Sentiment":"1.0"}
{"":"911","Video ID":"4ndP7aEL48w","Comment":"Schöner Einstieg in die Spacecom 2022!","Likes":"10.0","Sentiment":"1.0"}
{"":"912","Video ID":"4ndP7aEL48w","Comment":"Ich privat finde dieses Gewese um die Spiele auch manchmal hart ermüdend: Da wird kein Spiel vorgestellt, sondern das Team das dann 5 Minuten mit Buzzwörtern um sich wirft \"New Expierence\" \"New Lifestyle\" und \"Exciting World\" und man sieht dann gefühlt 20 Sekunden den Teaser zum Spiel. \nWenn die nix zu zeigen haben sollten sie es einfach lassen, kann alle auf dem Sofa verstehen","Likes":"25.0","Sentiment":"1.0"}
{"":"913","Video ID":"4ndP7aEL48w","Comment":"Für mich sind einige Spiele interessant. Nur fehlendes Gameplay nervt. War also in Ordnung.","Likes":"6.0","Sentiment":"1.0"}
{"":"914","Video ID":"4ndP7aEL48w","Comment":"Über Simon könnte ich mich jedesmal beömmeln - man merkt das er älter wird, schreit immer so random in die Runde rein mit seinem Headset auf dem Kopf :D","Likes":"4.0","Sentiment":"1.0"}
{"":"915","Video ID":"aVYgohhJTwo","Comment":"KHUYẾN MÃI TỚI 50% CÁC MẪU TAI NGHE CHUYÊN GAME CỰC RẺ, XEM NGAY:\r\n- Tai Nghe BLUETOOTH Không Dây Chuyên Game: https://shope.ee/2VEARml6Y4\r\n- Tai Nghe G10 Có Mic Rời Lọc Âm Giá Rẻ: https://shope.ee/9K4WGYBYZs\r\n- Tai Nghe RP12 Siêu Rẻ Chuyên Game Free Fire: https://shope.ee/9K4WGZoPGT\r\n- Tai Nghe X6 Nghe Nhạc Hay Chơi Game Đỉnh: https://shope.ee/9K4WGb1PM0\r\n- Tai Nghe KT-02 Micro Chuyên Dụng Chơi Game: https://shope.ee/AJx3STWCHY\r\n- Tai Nghe G-Pro Cổng Type-C Cao Cấp Chuyên Game: https://shope.ee/4zvX6hcUfT\r\n- Quạt Tản Nhiệt Sò Lạnh MEMO DL05 Siêu Mát: https://shope.ee/AJxZMleRcm\r\n- Quạt Tản Nhiệt Điện Thoại MEMO FL05 Giá Rẻ: https://shope.ee/6A80P9kINd","Likes":"18.0","Sentiment":"1.0"}
{"":"916","Video ID":"aVYgohhJTwo","Comment":"Chúc Chú Ri Mạnh Khỏe Nha Chú ❤️","Likes":"1.0","Sentiment":"2.0"}
{"":"917","Video ID":"aVYgohhJTwo","Comment":"chú rikaki thử so famas thám tử 2 tốc bắn và thần khí đại dương xem cây nào bắn nhanh hơn vậy chú","Likes":"1.0","Sentiment":"1.0"}
{"":"918","Video ID":"aVYgohhJTwo","Comment":"Chú làm video chấm điểm súng nâng cấp đi chú","Likes":"2.0","Sentiment":"1.0"}
{"":"919","Video ID":"aVYgohhJTwo","Comment":"Chúc chú rỉ nhiều sức khỏe và ra nhiều video hay hơn ạ🥰🥰","Likes":"1.0","Sentiment":"1.0"}
{"":"920","Video ID":"aVYgohhJTwo","Comment":"Chúc chú ri buổi chiều vui vẻ","Likes":"1.0","Sentiment":"1.0"}
{"":"921","Video ID":"aVYgohhJTwo","Comment":"Chúc chú buổi trưa vui vẻ bên gia đình ạ","Likes":"1.0","Sentiment":"1.0"}
{"":"922","Video ID":"aVYgohhJTwo","Comment":"Chú hải làm top những vòng quay vàng  đẹp nhất  p2 đi ạ.","Likes":"6.0","Sentiment":"1.0"}
{"":"923","Video ID":"aVYgohhJTwo","Comment":"Chú ri ơi Garena sửa vòng quay ma thuật chưa ạ nãy cháu vừa chơi vẫn kh quay ra mảng ma thuật 🤬","Likes":"2.0","Sentiment":"1.0"}
{"":"924","Video ID":"aVYgohhJTwo","Comment":"Chú Ri ơi 9 tuần từ khi ra mắt trở lại nắm đấm long quyền rồi mà garena vẫn không fix lỗi thiếu hiệu ứng và hoạt ảnh khi vô trận","Likes":"1.0","Sentiment":"1.0"}
{"":"925","Video ID":"t3L2dLPzvrM","Comment":"I'm surprised getting all the collectibles didn't even get an honorable mention. There's been more than enough people who couldn't 100% the Arkham games simply because they didn't like the Riddler trophy collecting quest (especially Arkham Knight due to how many times you had to use the batmobile JUST for those collectibles).","Likes":"13.0","Sentiment":"0.0"}
{"":"926","Video ID":"t3L2dLPzvrM","Comment":"The one that annoyed me was the Borderlands 1 when to obtain you had to play online with someone from Gearbox or with someone who already had the trophy. They changed it for the rerelease to playing with three players at once.","Likes":"32.0","Sentiment":"0.0"}
{"":"927","Video ID":"t3L2dLPzvrM","Comment":"I always adored FFVIII. My older brother gifted me with the strategy guide when I first bought it, so that may have something to do with it lol. That said, if you're trying to 100% FFVIII on the og north american release, good luck. A strategy guide will not help you get the ribbon","Likes":"20.0","Sentiment":"2.0"}
{"":"928","Video ID":"t3L2dLPzvrM","Comment":"The original infamous hurt my soul. I played through the campaign twice on hard to get the platinum only to find out while I was doing cleanup that the stunt master trophy can't be completed post game. I had all but one stunt, to knock 3 enemies off a roof at once. When you clear out an area enemies no longer spawn in large numbers, therefore there isn't enough enemies to get the stunt. I didn't have it in me to start another campaign. The sad part is I had tried the stunt on multiple occasions only for it to glitch and not award the stunt.","Likes":"15.0","Sentiment":"0.0"}
{"":"929","Video ID":"t3L2dLPzvrM","Comment":"AC3 was super annoying when first released because of having to pass the mission the first time without any retry. \n\nProblem was, the controls were clunky af and the goals of the missions most of the time were annoying or without too much logic like \"do not touch water\".","Likes":"22.0","Sentiment":"0.0"}
{"":"930","Video ID":"t3L2dLPzvrM","Comment":"Multiplayer trophies tied to the platinum will always, ALWAYS be the worst.","Likes":"24.0","Sentiment":"0.0"}
{"":"931","Video ID":"t3L2dLPzvrM","Comment":"Multi-player and single player trophies/achievements 100% should be separate as their own 100% completion lists","Likes":"126.0","Sentiment":"1.0"}
{"":"932","Video ID":"t3L2dLPzvrM","Comment":"So glad you did multiplayer awards lumped with single player awards. That is the biggest bullshit for single game players that don't want to listen to children screaming, neck beards eating or just racist hateful crap, just for a trophy.","Likes":"4.0","Sentiment":"0.0"}
{"":"933","Video ID":"t3L2dLPzvrM","Comment":"I honestly feel like COD MW on did it best on Xbox 360. Achievements for single player and challenges for multiplayer. That was 2007. Now I’m 34 with a wife and kids. It’s almost unimaginable trying to do 100% a game with multiplayer supporting a family and working.","Likes":"4.0","Sentiment":"2.0"}
{"":"934","Video ID":"t3L2dLPzvrM","Comment":"You guys are really getting your money's worth with the new background music.","Likes":"34.0","Sentiment":"2.0"}
{"":"935","Video ID":"UZFeOxoRe8g","Comment":"Nếu các bạn muốn xem nhiều video hơn về tựa game nông dân Farming Simulator 22 trên kênh ND Gaming của mình thì hãy ủng hộ mình bằng cách Bình Luận thật nhiều phía dưới video nhé\r\nỦng hộ mình bằng cách Like, Share và nhớ bấm nút Đăng Kí kênh, cũng như bấm vào cái chuông kế bên để nhận được nhiều thông báo mới nhất trên kênh mình nè ","Likes":"29.0","Sentiment":"1.0"}
{"":"936","Video ID":"UZFeOxoRe8g","Comment":"Làm tiếp tập 14 đi ah hay quá :)))) 🥰","Likes":"6.0","Sentiment":"2.0"}
{"":"937","Video ID":"UZFeOxoRe8g","Comment":"21:00 Xếp mấy cái đầu rất mượt, đến cái cuối để lên đổ cả chồng, xem có tức không chứ 😁","Likes":"7.0","Sentiment":"1.0"}
{"":"938","Video ID":"UZFeOxoRe8g","Comment":"Sự tích chiếc bán tải thần kì là có thật nha ae =))","Likes":"2.0","Sentiment":"1.0"}
{"":"939","Video ID":"UZFeOxoRe8g","Comment":"Em chúc anh có thật nhiều sức khẻo . Và ra thật nhiều video hơn nè :)))","Likes":"0.0","Sentiment":"2.0"}
{"":"940","Video ID":"UZFeOxoRe8g","Comment":"Vui quá làm thêm nhiều tập về FS 22 này nữa nhé bạn","Likes":"0.0","Sentiment":"1.0"}
{"":"941","Video ID":"UZFeOxoRe8g","Comment":"anh làm clip tấu hài là chính hay lắm.Chúc anh nhiều sức khỏe và ra clip nhiều và chất lượng hơn","Likes":"1.0","Sentiment":"1.0"}
{"":"942","Video ID":"UZFeOxoRe8g","Comment":"21:00 khi anh duy muốn chở hàng nhưng ko đủ xiền mua xe to :3","Likes":"2.0","Sentiment":"1.0"}
{"":"943","Video ID":"UZFeOxoRe8g","Comment":"=)) chiếc xe bất ổn, kể từ tập này quá 🤣🤣🤣","Likes":"1.0","Sentiment":"1.0"}
{"":"944","Video ID":"UZFeOxoRe8g","Comment":"hóng ra tập tiếp theo quá 😁","Likes":"0.0","Sentiment":"1.0"}
{"":"945","Video ID":"PyUwWSrFy5E","Comment":"When they sell this house some day the open house tours are gonna be wild. They'll need a real estate agent with a sense of humor","Likes":"1069.0","Sentiment":"1.0"}
{"":"946","Video ID":"PyUwWSrFy5E","Comment":"Glad that they are doing all this work for us so that we don't. I can't imagine how much this devalues the house.","Likes":"95.0","Sentiment":"1.0"}
{"":"947","Video ID":"PyUwWSrFy5E","Comment":"I love watching these normal things being turned into cool hidden forts ! Keep up the great work! MUST HAVE SNACKS","Likes":"2.0","Sentiment":"2.0"}
{"":"948","Video ID":"PyUwWSrFy5E","Comment":"Love all your unique and fun video ideas Andrew and Justin! Keep up the phenomenal work 🙌","Likes":"55.0","Sentiment":"2.0"}
{"":"949","Video ID":"PyUwWSrFy5E","Comment":"I love watching these normal things being turned into cool hidden forts ! Keep up the great work! MUST HAVE SNACKS","Likes":"0.0","Sentiment":"2.0"}
{"":"950","Video ID":"PyUwWSrFy5E","Comment":"I love watching these normal things being turned into cool hidden forts ! Keep up the great work! MUST HAVE SNACKS","Likes":"0.0","Sentiment":"2.0"}
{"":"951","Video ID":"PyUwWSrFy5E","Comment":"I love watching these normal things being turned into cool hidden forts ! Keep up the great work! MUST HAVE SNACKS","Likes":"0.0","Sentiment":"2.0"}
{"":"952","Video ID":"PyUwWSrFy5E","Comment":"I love watching these normal things being turned into cool hidden forts ! Keep up the great work! MUST HAVE SNACKS","Likes":"0.0","Sentiment":"2.0"}
{"":"953","Video ID":"PyUwWSrFy5E","Comment":"I love watching these normal things being turned into cool hidden forts ! Keep up the great work! MUST HAVE SNACKS","Likes":"0.0","Sentiment":"2.0"}
{"":"954","Video ID":"PyUwWSrFy5E","Comment":"😘  *I love how there making permanent changes to their house for our entertainment* ❤️ 👍","Likes":"6.0","Sentiment":"2.0"}
{"":"955","Video ID":"GiHBWPRybpw","Comment":"*Artistic Music Mix 2022: Top 50 Songs ♫ Best NCS Gaming Music ♫ Best Of EDM Remixes 2022*\nTks for listening <3\n---\n🔥 Tracklist: \r\n00:00 BEAUZ - Memories (Official Audio) ft. Linney\r\nStream/Download: https://ffm.to/beauz-memories\r\n02:52 King CAAN - Go Again (feat. ELYSA)\r\n05:51 Diviners & Azertion - Feelings [NCS Release]\r\n08:39 RedMoon & Meron Ryan - Heavyweight [NCS Release]\r\n11:53 Voster & Gallardo x Vikrant Gautam & Ferra - Weight For You [Glow Records]\r\n15:27 Alex Skrindo & Miza - Thinkin' [NCS Release]\r\n15:57 Jim Yosef & Anna Yvette - Linked [NCS Release]\r\n21:39 Eminence & Supermans Feinde - Night Goes On (feat. Q'AILA) [Monstercat Release]\r\n25:44 Denzell, Aitor Blond, Jone Fields & Jetason - We Belong [Glow Records]\r\n29:14 Sabai - Scared [Monstercat Release]\r\n32:01 Distrion - Alibi (ft. Heleen) [NCS Release]\r\n35:09 Alkaz - Outer Space [Glow Records] \r\n38:29 Tom Kenny - Wait For Me [Glow Records]\r\n42:18 Jim Yosef - Can't Wait (feat. Anna Yvette) [NCS Release]\r\n45:44 Trivecta - Ghost in the Machine [Monstercat Release]\r\n50:09 ARHEX & HHMR - Eternity [Glow Records]\r\n52:57 Ajax & West Collins - Enemy (feat. Philipp Reise)\r\nDownload/Stream: https://jupitamusic.com/enemy/\r\n56:11 Diviners feat. Contacreast - Tropic Love [NCS Release]\r\n1:00:48 Severman, Hunter Grant & Arvenius - Fight The Good Fight [Glow Records]\r\n1:04:56 Cartoon - Your Stories (feat. Koit Toome) [NCS Release]\r\n1:08:02 Joysic & Robbie Rosen - How To Save A Life [Glow Records]\r\n1:11:29 Marshmello - Alone (Streex Remake) [Monstercat Official Music Video]\r\n1:15:21 cont...","Likes":"3.0","Sentiment":"1.0"}
{"":"956","Video ID":"GiHBWPRybpw","Comment":"*Golden*","Likes":"5.0","Sentiment":"1.0"}
{"":"957","Video ID":"GiHBWPRybpw","Comment":"really addictive, I don't believe it and I'm still here 🤦‍♂🤦‍♂🤦‍♂","Likes":"1.0","Sentiment":"0.0"}
{"":"958","Video ID":"GiHBWPRybpw","Comment":"very well done for awesome music","Likes":"0.0","Sentiment":"2.0"}
{"":"959","Video ID":"GiHBWPRybpw","Comment":"Nice edition☺💜","Likes":"0.0","Sentiment":"2.0"}
{"":"960","Video ID":"GiHBWPRybpw","Comment":"good ⚡✨🔥💯🔥","Likes":"0.0","Sentiment":"2.0"}
{"":"961","Video ID":"GiHBWPRybpw","Comment":"О новый микс, кайф","Likes":"2.0","Sentiment":"1.0"}
{"":"962","Video ID":"GiHBWPRybpw","Comment":"Cool mix💞💞","Likes":"0.0","Sentiment":"2.0"}
{"":"963","Video ID":"GiHBWPRybpw","Comment":"Top mix💞💞","Likes":"0.0","Sentiment":"2.0"}
{"":"964","Video ID":"GiHBWPRybpw","Comment":"Me and my friend had a rap battle with this beat","Likes":"1.0","Sentiment":"1.0"}
{"":"965","Video ID":"wRWhpXAMrLQ","Comment":"\"\"\"One of the best thing about this dude is that he never takes credit for himself when he achieves. He always respect  the audience ande he is polite in all of his videos\"\"\"😍🥰❤😘💖","Likes":"10.0","Sentiment":"2.0"}
{"":"966","Video ID":"wRWhpXAMrLQ","Comment":"\"One of the best thing about this dude is that he never takes credit of his own accomplishments , he always respects his audience and his teams, and he is polite in all of his videos. We congratulate ourselves on our accomplishments this video is so amazing\"","Likes":"11.0","Sentiment":"2.0"}
{"":"967","Video ID":"wRWhpXAMrLQ","Comment":"*We can all agree that she never disappoints us with his content, she is my fav YouTuber 100%*","Likes":"78.0","Sentiment":"2.0"}
{"":"968","Video ID":"wRWhpXAMrLQ","Comment":"\"One of the best thing about this dude is that he never takes credit of his own accomplishments , he always respects his audience and his teams, and he is polite in all of his videos. We congratulate ourselves on our accomplishments this video is so amazing\"","Likes":"2.0","Sentiment":"2.0"}
{"":"969","Video ID":"wRWhpXAMrLQ","Comment":"\"One of the best thing about this dude is that he never takes credit of his own accomplishments , he always respects his audience and his teams, and he is polite in all of his videos. We congratulate ourselves on our accomplishments this video is so amazing\"","Likes":"2.0","Sentiment":"2.0"}
{"":"970","Video ID":"wRWhpXAMrLQ","Comment":"One of the best thing about dude is that he never takes credit for himself when he achieves something. He always respect us, the audience and his team, and he is polite in all his videos. We congratulate ourselves on this achievement. More to come💖💓💛💛💚💙❤💗💖💝💟","Likes":"42.0","Sentiment":"2.0"}
{"":"971","Video ID":"wRWhpXAMrLQ","Comment":"\"\"one of the best things about dude is that he never takes credit for himself when he achieves something.He always respect us , the audience,and his team, and he always polite in all of his video♥️❤️","Likes":"1.0","Sentiment":"2.0"}
{"":"972","Video ID":"wRWhpXAMrLQ","Comment":"\"\"\"\"\"\"\"'\"\"SO WE CAN ALL AGREE THAT THIS MAN NEVER\nDISAPPOINT US WITH HIS VIDEOS\"\"\"\"\"\"\"\"\"\"\"\"❤️🤩","Likes":"0.0","Sentiment":"2.0"}
{"":"973","Video ID":"wRWhpXAMrLQ","Comment":"\"\"\"\"\"\"\"'\"\"SO WE CAN ALL AGREE THAT THIS MAN NEVER\nDISAPPOINT US WITH HIS VIDEOS\"\"\"\"\"\"\"\"\"\"\"\"❤️🤩","Likes":"0.0","Sentiment":"2.0"}
{"":"974","Video ID":"wRWhpXAMrLQ","Comment":"\"one of the best things about dude is that he never takes credit for himself when he achieves something. He always respect us, the audience,and his team, and he always polite in all of his video","Likes":"0.0","Sentiment":"2.0"}
{"":"975","Video ID":"zJJ7JiG2Lvw","Comment":"The only unrealistic part is having consistent connection with very little delay because even in this decade, big pings and lags is still a common occurences.","Likes":"6651.0","Sentiment":"0.0"}
{"":"976","Video ID":"zJJ7JiG2Lvw","Comment":"As someone living in the future, I can confirm that this is perfectly accurate.","Likes":"4183.0","Sentiment":"2.0"}
{"":"977","Video ID":"zJJ7JiG2Lvw","Comment":"i remember doing this back in 2000, good times. (Talking about his mother)","Likes":"1934.0","Sentiment":"2.0"}
{"":"978","Video ID":"zJJ7JiG2Lvw","Comment":"The \"very little time delay\" is the reason why It's still considered something in the future","Likes":"760.0","Sentiment":"1.0"}
{"":"979","Video ID":"zJJ7JiG2Lvw","Comment":"This honestly sounded like a legitimate prediction until the last part. XD","Likes":"3891.0","Sentiment":"2.0"}
{"":"980","Video ID":"zJJ7JiG2Lvw","Comment":"Wow, the concept of sending games over the internet lines sounds so compelling.\nI wish online multiplayer was real 😞","Likes":"340.0","Sentiment":"2.0"}
{"":"981","Video ID":"zJJ7JiG2Lvw","Comment":"Impossible, nothing like that could ever be made.","Likes":"643.0","Sentiment":"0.0"}
{"":"982","Video ID":"zJJ7JiG2Lvw","Comment":"Man I love seeing old media predict the future correctly, they even showed the lack of joy all gamers have.","Likes":"109.0","Sentiment":"2.0"}
{"":"983","Video ID":"zJJ7JiG2Lvw","Comment":"Implying that this insult has been passed down for DECADES. \nQuickly, we must continue the legacy!","Likes":"735.0","Sentiment":"0.0"}
{"":"984","Video ID":"zJJ7JiG2Lvw","Comment":"Wow! I'm so excited for the future, alongside flying cars, 2000 is looking to be rad!!","Likes":"177.0","Sentiment":"2.0"}
{"":"985","Video ID":"f-vwWjR_3JY","Comment":"ILets all appreciate the amount of effort this man puts in his videos, amazing. Keep grinding bro, I love the videos❤","Likes":"68.0","Sentiment":"2.0"}
{"":"986","Video ID":"f-vwWjR_3JY","Comment":"Let’s take the moment to appreciate how much effort he puts into his for us. Great job mate","Likes":"74.0","Sentiment":"2.0"}
{"":"987","Video ID":"f-vwWjR_3JY","Comment":"The skins just got released and he's the first one who I've seen that have it, Love this content Him and other Fortnite Youtuber's make","Likes":"89.0","Sentiment":"2.0"}
{"":"988","Video ID":"f-vwWjR_3JY","Comment":"Was not expecting this collab! Thank you for the daily content you always kill it for us :D","Likes":"20.0","Sentiment":"2.0"}
{"":"989","Video ID":"f-vwWjR_3JY","Comment":"Love the videos and the work you put into it keep it up","Likes":"40.0","Sentiment":"2.0"}
{"":"990","Video ID":"f-vwWjR_3JY","Comment":"Best man ever his content is always good 👏","Likes":"9.0","Sentiment":"2.0"}
{"":"991","Video ID":"f-vwWjR_3JY","Comment":"Keep it up tg \nLove the content","Likes":"4.0","Sentiment":"2.0"}
{"":"992","Video ID":"f-vwWjR_3JY","Comment":"The skins just got released and he's the first one who I've seen that have it, Love this content Him and other Fortnite Youtuber's make","Likes":"47.0","Sentiment":"2.0"}
{"":"993","Video ID":"f-vwWjR_3JY","Comment":"As a destiny veteran and current destiny 2 tourneys player I think they did pretty good with Zavala and the others Ikora and exo stranger","Likes":"5.0","Sentiment":"2.0"}
{"":"994","Video ID":"gYvCj3EufhA","Comment":"Massive thank you to everyone for checking out the video. I went back and forward on making it - whether it was \"too negative\" or not - but VERY reassuring to know it's not just me noticing these things, and wanting to talk about them. Cheers! - Scott","Likes":"7.0","Sentiment":"2.0"}
{"":"995","Video ID":"gYvCj3EufhA","Comment":"I adopted a mindset of delaying my gaming brain by a year. If a game comes out in 2022, I wait until 2023. I get it at its cheapest and usually complete. I have been doing this with every game I buy for the last 5 years and I have saved so much money while enjoying the games much more.","Likes":"194.0","Sentiment":"2.0"}
{"":"996","Video ID":"gYvCj3EufhA","Comment":"I used to pre-order games to get the “collectible” toy that was sought after. The items got really cheap really fast. Not worth it. They also tell you that there may not be enough copies, that never happened! There was always enough copies!","Likes":"100.0","Sentiment":"0.0"}
{"":"997","Video ID":"gYvCj3EufhA","Comment":"Good video. These are the kinds of topics and discussions the gaming industry needs to need to be having now. Publishers, developers, the media, and gamers themselves. \n\nHave to throw one in though. For every game with a yearly release, I also have to point out games with decade or more release cycle. How long between GTA 5 and 6? Fallout 4 and 5? Skyrim and Elder Scrolls 6?","Likes":"43.0","Sentiment":"2.0"}
{"":"998","Video ID":"gYvCj3EufhA","Comment":"I wish developers would realize that forced DRM and Internet connectivity for games is a step backward. Look at the debacles GT7 and SimCity have endured; what's the point of paying a full $70 for the game if there is no guarantee you can play it at your leisure, especially if this ridiculous requirement is in place for SINGLE-PLAYER modes?\n\nIn my opinion, at that point, you can't help but wonder if spending time with the game is either fun or just another full time job. This is not why people play games.","Likes":"45.0","Sentiment":"0.0"}
{"":"999","Video ID":"gYvCj3EufhA","Comment":"When I think about the games I played the last few years, I must say, that I almost always enjoyed indie titles alot more than big IPs. So I rather pay 30€ for an indie title, that is really inspiring with fresh new ideas than wasting 60€+ on a broken AAA title without any innovations.","Likes":"32.0","Sentiment":"2.0"}